{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"name": "embedding_19", "input_length": 140, "dropout": 0.2, "init": "uniform", "input_dim": 1576890, "input_dtype": "int32", "batch_input_shape": [null, 140], "mask_zero": false, "trainable": true, "activity_regularizer": null, "output_dim": 52, "W_regularizer": null, "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_19", "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "name": "convolution1d_37", "subsample_length": 1, "nb_filter": 200, "init": "uniform", "bias": true, "filter_length": 6, "b_constraint": null, "W_constraint": null, "trainable": true, "input_length": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "name": "maxpooling1d_37", "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "name": "convolution1d_38", "subsample_length": 1, "nb_filter": 200, "init": "uniform", "bias": true, "filter_length": 6, "b_constraint": null, "W_constraint": null, "trainable": true, "input_length": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "pool_length": 66, "name": "maxpooling1d_38", "trainable": true, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_19", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_37", "init": "glorot_uniform", "input_dim": null, "bias": true, "b_constraint": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "output_dim": 200, "activation": "linear", "W_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_19", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_19", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_38", "init": "glorot_uniform", "input_dim": null, "bias": true, "b_constraint": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "output_dim": 3, "activation": "softmax", "W_regularizer": null}}]}