{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"concat_axis": -1, "mode": "concat", "dot_axes": -1, "mode_type": "raw", "output_shape_type": "raw", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "output_dim": 52, "init": "uniform", "activity_regularizer": null, "dropout": 0.2, "input_length": 140, "batch_input_shape": [null, 140], "trainable": true, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null, "name": "embedding_1_dai_model", "input_dim": 1576890}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dai_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "activation": "relu", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "uniform", "input_length": null, "W_regularizer": null, "name": "convolution1d_1_dai_model", "input_dim": null, "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_dai_model", "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "activation": "relu", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "uniform", "input_length": null, "W_regularizer": null, "name": "convolution1d_2_dai_model", "input_dim": null, "subsample_length": 1}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "output_dim": 52, "init": "uniform", "activity_regularizer": null, "dropout": 0.2, "input_length": 140, "batch_input_shape": [null, 140], "trainable": true, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null, "name": "embedding_1_tac_model", "input_dim": 428669}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "activation": "relu", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "uniform", "input_length": null, "W_regularizer": null, "name": "convolution1d_1_tac_model", "input_dim": null, "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_tac_model", "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "activation": "relu", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "uniform", "input_length": null, "W_regularizer": null, "name": "convolution1d_2_tac_model", "input_dim": null, "subsample_length": 1}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "output_dim": 52, "init": "uniform", "activity_regularizer": null, "dropout": 0.2, "input_length": 140, "batch_input_shape": [null, 140], "trainable": true, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null, "name": "embedding_1_semeval_model", "input_dim": 428669}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "activation": "relu", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "uniform", "input_length": null, "W_regularizer": null, "name": "convolution1d_1_semeval_model", "input_dim": null, "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_semeval_model", "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "activation": "relu", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "uniform", "input_length": null, "W_regularizer": null, "name": "convolution1d_2_semeval_model", "input_dim": null, "subsample_length": 1}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "output_dim": 52, "init": "uniform", "activity_regularizer": null, "dropout": 0.2, "input_length": 140, "batch_input_shape": [null, 140], "trainable": true, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null, "name": "embedding_17_mpq_model", "input_dim": 428669}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_17_mpq_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "activation": "relu", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "uniform", "input_length": null, "W_regularizer": null, "name": "convolution1d_33_mpq_model", "input_dim": null, "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_33_mpq_model", "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "activation": "relu", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "uniform", "input_length": null, "W_regularizer": null, "name": "convolution1d_34_mpq_model", "input_dim": null, "subsample_length": 1}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "output_dim": 52, "init": "uniform", "activity_regularizer": null, "dropout": 0.2, "input_length": 140, "batch_input_shape": [null, 140], "trainable": true, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null, "name": "embedding_1_dil_model", "input_dim": 1576890}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dil_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "activation": "relu", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "uniform", "input_length": null, "W_regularizer": null, "name": "convolution1d_1_dil_model", "input_dim": null, "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_dil_model", "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "activation": "relu", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "uniform", "input_length": null, "W_regularizer": null, "name": "convolution1d_2_dil_model", "input_dim": null, "subsample_length": 1}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "output_dim": 52, "init": "uniform", "activity_regularizer": null, "dropout": 0.2, "input_length": 140, "batch_input_shape": [null, 140], "trainable": true, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null, "name": "embedding_1_hul_model", "input_dim": 1062158}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "activation": "relu", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "uniform", "input_length": null, "W_regularizer": null, "name": "convolution1d_1_hul_model", "input_dim": null, "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_hul_model", "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "activation": "relu", "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true, "init": "uniform", "input_length": null, "W_regularizer": null, "name": "convolution1d_2_hul_model", "input_dim": null, "subsample_length": 1}}]}], "output_shape": null, "name": "merge_1"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "output_dim": 200, "bias": true, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "name": "dense_1", "input_dim": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "output_dim": 3, "bias": true, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "softmax", "name": "dense_2", "input_dim": null}}], "keras_version": "1.1.1"}