{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "output_dim": 52, "W_regularizer": null, "trainable": true, "init": "uniform", "input_dtype": "int32", "input_dim": 1576890, "mask_zero": false, "name": "embedding_1", "W_constraint": null, "activity_regularizer": null, "input_length": 140, "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "name": "convolution1d_1", "nb_filter": 200, "filter_length": 6, "W_regularizer": null, "trainable": true, "init": "uniform", "activation": "relu", "b_regularizer": null, "subsample_length": 1, "input_dim": null, "bias": true, "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1", "pool_length": 4, "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "name": "convolution1d_2", "nb_filter": 200, "filter_length": 6, "W_regularizer": null, "trainable": true, "init": "uniform", "activation": "relu", "b_regularizer": null, "subsample_length": 1, "input_dim": null, "bias": true, "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "name": "maxpooling1d_2", "pool_length": 66, "trainable": true, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 200, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_1", "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 3, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "softmax", "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_2", "W_constraint": null, "activity_regularizer": null}}]}