{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"dot_axes": -1, "output_shape_type": "raw", "concat_axis": -1, "mode": "concat", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "mask_zero": false, "input_length": 140, "W_regularizer": null, "trainable": true, "input_dtype": "int32", "init": "uniform", "output_dim": 52, "W_constraint": null, "input_dim": 1576890, "name": "embedding_1_dil_model", "dropout": 0.2, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "input_length": null, "filter_length": 6, "trainable": true, "W_constraint": null, "activation": "relu", "bias": true, "init": "uniform", "b_constraint": null, "W_regularizer": null, "input_dim": null, "subsample_length": 1, "name": "convolution1d_1_dil_model"}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_dil_model", "stride": 2, "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "input_length": null, "filter_length": 6, "trainable": true, "W_constraint": null, "activation": "relu", "bias": true, "init": "uniform", "b_constraint": null, "W_regularizer": null, "input_dim": null, "subsample_length": 1, "name": "convolution1d_2_dil_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "mask_zero": false, "input_length": 140, "W_regularizer": null, "trainable": true, "input_dtype": "int32", "init": "uniform", "output_dim": 52, "W_constraint": null, "input_dim": 1062158, "name": "embedding_1_hul_model", "dropout": 0.2, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "input_length": null, "filter_length": 6, "trainable": true, "W_constraint": null, "activation": "relu", "bias": true, "init": "uniform", "b_constraint": null, "W_regularizer": null, "input_dim": null, "subsample_length": 1, "name": "convolution1d_1_hul_model"}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_hul_model", "stride": 2, "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "input_length": null, "filter_length": 6, "trainable": true, "W_constraint": null, "activation": "relu", "bias": true, "init": "uniform", "b_constraint": null, "W_regularizer": null, "input_dim": null, "subsample_length": 1, "name": "convolution1d_2_hul_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "mask_zero": false, "input_length": 140, "W_regularizer": null, "trainable": true, "input_dtype": "int32", "init": "uniform", "output_dim": 52, "W_constraint": null, "input_dim": 428669, "name": "embedding_17_mpq_model", "dropout": 0.2, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "input_length": null, "filter_length": 6, "trainable": true, "W_constraint": null, "activation": "relu", "bias": true, "init": "uniform", "b_constraint": null, "W_regularizer": null, "input_dim": null, "subsample_length": 1, "name": "convolution1d_33_mpq_model"}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_33_mpq_model", "stride": 2, "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "input_length": null, "filter_length": 6, "trainable": true, "W_constraint": null, "activation": "relu", "bias": true, "init": "uniform", "b_constraint": null, "W_regularizer": null, "input_dim": null, "subsample_length": 1, "name": "convolution1d_34_mpq_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "mask_zero": false, "input_length": 140, "W_regularizer": null, "trainable": true, "input_dtype": "int32", "init": "uniform", "output_dim": 52, "W_constraint": null, "input_dim": 428669, "name": "embedding_1_semeval_model", "dropout": 0.2, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "input_length": null, "filter_length": 6, "trainable": true, "W_constraint": null, "activation": "relu", "bias": true, "init": "uniform", "b_constraint": null, "W_regularizer": null, "input_dim": null, "subsample_length": 1, "name": "convolution1d_1_semeval_model"}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_semeval_model", "stride": 2, "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "input_length": null, "filter_length": 6, "trainable": true, "W_constraint": null, "activation": "relu", "bias": true, "init": "uniform", "b_constraint": null, "W_regularizer": null, "input_dim": null, "subsample_length": 1, "name": "convolution1d_2_semeval_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "mask_zero": false, "input_length": 140, "W_regularizer": null, "trainable": true, "input_dtype": "int32", "init": "uniform", "output_dim": 52, "W_constraint": null, "input_dim": 428669, "name": "embedding_1_tac_model", "dropout": 0.2, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "input_length": null, "filter_length": 6, "trainable": true, "W_constraint": null, "activation": "relu", "bias": true, "init": "uniform", "b_constraint": null, "W_regularizer": null, "input_dim": null, "subsample_length": 1, "name": "convolution1d_1_tac_model"}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_tac_model", "stride": 2, "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "input_length": null, "filter_length": 6, "trainable": true, "W_constraint": null, "activation": "relu", "bias": true, "init": "uniform", "b_constraint": null, "W_regularizer": null, "input_dim": null, "subsample_length": 1, "name": "convolution1d_2_tac_model"}}]}], "output_shape": null, "name": "merge_1", "mode_type": "raw"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "activation": "linear", "bias": true, "b_constraint": null, "output_dim": 200, "W_constraint": null, "input_dim": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "activation": "softmax", "bias": true, "b_constraint": null, "output_dim": 3, "W_constraint": null, "input_dim": null, "name": "dense_2"}}]}