{"keras_version": "1.1.0", "config": [{"config": {"trainable": true, "batch_input_shape": [null, 140], "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "input_length": 140, "dropout": 0.2, "init": "uniform", "input_dim": 1353244, "mask_zero": false, "input_dtype": "int32", "name": "embedding_1", "output_dim": 52}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"trainable": true, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "input_length": null, "bias": true, "init": "uniform", "input_dim": null, "nb_filter": 200, "b_constraint": null, "activation": "relu", "subsample_length": 1, "name": "convolution1d_1", "b_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "stride": 2, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "input_length": null, "bias": true, "init": "uniform", "input_dim": null, "nb_filter": 200, "b_constraint": null, "activation": "relu", "subsample_length": 1, "name": "convolution1d_2", "b_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "stride": 66, "pool_length": 66, "border_mode": "valid", "name": "maxpooling1d_2"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": null, "b_regularizer": null, "b_constraint": null, "activation": "linear", "name": "dense_1", "output_dim": 200}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": null, "b_regularizer": null, "b_constraint": null, "activation": "softmax", "name": "dense_2", "output_dim": 3}, "class_name": "Dense"}], "class_name": "Sequential"}