{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "output_shape_type": "raw", "mode_type": "raw", "output_shape": null, "dot_axes": -1, "concat_axis": -1, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 428669, "output_dim": 52, "init": "uniform", "W_constraint": null, "mask_zero": false, "batch_input_shape": [null, 140], "name": "embedding_1_semeval_model", "input_length": 140, "activity_regularizer": null, "dropout": 0.2, "trainable": true, "input_dtype": "int32", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "subsample_length": 1, "init": "uniform", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_1_semeval_model", "input_length": null, "nb_filter": 200, "activity_regularizer": null, "filter_length": 6, "activation": "relu", "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_semeval_model", "trainable": true, "stride": 2, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "subsample_length": 1, "init": "uniform", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_2_semeval_model", "input_length": null, "nb_filter": 200, "activity_regularizer": null, "filter_length": 6, "activation": "relu", "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_semeval_model", "trainable": true, "stride": 66, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_semeval_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 1576890, "output_dim": 52, "init": "uniform", "W_constraint": null, "mask_zero": false, "batch_input_shape": [null, 140], "name": "embedding_1_dil_model", "input_length": 140, "activity_regularizer": null, "dropout": 0.2, "trainable": true, "input_dtype": "int32", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "subsample_length": 1, "init": "uniform", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_1_dil_model", "input_length": null, "nb_filter": 200, "activity_regularizer": null, "filter_length": 6, "activation": "relu", "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dil_model", "trainable": true, "stride": 2, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "subsample_length": 1, "init": "uniform", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_2_dil_model", "input_length": null, "nb_filter": 200, "activity_regularizer": null, "filter_length": 6, "activation": "relu", "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dil_model", "trainable": true, "stride": 66, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dil_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 428669, "output_dim": 52, "init": "uniform", "W_constraint": null, "mask_zero": false, "batch_input_shape": [null, 140], "name": "embedding_1_tac_model", "input_length": 140, "activity_regularizer": null, "dropout": 0.2, "trainable": true, "input_dtype": "int32", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "subsample_length": 1, "init": "uniform", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_1_tac_model", "input_length": null, "nb_filter": 200, "activity_regularizer": null, "filter_length": 6, "activation": "relu", "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_tac_model", "trainable": true, "stride": 2, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "subsample_length": 1, "init": "uniform", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_2_tac_model", "input_length": null, "nb_filter": 200, "activity_regularizer": null, "filter_length": 6, "activation": "relu", "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_tac_model", "trainable": true, "stride": 66, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_tac_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 428669, "output_dim": 52, "init": "uniform", "W_constraint": null, "mask_zero": false, "batch_input_shape": [null, 140], "name": "embedding_17_mpq_model", "input_length": 140, "activity_regularizer": null, "dropout": 0.2, "trainable": true, "input_dtype": "int32", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "subsample_length": 1, "init": "uniform", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_33_mpq_model", "input_length": null, "nb_filter": 200, "activity_regularizer": null, "filter_length": 6, "activation": "relu", "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_33_mpq_model", "trainable": true, "stride": 2, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "subsample_length": 1, "init": "uniform", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_34_mpq_model", "input_length": null, "nb_filter": 200, "activity_regularizer": null, "filter_length": 6, "activation": "relu", "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_34_mpq_model", "trainable": true, "stride": 66, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_17_mpq_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 1576890, "output_dim": 52, "init": "uniform", "W_constraint": null, "mask_zero": false, "batch_input_shape": [null, 140], "name": "embedding_1_dai_model", "input_length": 140, "activity_regularizer": null, "dropout": 0.2, "trainable": true, "input_dtype": "int32", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "subsample_length": 1, "init": "uniform", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_1_dai_model", "input_length": null, "nb_filter": 200, "activity_regularizer": null, "filter_length": 6, "activation": "relu", "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dai_model", "trainable": true, "stride": 2, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "subsample_length": 1, "init": "uniform", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_2_dai_model", "input_length": null, "nb_filter": 200, "activity_regularizer": null, "filter_length": 6, "activation": "relu", "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dai_model", "trainable": true, "stride": 66, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dai_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 1062158, "output_dim": 52, "init": "uniform", "W_constraint": null, "mask_zero": false, "batch_input_shape": [null, 140], "name": "embedding_1_hul_model", "input_length": 140, "activity_regularizer": null, "dropout": 0.2, "trainable": true, "input_dtype": "int32", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "subsample_length": 1, "init": "uniform", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_1_hul_model", "input_length": null, "nb_filter": 200, "activity_regularizer": null, "filter_length": 6, "activation": "relu", "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_hul_model", "trainable": true, "stride": 2, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "subsample_length": 1, "init": "uniform", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_2_hul_model", "input_length": null, "nb_filter": 200, "activity_regularizer": null, "filter_length": 6, "activation": "relu", "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_hul_model", "trainable": true, "stride": 66, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_hul_model", "trainable": true}}]}], "mode": "concat"}}, {"class_name": "Dense", "config": {"input_dim": null, "bias": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 1028, "name": "dense_1", "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "trainable": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "bias": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 3, "name": "dense_2", "W_regularizer": null, "activity_regularizer": null, "activation": "softmax", "b_regularizer": null, "trainable": true, "b_constraint": null}}]}