{"config": [{"class_name": "Embedding", "config": {"input_dim": 1576890, "batch_input_shape": [null, 140], "trainable": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "mask_zero": false, "dropout": 0.2, "input_length": 140, "input_dtype": "int32", "init": "uniform", "name": "embedding_1", "output_dim": 52}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1"}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "W_regularizer": null, "filter_length": 6, "trainable": true, "W_constraint": null, "bias": true, "b_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "nb_filter": 200, "input_dim": null, "b_constraint": null, "subsample_length": 1, "input_length": null, "activation": "relu", "name": "convolution1d_1"}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1", "trainable": true}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "W_regularizer": null, "filter_length": 6, "trainable": true, "W_constraint": null, "bias": true, "b_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "nb_filter": 200, "input_dim": null, "b_constraint": null, "subsample_length": 1, "input_length": null, "activation": "relu", "name": "convolution1d_2"}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "stride": 66, "border_mode": "valid", "name": "maxpooling1d_2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "linear", "name": "dense_1", "output_dim": 200}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "softmax", "name": "dense_2", "output_dim": 3}}], "keras_version": "1.1.0", "class_name": "Sequential"}