{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "name": "embedding_1", "trainable": true, "mask_zero": false, "dropout": 0.2, "batch_input_shape": [null, 140], "init": "uniform", "input_dtype": "int32", "W_regularizer": null, "output_dim": 52, "activity_regularizer": null, "input_length": 140, "input_dim": 2950660}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "nb_filter": 200, "b_constraint": null, "trainable": true, "border_mode": "valid", "b_regularizer": null, "bias": true, "init": "uniform", "activation": "relu", "input_length": null, "filter_length": 6, "subsample_length": 1, "name": "convolution1d_1", "activity_regularizer": null, "W_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1", "trainable": true, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "nb_filter": 200, "b_constraint": null, "trainable": true, "border_mode": "valid", "b_regularizer": null, "bias": true, "init": "uniform", "activation": "relu", "input_length": null, "filter_length": 6, "subsample_length": 1, "name": "convolution1d_2", "activity_regularizer": null, "W_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "name": "maxpooling1d_2", "trainable": true, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "name": "dense_1", "b_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "output_dim": 200, "activity_regularizer": null, "W_regularizer": null, "input_dim": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "name": "dense_2", "b_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "softmax", "output_dim": 3, "activity_regularizer": null, "W_regularizer": null, "input_dim": null}}]}