{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "concat_axis": -1, "output_shape": null, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "activity_regularizer": null, "output_dim": 52, "trainable": true, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32", "name": "embedding_1_dai_model", "input_dim": 1576890, "batch_input_shape": [null, 140], "input_length": 140, "init": "uniform", "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dai_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "filter_length": 6, "activity_regularizer": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "trainable": true, "border_mode": "valid", "input_dim": null, "name": "convolution1d_1_dai_model", "b_regularizer": null, "activation": "relu", "input_length": null, "nb_filter": 200, "init": "uniform", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_dai_model", "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "filter_length": 6, "activity_regularizer": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "trainable": true, "border_mode": "valid", "input_dim": null, "name": "convolution1d_2_dai_model", "b_regularizer": null, "activation": "relu", "input_length": null, "nb_filter": 200, "init": "uniform", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "name": "maxpooling1d_2_dai_model", "trainable": true, "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dai_model", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "output_dim": 200, "bias": true, "trainable": true, "W_regularizer": null, "input_dim": null, "name": "dense_1_dai_model", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1_dai_model", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1_dai_model", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "output_dim": 3, "bias": true, "trainable": true, "W_regularizer": null, "input_dim": null, "name": "dense_2_dai_model", "b_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "W_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "activity_regularizer": null, "output_dim": 52, "trainable": true, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32", "name": "embedding_1_dil_model", "input_dim": 1576890, "batch_input_shape": [null, 140], "input_length": 140, "init": "uniform", "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dil_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "filter_length": 6, "activity_regularizer": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "trainable": true, "border_mode": "valid", "input_dim": null, "name": "convolution1d_1_dil_model", "b_regularizer": null, "activation": "relu", "input_length": null, "nb_filter": 200, "init": "uniform", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_dil_model", "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "filter_length": 6, "activity_regularizer": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "trainable": true, "border_mode": "valid", "input_dim": null, "name": "convolution1d_2_dil_model", "b_regularizer": null, "activation": "relu", "input_length": null, "nb_filter": 200, "init": "uniform", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "name": "maxpooling1d_2_dil_model", "trainable": true, "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dil_model", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "output_dim": 200, "bias": true, "trainable": true, "W_regularizer": null, "input_dim": null, "name": "dense_1_dil_model", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1_dil_model", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1_dil_model", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "output_dim": 3, "bias": true, "trainable": true, "W_regularizer": null, "input_dim": null, "name": "dense_2_dil_model", "b_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "W_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "activity_regularizer": null, "output_dim": 52, "trainable": true, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32", "name": "embedding_1_semeval_model", "input_dim": 428669, "batch_input_shape": [null, 140], "input_length": 140, "init": "uniform", "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "filter_length": 6, "activity_regularizer": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "trainable": true, "border_mode": "valid", "input_dim": null, "name": "convolution1d_1_semeval_model", "b_regularizer": null, "activation": "relu", "input_length": null, "nb_filter": 200, "init": "uniform", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_semeval_model", "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "filter_length": 6, "activity_regularizer": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "trainable": true, "border_mode": "valid", "input_dim": null, "name": "convolution1d_2_semeval_model", "b_regularizer": null, "activation": "relu", "input_length": null, "nb_filter": 200, "init": "uniform", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "name": "maxpooling1d_2_semeval_model", "trainable": true, "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_semeval_model", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "output_dim": 200, "bias": true, "trainable": true, "W_regularizer": null, "input_dim": null, "name": "dense_1_semeval_model", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1_semeval_model", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1_semeval_model", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "output_dim": 3, "bias": true, "trainable": true, "W_regularizer": null, "input_dim": null, "name": "dense_2_semeval_model", "b_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "W_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "activity_regularizer": null, "output_dim": 52, "trainable": true, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32", "name": "embedding_17_mpq_model", "input_dim": 428669, "batch_input_shape": [null, 140], "input_length": 140, "init": "uniform", "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_17_mpq_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "filter_length": 6, "activity_regularizer": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "trainable": true, "border_mode": "valid", "input_dim": null, "name": "convolution1d_33_mpq_model", "b_regularizer": null, "activation": "relu", "input_length": null, "nb_filter": 200, "init": "uniform", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_33_mpq_model", "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "filter_length": 6, "activity_regularizer": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "trainable": true, "border_mode": "valid", "input_dim": null, "name": "convolution1d_34_mpq_model", "b_regularizer": null, "activation": "relu", "input_length": null, "nb_filter": 200, "init": "uniform", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "name": "maxpooling1d_34_mpq_model", "trainable": true, "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_17_mpq_model", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "output_dim": 200, "bias": true, "trainable": true, "W_regularizer": null, "input_dim": null, "name": "dense_33_mpq_model", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_17_mpq_model", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_17_mpq_model", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "output_dim": 3, "bias": true, "trainable": true, "W_regularizer": null, "input_dim": null, "name": "dense_34_mpq_model", "b_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "W_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "activity_regularizer": null, "output_dim": 52, "trainable": true, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32", "name": "embedding_1_hul_model", "input_dim": 1062158, "batch_input_shape": [null, 140], "input_length": 140, "init": "uniform", "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "filter_length": 6, "activity_regularizer": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "trainable": true, "border_mode": "valid", "input_dim": null, "name": "convolution1d_1_hul_model", "b_regularizer": null, "activation": "relu", "input_length": null, "nb_filter": 200, "init": "uniform", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_hul_model", "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "filter_length": 6, "activity_regularizer": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "trainable": true, "border_mode": "valid", "input_dim": null, "name": "convolution1d_2_hul_model", "b_regularizer": null, "activation": "relu", "input_length": null, "nb_filter": 200, "init": "uniform", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "name": "maxpooling1d_2_hul_model", "trainable": true, "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_hul_model", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "output_dim": 200, "bias": true, "trainable": true, "W_regularizer": null, "input_dim": null, "name": "dense_1_hul_model", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1_hul_model", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1_hul_model", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "output_dim": 3, "bias": true, "trainable": true, "W_regularizer": null, "input_dim": null, "name": "dense_2_hul_model", "b_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "W_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "activity_regularizer": null, "output_dim": 52, "trainable": true, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32", "name": "embedding_1_tac_model", "input_dim": 428669, "batch_input_shape": [null, 140], "input_length": 140, "init": "uniform", "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "filter_length": 6, "activity_regularizer": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "trainable": true, "border_mode": "valid", "input_dim": null, "name": "convolution1d_1_tac_model", "b_regularizer": null, "activation": "relu", "input_length": null, "nb_filter": 200, "init": "uniform", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_tac_model", "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "filter_length": 6, "activity_regularizer": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "trainable": true, "border_mode": "valid", "input_dim": null, "name": "convolution1d_2_tac_model", "b_regularizer": null, "activation": "relu", "input_length": null, "nb_filter": 200, "init": "uniform", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "name": "maxpooling1d_2_tac_model", "trainable": true, "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_tac_model", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "output_dim": 200, "bias": true, "trainable": true, "W_regularizer": null, "input_dim": null, "name": "dense_1_tac_model", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1_tac_model", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1_tac_model", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "output_dim": 3, "bias": true, "trainable": true, "W_regularizer": null, "input_dim": null, "name": "dense_2_tac_model", "b_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "W_constraint": null}}]}], "mode": "concat"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "output_dim": 256, "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "name": "dense_1", "input_dim": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "output_dim": 3, "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "name": "dense_2", "input_dim": null, "activation": "softmax", "init": "glorot_uniform", "W_constraint": null}}], "keras_version": "1.1.1"}