{"keras_version": "1.1.0", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dtype": "int32", "input_dim": 1576890, "activity_regularizer": null, "mask_zero": false, "trainable": true, "input_length": 140, "name": "embedding_1", "W_regularizer": null, "dropout": 0.2, "init": "uniform", "output_dim": 52, "W_constraint": null, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1"}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "b_regularizer": null, "input_length": null, "name": "convolution1d_1", "activation": "relu", "filter_length": 6, "W_regularizer": null, "border_mode": "valid", "trainable": true, "init": "uniform", "nb_filter": 200, "W_constraint": null, "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "b_regularizer": null, "input_length": null, "name": "convolution1d_2", "activation": "relu", "filter_length": 6, "W_regularizer": null, "border_mode": "valid", "trainable": true, "init": "uniform", "nb_filter": 200, "W_constraint": null, "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 66, "border_mode": "valid", "name": "maxpooling1d_2", "pool_length": 66}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "name": "dense_1", "activation": "linear", "b_constraint": null, "trainable": true, "init": "glorot_uniform", "output_dim": 200, "W_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"input_dim": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "name": "dense_2", "activation": "softmax", "b_constraint": null, "trainable": true, "init": "glorot_uniform", "output_dim": 3, "W_constraint": null}}]}