{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "input_dtype": "int32", "init": "uniform", "input_dim": 1062158, "activity_regularizer": null, "W_constraint": null, "mask_zero": false, "output_dim": 52, "batch_input_shape": [null, 140], "W_regularizer": null, "name": "embedding_1", "dropout": 0.2, "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1"}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "activation": "relu", "input_length": null, "border_mode": "valid", "activity_regularizer": null, "bias": true, "subsample_length": 1, "W_regularizer": null, "name": "convolution1d_1", "input_dim": null, "init": "uniform", "trainable": true, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_1", "stride": 2}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "activation": "relu", "input_length": null, "border_mode": "valid", "activity_regularizer": null, "bias": true, "subsample_length": 1, "W_regularizer": null, "name": "convolution1d_2", "input_dim": null, "init": "uniform", "trainable": true, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_2", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": null, "W_constraint": null, "activation": "linear", "name": "dense_1", "output_dim": 200, "bias": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": null, "W_constraint": null, "activation": "softmax", "name": "dense_2", "output_dim": 3, "bias": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null}}]}