{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"mode": "concat", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "input_dim": 1576890, "name": "embedding_1_dil_model", "init": "uniform", "W_regularizer": null, "output_dim": 52, "mask_zero": false, "input_dtype": "int32", "W_constraint": null, "dropout": 0.2, "activity_regularizer": null, "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dil_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "input_length": null, "bias": true, "input_dim": null, "b_regularizer": null, "name": "convolution1d_1_dil_model", "W_regularizer": null, "init": "uniform", "nb_filter": 200, "filter_length": 6, "subsample_length": 1, "activation": "relu", "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_dil_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "input_length": null, "bias": true, "input_dim": null, "b_regularizer": null, "name": "convolution1d_2_dil_model", "W_regularizer": null, "init": "uniform", "nb_filter": 200, "filter_length": 6, "subsample_length": 1, "activation": "relu", "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "input_dim": 1576890, "name": "embedding_1_semeval_model", "init": "uniform", "W_regularizer": null, "output_dim": 52, "mask_zero": false, "input_dtype": "int32", "W_constraint": null, "dropout": 0.2, "activity_regularizer": null, "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "input_length": null, "bias": true, "input_dim": null, "b_regularizer": null, "name": "convolution1d_1_semeval_model", "W_regularizer": null, "init": "uniform", "nb_filter": 200, "filter_length": 6, "subsample_length": 1, "activation": "relu", "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "input_length": null, "bias": true, "input_dim": null, "b_regularizer": null, "name": "convolution1d_2_semeval_model", "W_regularizer": null, "init": "uniform", "nb_filter": 200, "filter_length": 6, "subsample_length": 1, "activation": "relu", "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "input_dim": 428669, "name": "embedding_1_tac_model", "init": "uniform", "W_regularizer": null, "output_dim": 52, "mask_zero": false, "input_dtype": "int32", "W_constraint": null, "dropout": 0.2, "activity_regularizer": null, "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "input_length": null, "bias": true, "input_dim": null, "b_regularizer": null, "name": "convolution1d_1_tac_model", "W_regularizer": null, "init": "uniform", "nb_filter": 200, "filter_length": 6, "subsample_length": 1, "activation": "relu", "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_tac_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "input_length": null, "bias": true, "input_dim": null, "b_regularizer": null, "name": "convolution1d_2_tac_model", "W_regularizer": null, "init": "uniform", "nb_filter": 200, "filter_length": 6, "subsample_length": 1, "activation": "relu", "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true}}]}], "mode_type": "raw", "output_shape": null, "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "name": "merge_1"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_1", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "input_length": null, "bias": true, "input_dim": null, "b_regularizer": null, "name": "convolution1d_1", "W_regularizer": null, "init": "uniform", "nb_filter": 200, "filter_length": 6, "subsample_length": 1, "activation": "relu", "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_2", "pool_length": 4}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "input_dim": null, "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "W_regularizer": null, "output_dim": 200, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "input_dim": null, "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "W_regularizer": null, "output_dim": 3, "activation": "softmax", "W_constraint": null, "activity_regularizer": null, "trainable": true}}], "keras_version": "1.1.1"}