{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"mode_type": "raw", "output_shape_type": "raw", "name": "merge_1", "output_shape": null, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "input_dtype": "int32", "name": "embedding_1_dai_model", "dropout": 0.2, "input_length": 140, "W_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "init": "uniform", "W_constraint": null, "batch_input_shape": [null, 140], "input_dim": 1576890}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "name": "convolution1d_1_dai_model", "nb_filter": 200, "filter_length": 6, "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "subsample_length": 1, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "input_dim": null, "init": "uniform", "bias": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_dai_model", "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "name": "convolution1d_2_dai_model", "nb_filter": 200, "filter_length": 6, "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "subsample_length": 1, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "input_dim": null, "init": "uniform", "bias": true, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "input_dtype": "int32", "name": "embedding_1_dil_model", "dropout": 0.2, "input_length": 140, "W_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "init": "uniform", "W_constraint": null, "batch_input_shape": [null, 140], "input_dim": 1576890}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "name": "convolution1d_1_dil_model", "nb_filter": 200, "filter_length": 6, "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "subsample_length": 1, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "input_dim": null, "init": "uniform", "bias": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_dil_model", "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "name": "convolution1d_2_dil_model", "nb_filter": 200, "filter_length": 6, "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "subsample_length": 1, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "input_dim": null, "init": "uniform", "bias": true, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "input_dtype": "int32", "name": "embedding_1_hul_model", "dropout": 0.2, "input_length": 140, "W_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "init": "uniform", "W_constraint": null, "batch_input_shape": [null, 140], "input_dim": 1062158}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "name": "convolution1d_1_hul_model", "nb_filter": 200, "filter_length": 6, "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "subsample_length": 1, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "input_dim": null, "init": "uniform", "bias": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_hul_model", "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "name": "convolution1d_2_hul_model", "nb_filter": 200, "filter_length": 6, "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "subsample_length": 1, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "input_dim": null, "init": "uniform", "bias": true, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "input_dtype": "int32", "name": "embedding_17_mpq_model", "dropout": 0.2, "input_length": 140, "W_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "init": "uniform", "W_constraint": null, "batch_input_shape": [null, 140], "input_dim": 428669}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "name": "convolution1d_33_mpq_model", "nb_filter": 200, "filter_length": 6, "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "subsample_length": 1, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "input_dim": null, "init": "uniform", "bias": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_33_mpq_model", "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "name": "convolution1d_34_mpq_model", "nb_filter": 200, "filter_length": 6, "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "subsample_length": 1, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "input_dim": null, "init": "uniform", "bias": true, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "input_dtype": "int32", "name": "embedding_1_semeval_model", "dropout": 0.2, "input_length": 140, "W_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "init": "uniform", "W_constraint": null, "batch_input_shape": [null, 140], "input_dim": 1576890}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "name": "convolution1d_1_semeval_model", "nb_filter": 200, "filter_length": 6, "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "subsample_length": 1, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "input_dim": null, "init": "uniform", "bias": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_semeval_model", "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "name": "convolution1d_2_semeval_model", "nb_filter": 200, "filter_length": 6, "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "subsample_length": 1, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "input_dim": null, "init": "uniform", "bias": true, "input_length": null}}]}], "mode": "concat", "dot_axes": -1, "concat_axis": -1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1", "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "name": "convolution1d_1", "input_dim": null, "filter_length": 6, "W_regularizer": null, "input_length": null, "b_constraint": null, "trainable": true, "subsample_length": 1, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 200, "init": "uniform", "bias": true, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_2", "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "W_regularizer": null, "output_dim": 200, "b_constraint": null, "trainable": true, "b_regularizer": null, "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "bias": true, "activation": "linear"}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_2", "W_regularizer": null, "output_dim": 3, "b_constraint": null, "trainable": true, "b_regularizer": null, "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "bias": true, "activation": "softmax"}}], "keras_version": "1.1.1"}