{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_dai_model", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dim": 1576890, "trainable": false, "output_dim": 52, "dropout": 0.2, "W_constraint": null, "init": "uniform", "input_length": 140, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "trainable": false, "padding": 5}}, {"class_name": "Convolution1D", "config": {"W_regularizer": null, "b_regularizer": null, "name": "convolution1d_1_dai_model", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": false, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "nb_filter": 200, "border_mode": "valid", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dai_model", "stride": 2, "trainable": false, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"W_regularizer": null, "b_regularizer": null, "name": "convolution1d_2_dai_model", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": false, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "nb_filter": 200, "border_mode": "valid", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dai_model", "stride": 66, "trainable": false, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dai_model", "trainable": false}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1_dai_model", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": false, "output_dim": 200, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_1_dai_model", "trainable": false, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1_dai_model", "trainable": false, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_2_dai_model", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": false, "output_dim": 3, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "softmax"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_hul_model", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dim": 1062158, "trainable": false, "output_dim": 52, "dropout": 0.2, "W_constraint": null, "init": "uniform", "input_length": 140, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "trainable": false, "padding": 5}}, {"class_name": "Convolution1D", "config": {"W_regularizer": null, "b_regularizer": null, "name": "convolution1d_1_hul_model", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": false, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "nb_filter": 200, "border_mode": "valid", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_hul_model", "stride": 2, "trainable": false, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"W_regularizer": null, "b_regularizer": null, "name": "convolution1d_2_hul_model", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": false, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "nb_filter": 200, "border_mode": "valid", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_hul_model", "stride": 66, "trainable": false, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_hul_model", "trainable": false}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1_hul_model", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": false, "output_dim": 200, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_1_hul_model", "trainable": false, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1_hul_model", "trainable": false, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_2_hul_model", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": false, "output_dim": 3, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "softmax"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_tac_model", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dim": 428669, "trainable": false, "output_dim": 52, "dropout": 0.2, "W_constraint": null, "init": "uniform", "input_length": 140, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "trainable": false, "padding": 5}}, {"class_name": "Convolution1D", "config": {"W_regularizer": null, "b_regularizer": null, "name": "convolution1d_1_tac_model", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": false, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "nb_filter": 200, "border_mode": "valid", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_tac_model", "stride": 2, "trainable": false, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"W_regularizer": null, "b_regularizer": null, "name": "convolution1d_2_tac_model", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": false, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "nb_filter": 200, "border_mode": "valid", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_tac_model", "stride": 66, "trainable": false, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_tac_model", "trainable": false}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1_tac_model", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": false, "output_dim": 200, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_1_tac_model", "trainable": false, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1_tac_model", "trainable": false, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_2_tac_model", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": false, "output_dim": 3, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "softmax"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_dil_model", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dim": 1576890, "trainable": false, "output_dim": 52, "dropout": 0.2, "W_constraint": null, "init": "uniform", "input_length": 140, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": false, "padding": 5}}, {"class_name": "Convolution1D", "config": {"W_regularizer": null, "b_regularizer": null, "name": "convolution1d_1_dil_model", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": false, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "nb_filter": 200, "border_mode": "valid", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dil_model", "stride": 2, "trainable": false, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"W_regularizer": null, "b_regularizer": null, "name": "convolution1d_2_dil_model", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": false, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "nb_filter": 200, "border_mode": "valid", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dil_model", "stride": 66, "trainable": false, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dil_model", "trainable": false}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1_dil_model", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": false, "output_dim": 200, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_1_dil_model", "trainable": false, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1_dil_model", "trainable": false, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_2_dil_model", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": false, "output_dim": 3, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "softmax"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_17_mpq_model", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dim": 428669, "trainable": false, "output_dim": 52, "dropout": 0.2, "W_constraint": null, "init": "uniform", "input_length": 140, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "trainable": false, "padding": 5}}, {"class_name": "Convolution1D", "config": {"W_regularizer": null, "b_regularizer": null, "name": "convolution1d_33_mpq_model", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": false, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "nb_filter": 200, "border_mode": "valid", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_33_mpq_model", "stride": 2, "trainable": false, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"W_regularizer": null, "b_regularizer": null, "name": "convolution1d_34_mpq_model", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": false, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "nb_filter": 200, "border_mode": "valid", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_34_mpq_model", "stride": 66, "trainable": false, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_17_mpq_model", "trainable": false}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_33_mpq_model", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": false, "output_dim": 200, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_17_mpq_model", "trainable": false, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_17_mpq_model", "trainable": false, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_34_mpq_model", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": false, "output_dim": 3, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "softmax"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_semeval_model", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dim": 428669, "trainable": false, "output_dim": 52, "dropout": 0.2, "W_constraint": null, "init": "uniform", "input_length": 140, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": false, "padding": 5}}, {"class_name": "Convolution1D", "config": {"W_regularizer": null, "b_regularizer": null, "name": "convolution1d_1_semeval_model", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": false, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "nb_filter": 200, "border_mode": "valid", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_semeval_model", "stride": 2, "trainable": false, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"W_regularizer": null, "b_regularizer": null, "name": "convolution1d_2_semeval_model", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": false, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "nb_filter": 200, "border_mode": "valid", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_semeval_model", "stride": 66, "trainable": false, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_semeval_model", "trainable": false}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1_semeval_model", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": false, "output_dim": 200, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_1_semeval_model", "trainable": false, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1_semeval_model", "trainable": false, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_2_semeval_model", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": false, "output_dim": 3, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "softmax"}}]}], "mode_type": "raw", "output_shape_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "name": "merge_1", "concat_axis": -1}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": true, "output_dim": 256, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_2", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": true, "output_dim": 3, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "softmax"}}]}