{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "mask_zero": false, "trainable": true, "input_length": 140, "input_dtype": "int32", "dropout": 0.2, "output_dim": 52, "W_regularizer": null, "name": "embedding_1_dil_model", "input_dim": 1576890, "activity_regularizer": null, "batch_input_shape": [null, 140], "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_dil_model"}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "input_length": null, "activation": "relu", "W_regularizer": null, "name": "convolution1d_1_dil_model", "input_dim": null, "subsample_length": 1, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "bias": true, "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_dil_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "input_length": null, "activation": "relu", "W_regularizer": null, "name": "convolution1d_2_dil_model", "input_dim": null, "subsample_length": 1, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "bias": true, "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "mask_zero": false, "trainable": true, "input_length": 140, "input_dtype": "int32", "dropout": 0.2, "output_dim": 52, "W_regularizer": null, "name": "embedding_1_hul_model", "input_dim": 1062158, "activity_regularizer": null, "batch_input_shape": [null, 140], "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_hul_model"}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "input_length": null, "activation": "relu", "W_regularizer": null, "name": "convolution1d_1_hul_model", "input_dim": null, "subsample_length": 1, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "bias": true, "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_hul_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "input_length": null, "activation": "relu", "W_regularizer": null, "name": "convolution1d_2_hul_model", "input_dim": null, "subsample_length": 1, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "bias": true, "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "mask_zero": false, "trainable": true, "input_length": 140, "input_dtype": "int32", "dropout": 0.2, "output_dim": 52, "W_regularizer": null, "name": "embedding_1_dai_model", "input_dim": 1576890, "activity_regularizer": null, "batch_input_shape": [null, 140], "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_dai_model"}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "input_length": null, "activation": "relu", "W_regularizer": null, "name": "convolution1d_1_dai_model", "input_dim": null, "subsample_length": 1, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "bias": true, "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_dai_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "input_length": null, "activation": "relu", "W_regularizer": null, "name": "convolution1d_2_dai_model", "input_dim": null, "subsample_length": 1, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "bias": true, "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "mask_zero": false, "trainable": true, "input_length": 140, "input_dtype": "int32", "dropout": 0.2, "output_dim": 52, "W_regularizer": null, "name": "embedding_1_semeval_model", "input_dim": 428669, "activity_regularizer": null, "batch_input_shape": [null, 140], "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "input_length": null, "activation": "relu", "W_regularizer": null, "name": "convolution1d_1_semeval_model", "input_dim": null, "subsample_length": 1, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "bias": true, "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "input_length": null, "activation": "relu", "W_regularizer": null, "name": "convolution1d_2_semeval_model", "input_dim": null, "subsample_length": 1, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "bias": true, "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "mask_zero": false, "trainable": true, "input_length": 140, "input_dtype": "int32", "dropout": 0.2, "output_dim": 52, "W_regularizer": null, "name": "embedding_1_tac_model", "input_dim": 428669, "activity_regularizer": null, "batch_input_shape": [null, 140], "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_tac_model"}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "input_length": null, "activation": "relu", "W_regularizer": null, "name": "convolution1d_1_tac_model", "input_dim": null, "subsample_length": 1, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "bias": true, "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_tac_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "input_length": null, "activation": "relu", "W_regularizer": null, "name": "convolution1d_2_tac_model", "input_dim": null, "subsample_length": 1, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "bias": true, "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "mask_zero": false, "trainable": true, "input_length": 140, "input_dtype": "int32", "dropout": 0.2, "output_dim": 52, "W_regularizer": null, "name": "embedding_17_mpq_model", "input_dim": 428669, "activity_regularizer": null, "batch_input_shape": [null, 140], "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_17_mpq_model"}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "input_length": null, "activation": "relu", "W_regularizer": null, "name": "convolution1d_33_mpq_model", "input_dim": null, "subsample_length": 1, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "bias": true, "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "input_length": null, "activation": "relu", "W_regularizer": null, "name": "convolution1d_34_mpq_model", "input_dim": null, "subsample_length": 1, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "bias": true, "trainable": true}}]}], "mode_type": "raw", "mode": "concat", "name": "merge_1", "output_shape_type": "raw", "output_shape": null, "dot_axes": -1, "concat_axis": -1}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 200, "activation": "linear", "W_regularizer": null, "trainable": true, "name": "dense_1", "input_dim": null, "b_constraint": null, "bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 3, "activation": "softmax", "W_regularizer": null, "trainable": true, "name": "dense_2", "input_dim": null, "b_constraint": null, "bias": true, "activity_regularizer": null}}]}