{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"output_shape_type": "raw", "concat_axis": -1, "mode": "concat", "output_shape": null, "mode_type": "raw", "dot_axes": -1, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "activity_regularizer": null, "trainable": true, "W_constraint": null, "input_length": 140, "mask_zero": false, "batch_input_shape": [null, 140], "name": "embedding_1_hul_model", "input_dim": 1062158, "input_dtype": "int32", "W_regularizer": null, "init": "uniform", "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_hul_model"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "subsample_length": 1, "b_constraint": null, "bias": true, "input_length": null, "name": "convolution1d_1_hul_model", "input_dim": null, "activation": "relu", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "init": "uniform", "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_hul_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "subsample_length": 1, "b_constraint": null, "bias": true, "input_length": null, "name": "convolution1d_2_hul_model", "input_dim": null, "activation": "relu", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "init": "uniform", "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "name": "maxpooling1d_2_hul_model", "pool_length": 66, "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_hul_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "activity_regularizer": null, "trainable": true, "W_constraint": null, "input_length": 140, "mask_zero": false, "batch_input_shape": [null, 140], "name": "embedding_1_dai_model", "input_dim": 1576890, "input_dtype": "int32", "W_regularizer": null, "init": "uniform", "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_dai_model"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "subsample_length": 1, "b_constraint": null, "bias": true, "input_length": null, "name": "convolution1d_1_dai_model", "input_dim": null, "activation": "relu", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "init": "uniform", "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_dai_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "subsample_length": 1, "b_constraint": null, "bias": true, "input_length": null, "name": "convolution1d_2_dai_model", "input_dim": null, "activation": "relu", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "init": "uniform", "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "name": "maxpooling1d_2_dai_model", "pool_length": 66, "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_dai_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "activity_regularizer": null, "trainable": true, "W_constraint": null, "input_length": 140, "mask_zero": false, "batch_input_shape": [null, 140], "name": "embedding_1_dil_model", "input_dim": 1576890, "input_dtype": "int32", "W_regularizer": null, "init": "uniform", "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_dil_model"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "subsample_length": 1, "b_constraint": null, "bias": true, "input_length": null, "name": "convolution1d_1_dil_model", "input_dim": null, "activation": "relu", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "init": "uniform", "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_dil_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "subsample_length": 1, "b_constraint": null, "bias": true, "input_length": null, "name": "convolution1d_2_dil_model", "input_dim": null, "activation": "relu", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "init": "uniform", "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "name": "maxpooling1d_2_dil_model", "pool_length": 66, "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_dil_model"}}]}], "name": "merge_1"}}, {"class_name": "Dense", "config": {"output_dim": 1028, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "bias": true, "name": "dense_1", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"output_dim": 3, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "bias": true, "name": "dense_2", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "b_constraint": null}}]}