{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_17_mpq_model", "output_dim": 52, "dropout": 0.2, "init": "uniform", "W_constraint": null, "input_dtype": "int32", "W_regularizer": null, "mask_zero": false, "trainable": true, "input_dim": 428669, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_length": null, "nb_filter": 200, "activation": "relu", "b_regularizer": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "b_constraint": null, "subsample_length": 1, "name": "convolution1d_33_mpq_model", "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_33_mpq_model", "trainable": true, "pool_length": 4, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_length": null, "nb_filter": 200, "activation": "relu", "b_regularizer": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "b_constraint": null, "subsample_length": 1, "name": "convolution1d_34_mpq_model", "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_34_mpq_model", "trainable": true, "pool_length": 66, "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_17_mpq_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_1_dai_model", "output_dim": 52, "dropout": 0.2, "init": "uniform", "W_constraint": null, "input_dtype": "int32", "W_regularizer": null, "mask_zero": false, "trainable": true, "input_dim": 1576890, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_length": null, "nb_filter": 200, "activation": "relu", "b_regularizer": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "b_constraint": null, "subsample_length": 1, "name": "convolution1d_1_dai_model", "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dai_model", "trainable": true, "pool_length": 4, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_length": null, "nb_filter": 200, "activation": "relu", "b_regularizer": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "b_constraint": null, "subsample_length": 1, "name": "convolution1d_2_dai_model", "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dai_model", "trainable": true, "pool_length": 66, "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dai_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_1_hul_model", "output_dim": 52, "dropout": 0.2, "init": "uniform", "W_constraint": null, "input_dtype": "int32", "W_regularizer": null, "mask_zero": false, "trainable": true, "input_dim": 1062158, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_length": null, "nb_filter": 200, "activation": "relu", "b_regularizer": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "b_constraint": null, "subsample_length": 1, "name": "convolution1d_1_hul_model", "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_hul_model", "trainable": true, "pool_length": 4, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_length": null, "nb_filter": 200, "activation": "relu", "b_regularizer": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "b_constraint": null, "subsample_length": 1, "name": "convolution1d_2_hul_model", "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_hul_model", "trainable": true, "pool_length": 66, "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_hul_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_1_tac_model", "output_dim": 52, "dropout": 0.2, "init": "uniform", "W_constraint": null, "input_dtype": "int32", "W_regularizer": null, "mask_zero": false, "trainable": true, "input_dim": 428669, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_length": null, "nb_filter": 200, "activation": "relu", "b_regularizer": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "b_constraint": null, "subsample_length": 1, "name": "convolution1d_1_tac_model", "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_tac_model", "trainable": true, "pool_length": 4, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_length": null, "nb_filter": 200, "activation": "relu", "b_regularizer": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "b_constraint": null, "subsample_length": 1, "name": "convolution1d_2_tac_model", "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_tac_model", "trainable": true, "pool_length": 66, "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_tac_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_1_semeval_model", "output_dim": 52, "dropout": 0.2, "init": "uniform", "W_constraint": null, "input_dtype": "int32", "W_regularizer": null, "mask_zero": false, "trainable": true, "input_dim": 428669, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_length": null, "nb_filter": 200, "activation": "relu", "b_regularizer": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "b_constraint": null, "subsample_length": 1, "name": "convolution1d_1_semeval_model", "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_semeval_model", "trainable": true, "pool_length": 4, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_length": null, "nb_filter": 200, "activation": "relu", "b_regularizer": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "b_constraint": null, "subsample_length": 1, "name": "convolution1d_2_semeval_model", "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_semeval_model", "trainable": true, "pool_length": 66, "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_semeval_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_1_dil_model", "output_dim": 52, "dropout": 0.2, "init": "uniform", "W_constraint": null, "input_dtype": "int32", "W_regularizer": null, "mask_zero": false, "trainable": true, "input_dim": 1576890, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_length": null, "nb_filter": 200, "activation": "relu", "b_regularizer": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "b_constraint": null, "subsample_length": 1, "name": "convolution1d_1_dil_model", "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dil_model", "trainable": true, "pool_length": 4, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_length": null, "nb_filter": 200, "activation": "relu", "b_regularizer": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "b_constraint": null, "subsample_length": 1, "name": "convolution1d_2_dil_model", "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dil_model", "trainable": true, "pool_length": 66, "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dil_model", "trainable": true}}]}], "dot_axes": -1, "concat_axis": -1, "mode_type": "raw", "name": "merge_1", "output_shape": null, "output_shape_type": "raw", "mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "activation": "linear", "output_dim": 1028, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "activation": "softmax", "output_dim": 3, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "activity_regularizer": null}}]}