{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"init": "uniform", "input_length": 140, "name": "embedding_1", "W_regularizer": null, "input_dtype": "int32", "trainable": true, "dropout": 0.2, "activity_regularizer": null, "batch_input_shape": [null, 140], "W_constraint": null, "mask_zero": false, "output_dim": 52, "input_dim": 428669}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1"}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "b_regularizer": null, "W_regularizer": null, "input_length": null, "bias": true, "subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "trainable": true, "nb_filter": 200, "border_mode": "valid", "W_constraint": null, "activation": "relu", "name": "convolution1d_1", "filter_length": 6, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "trainable": true, "name": "maxpooling1d_1", "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "b_regularizer": null, "W_regularizer": null, "input_length": null, "bias": true, "subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "trainable": true, "nb_filter": 200, "border_mode": "valid", "W_constraint": null, "activation": "relu", "name": "convolution1d_2", "filter_length": 6, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "trainable": true, "name": "maxpooling1d_2", "stride": 66, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_1", "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "b_regularizer": null, "output_dim": 200, "input_dim": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_2", "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true, "b_constraint": null, "activation": "softmax", "b_regularizer": null, "output_dim": 3, "input_dim": null}}], "keras_version": "1.1.1"}