{"config": [{"config": {"mode_type": "raw", "output_shape": null, "layers": [{"config": [{"config": {"trainable": true, "W_regularizer": null, "input_dtype": "int32", "batch_input_shape": [null, 140], "activity_regularizer": null, "name": "embedding_1_semeval_model", "dropout": 0.2, "W_constraint": null, "output_dim": 52, "init": "uniform", "input_length": 140, "mask_zero": false, "input_dim": 428669}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_semeval_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution1d_1_semeval_model", "activation": "relu", "W_constraint": null, "nb_filter": 200, "border_mode": "valid", "bias": true, "input_length": null, "filter_length": 6, "input_dim": null, "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_1_semeval_model", "pool_length": 4, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution1d_2_semeval_model", "activation": "relu", "W_constraint": null, "nb_filter": 200, "border_mode": "valid", "bias": true, "input_length": null, "filter_length": 6, "input_dim": null, "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_2_semeval_model", "pool_length": 66, "stride": 66, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_semeval_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"trainable": true, "W_regularizer": null, "input_dtype": "int32", "batch_input_shape": [null, 140], "activity_regularizer": null, "name": "embedding_1_dil_model", "dropout": 0.2, "W_constraint": null, "output_dim": 52, "init": "uniform", "input_length": 140, "mask_zero": false, "input_dim": 1576890}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_dil_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution1d_1_dil_model", "activation": "relu", "W_constraint": null, "nb_filter": 200, "border_mode": "valid", "bias": true, "input_length": null, "filter_length": 6, "input_dim": null, "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_1_dil_model", "pool_length": 4, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution1d_2_dil_model", "activation": "relu", "W_constraint": null, "nb_filter": 200, "border_mode": "valid", "bias": true, "input_length": null, "filter_length": 6, "input_dim": null, "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_2_dil_model", "pool_length": 66, "stride": 66, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_dil_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"trainable": true, "W_regularizer": null, "input_dtype": "int32", "batch_input_shape": [null, 140], "activity_regularizer": null, "name": "embedding_1_dai_model", "dropout": 0.2, "W_constraint": null, "output_dim": 52, "init": "uniform", "input_length": 140, "mask_zero": false, "input_dim": 1576890}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_dai_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution1d_1_dai_model", "activation": "relu", "W_constraint": null, "nb_filter": 200, "border_mode": "valid", "bias": true, "input_length": null, "filter_length": 6, "input_dim": null, "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_1_dai_model", "pool_length": 4, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution1d_2_dai_model", "activation": "relu", "W_constraint": null, "nb_filter": 200, "border_mode": "valid", "bias": true, "input_length": null, "filter_length": 6, "input_dim": null, "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_2_dai_model", "pool_length": 66, "stride": 66, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_dai_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"trainable": true, "W_regularizer": null, "input_dtype": "int32", "batch_input_shape": [null, 140], "activity_regularizer": null, "name": "embedding_1_hul_model", "dropout": 0.2, "W_constraint": null, "output_dim": 52, "init": "uniform", "input_length": 140, "mask_zero": false, "input_dim": 1062158}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_hul_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution1d_1_hul_model", "activation": "relu", "W_constraint": null, "nb_filter": 200, "border_mode": "valid", "bias": true, "input_length": null, "filter_length": 6, "input_dim": null, "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_1_hul_model", "pool_length": 4, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution1d_2_hul_model", "activation": "relu", "W_constraint": null, "nb_filter": 200, "border_mode": "valid", "bias": true, "input_length": null, "filter_length": 6, "input_dim": null, "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_2_hul_model", "pool_length": 66, "stride": 66, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_hul_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"trainable": true, "W_regularizer": null, "input_dtype": "int32", "batch_input_shape": [null, 140], "activity_regularizer": null, "name": "embedding_17_mpq_model", "dropout": 0.2, "W_constraint": null, "output_dim": 52, "init": "uniform", "input_length": 140, "mask_zero": false, "input_dim": 428669}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_17_mpq_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution1d_33_mpq_model", "activation": "relu", "W_constraint": null, "nb_filter": 200, "border_mode": "valid", "bias": true, "input_length": null, "filter_length": 6, "input_dim": null, "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_33_mpq_model", "pool_length": 4, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution1d_34_mpq_model", "activation": "relu", "W_constraint": null, "nb_filter": 200, "border_mode": "valid", "bias": true, "input_length": null, "filter_length": 6, "input_dim": null, "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_34_mpq_model", "pool_length": 66, "stride": 66, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_17_mpq_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"trainable": true, "W_regularizer": null, "input_dtype": "int32", "batch_input_shape": [null, 140], "activity_regularizer": null, "name": "embedding_1_tac_model", "dropout": 0.2, "W_constraint": null, "output_dim": 52, "init": "uniform", "input_length": 140, "mask_zero": false, "input_dim": 428669}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_tac_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution1d_1_tac_model", "activation": "relu", "W_constraint": null, "nb_filter": 200, "border_mode": "valid", "bias": true, "input_length": null, "filter_length": 6, "input_dim": null, "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_1_tac_model", "pool_length": 4, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution1d_2_tac_model", "activation": "relu", "W_constraint": null, "nb_filter": 200, "border_mode": "valid", "bias": true, "input_length": null, "filter_length": 6, "input_dim": null, "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_2_tac_model", "pool_length": 66, "stride": 66, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_tac_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}], "mode": "concat", "concat_axis": -1, "name": "merge_1", "output_shape_type": "raw", "dot_axes": -1}, "class_name": "Merge"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "name": "dense_1", "bias": true, "W_constraint": null, "output_dim": 1028, "init": "glorot_uniform", "input_dim": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "activation": "softmax", "b_constraint": null, "activity_regularizer": null, "name": "dense_2", "bias": true, "W_constraint": null, "output_dim": 3, "init": "glorot_uniform", "input_dim": null}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}