{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"output_shape_type": "raw", "dot_axes": -1, "mode": "concat", "concat_axis": -1, "name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "input_dtype": "int32", "W_constraint": null, "name": "embedding_17_mpq_model", "input_dim": 428669, "trainable": true, "mask_zero": false, "dropout": 0.2, "output_dim": 52, "batch_input_shape": [null, 140], "input_length": 140, "init": "uniform", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_17_mpq_model"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "W_regularizer": null, "subsample_length": 1, "name": "convolution1d_33_mpq_model", "filter_length": 6, "trainable": true, "nb_filter": 200, "bias": true, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "input_dim": null, "input_length": null, "border_mode": "valid", "init": "uniform", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_33_mpq_model"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "W_regularizer": null, "subsample_length": 1, "name": "convolution1d_34_mpq_model", "filter_length": 6, "trainable": true, "nb_filter": 200, "bias": true, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "input_dim": null, "input_length": null, "border_mode": "valid", "init": "uniform", "activation": "relu"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "input_dtype": "int32", "W_constraint": null, "name": "embedding_1_semeval_model", "input_dim": 1576890, "trainable": true, "mask_zero": false, "dropout": 0.2, "output_dim": 52, "batch_input_shape": [null, 140], "input_length": 140, "init": "uniform", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "W_regularizer": null, "subsample_length": 1, "name": "convolution1d_1_semeval_model", "filter_length": 6, "trainable": true, "nb_filter": 200, "bias": true, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "input_dim": null, "input_length": null, "border_mode": "valid", "init": "uniform", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "W_regularizer": null, "subsample_length": 1, "name": "convolution1d_2_semeval_model", "filter_length": 6, "trainable": true, "nb_filter": 200, "bias": true, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "input_dim": null, "input_length": null, "border_mode": "valid", "init": "uniform", "activation": "relu"}}]}], "output_shape": null, "mode_type": "raw"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "trainable": true, "name": "maxpooling1d_1", "stride": 2, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "W_regularizer": null, "subsample_length": 1, "name": "convolution1d_1", "filter_length": 6, "trainable": true, "nb_filter": 200, "bias": true, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "input_dim": null, "input_length": null, "border_mode": "valid", "init": "uniform", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "trainable": true, "name": "maxpooling1d_2", "stride": 2, "pool_length": 4}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "dense_1", "input_dim": null, "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "output_dim": 200, "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "dense_2", "input_dim": null, "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "output_dim": 3, "init": "glorot_uniform", "activation": "softmax"}}]}