{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "W_regularizer": null, "input_dim": 2950660, "trainable": true, "name": "embedding_1", "activity_regularizer": null, "input_dtype": "int32", "mask_zero": false, "init": "uniform", "output_dim": 52, "batch_input_shape": [null, 140], "dropout": 0.2, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1", "padding": 5}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "bias": true, "input_dim": null, "subsample_length": 1, "b_regularizer": null, "name": "convolution1d_1", "border_mode": "valid", "activity_regularizer": null, "init": "uniform", "activation": "relu", "filter_length": 6, "nb_filter": 200, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "bias": true, "input_dim": null, "subsample_length": 1, "b_regularizer": null, "name": "convolution1d_2", "border_mode": "valid", "activity_regularizer": null, "init": "uniform", "activation": "relu", "filter_length": 6, "nb_filter": 200, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "trainable": true, "stride": 66, "border_mode": "valid", "name": "maxpooling1d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "dense_1", "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 200, "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "dense_2", "activity_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "output_dim": 3, "bias": true}}], "keras_version": "1.1.0"}