{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "output_shape_type": "raw", "mode_type": "raw", "mode": "concat", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "W_constraint": null, "trainable": true, "name": "embedding_1_dil_model", "activity_regularizer": null, "dropout": 0.2, "output_dim": 52, "input_dim": 1576890, "mask_zero": false, "W_regularizer": null, "input_length": 140, "init": "uniform", "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "trainable": true, "name": "convolution1d_1_dil_model", "border_mode": "valid", "bias": true, "filter_length": 6, "input_dim": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_length": null, "b_regularizer": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dil_model", "stride": 2, "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "trainable": true, "name": "convolution1d_2_dil_model", "border_mode": "valid", "bias": true, "filter_length": 6, "input_dim": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_length": null, "b_regularizer": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dil_model", "stride": 66, "border_mode": "valid", "pool_length": 66, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dil_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "W_constraint": null, "trainable": true, "name": "embedding_17_mpq_model", "activity_regularizer": null, "dropout": 0.2, "output_dim": 52, "input_dim": 428669, "mask_zero": false, "W_regularizer": null, "input_length": 140, "init": "uniform", "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "trainable": true, "name": "convolution1d_33_mpq_model", "border_mode": "valid", "bias": true, "filter_length": 6, "input_dim": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_length": null, "b_regularizer": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_33_mpq_model", "stride": 2, "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "trainable": true, "name": "convolution1d_34_mpq_model", "border_mode": "valid", "bias": true, "filter_length": 6, "input_dim": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_length": null, "b_regularizer": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_34_mpq_model", "stride": 66, "border_mode": "valid", "pool_length": 66, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_17_mpq_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "W_constraint": null, "trainable": true, "name": "embedding_1_dai_model", "activity_regularizer": null, "dropout": 0.2, "output_dim": 52, "input_dim": 1576890, "mask_zero": false, "W_regularizer": null, "input_length": 140, "init": "uniform", "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "trainable": true, "name": "convolution1d_1_dai_model", "border_mode": "valid", "bias": true, "filter_length": 6, "input_dim": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_length": null, "b_regularizer": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dai_model", "stride": 2, "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "trainable": true, "name": "convolution1d_2_dai_model", "border_mode": "valid", "bias": true, "filter_length": 6, "input_dim": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_length": null, "b_regularizer": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dai_model", "stride": 66, "border_mode": "valid", "pool_length": 66, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dai_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "W_constraint": null, "trainable": true, "name": "embedding_1_hul_model", "activity_regularizer": null, "dropout": 0.2, "output_dim": 52, "input_dim": 1062158, "mask_zero": false, "W_regularizer": null, "input_length": 140, "init": "uniform", "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "trainable": true, "name": "convolution1d_1_hul_model", "border_mode": "valid", "bias": true, "filter_length": 6, "input_dim": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_length": null, "b_regularizer": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_hul_model", "stride": 2, "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "trainable": true, "name": "convolution1d_2_hul_model", "border_mode": "valid", "bias": true, "filter_length": 6, "input_dim": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_length": null, "b_regularizer": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_hul_model", "stride": 66, "border_mode": "valid", "pool_length": 66, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1_hul_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "W_constraint": null, "trainable": true, "name": "embedding_1_semeval_model", "activity_regularizer": null, "dropout": 0.2, "output_dim": 52, "input_dim": 428669, "mask_zero": false, "W_regularizer": null, "input_length": 140, "init": "uniform", "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "trainable": true, "name": "convolution1d_1_semeval_model", "border_mode": "valid", "bias": true, "filter_length": 6, "input_dim": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_length": null, "b_regularizer": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_semeval_model", "stride": 2, "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "trainable": true, "name": "convolution1d_2_semeval_model", "border_mode": "valid", "bias": true, "filter_length": 6, "input_dim": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_length": null, "b_regularizer": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_semeval_model", "stride": 66, "border_mode": "valid", "pool_length": 66, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1_semeval_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "W_constraint": null, "trainable": true, "name": "embedding_1_tac_model", "activity_regularizer": null, "dropout": 0.2, "output_dim": 52, "input_dim": 428669, "mask_zero": false, "W_regularizer": null, "input_length": 140, "init": "uniform", "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "trainable": true, "name": "convolution1d_1_tac_model", "border_mode": "valid", "bias": true, "filter_length": 6, "input_dim": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_length": null, "b_regularizer": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_tac_model", "stride": 2, "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "trainable": true, "name": "convolution1d_2_tac_model", "border_mode": "valid", "bias": true, "filter_length": 6, "input_dim": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_length": null, "b_regularizer": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_tac_model", "stride": 66, "border_mode": "valid", "pool_length": 66, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1_tac_model", "trainable": true}}]}], "output_shape": null, "dot_axes": -1}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "activity_regularizer": null, "bias": true, "input_dim": null, "output_dim": 1028, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_2", "activity_regularizer": null, "bias": true, "input_dim": null, "output_dim": 3, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "softmax"}}], "keras_version": "1.1.1"}