{"keras_version": "1.1.1", "config": [{"config": {"mode_type": "raw", "mode": "concat", "dot_axes": -1, "name": "merge_1", "layers": [{"config": [{"config": {"batch_input_shape": [null, 140], "mask_zero": false, "W_constraint": null, "name": "embedding_17_mpq_model", "input_dim": 428669, "W_regularizer": null, "input_length": 140, "activity_regularizer": null, "trainable": true, "init": "uniform", "dropout": 0.2, "output_dim": 52, "input_dtype": "int32"}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_17_mpq_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "subsample_length": 1, "name": "convolution1d_33_mpq_model", "b_constraint": null, "input_dim": null, "W_regularizer": null, "input_length": null, "activity_regularizer": null, "init": "uniform", "b_regularizer": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "W_constraint": null, "bias": true}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "subsample_length": 1, "name": "convolution1d_34_mpq_model", "b_constraint": null, "input_dim": null, "W_regularizer": null, "input_length": null, "activity_regularizer": null, "init": "uniform", "b_regularizer": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "W_constraint": null, "bias": true}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_34_mpq_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_17_mpq_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "mask_zero": false, "W_constraint": null, "name": "embedding_1_tac_model", "input_dim": 428669, "W_regularizer": null, "input_length": 140, "activity_regularizer": null, "trainable": true, "init": "uniform", "dropout": 0.2, "output_dim": 52, "input_dtype": "int32"}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "subsample_length": 1, "name": "convolution1d_1_tac_model", "b_constraint": null, "input_dim": null, "W_regularizer": null, "input_length": null, "activity_regularizer": null, "init": "uniform", "b_regularizer": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "W_constraint": null, "bias": true}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_tac_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "subsample_length": 1, "name": "convolution1d_2_tac_model", "b_constraint": null, "input_dim": null, "W_regularizer": null, "input_length": null, "activity_regularizer": null, "init": "uniform", "b_regularizer": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "W_constraint": null, "bias": true}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_2_tac_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_tac_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "mask_zero": false, "W_constraint": null, "name": "embedding_1_semeval_model", "input_dim": 428669, "W_regularizer": null, "input_length": 140, "activity_regularizer": null, "trainable": true, "init": "uniform", "dropout": 0.2, "output_dim": 52, "input_dtype": "int32"}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "subsample_length": 1, "name": "convolution1d_1_semeval_model", "b_constraint": null, "input_dim": null, "W_regularizer": null, "input_length": null, "activity_regularizer": null, "init": "uniform", "b_regularizer": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "W_constraint": null, "bias": true}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "subsample_length": 1, "name": "convolution1d_2_semeval_model", "b_constraint": null, "input_dim": null, "W_regularizer": null, "input_length": null, "activity_regularizer": null, "init": "uniform", "b_regularizer": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "W_constraint": null, "bias": true}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_2_semeval_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_semeval_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "mask_zero": false, "W_constraint": null, "name": "embedding_1_dil_model", "input_dim": 1576890, "W_regularizer": null, "input_length": 140, "activity_regularizer": null, "trainable": true, "init": "uniform", "dropout": 0.2, "output_dim": 52, "input_dtype": "int32"}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_dil_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "subsample_length": 1, "name": "convolution1d_1_dil_model", "b_constraint": null, "input_dim": null, "W_regularizer": null, "input_length": null, "activity_regularizer": null, "init": "uniform", "b_regularizer": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "W_constraint": null, "bias": true}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_dil_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "subsample_length": 1, "name": "convolution1d_2_dil_model", "b_constraint": null, "input_dim": null, "W_regularizer": null, "input_length": null, "activity_regularizer": null, "init": "uniform", "b_regularizer": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "W_constraint": null, "bias": true}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_2_dil_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_dil_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "mask_zero": false, "W_constraint": null, "name": "embedding_1_dai_model", "input_dim": 1576890, "W_regularizer": null, "input_length": 140, "activity_regularizer": null, "trainable": true, "init": "uniform", "dropout": 0.2, "output_dim": 52, "input_dtype": "int32"}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_dai_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "subsample_length": 1, "name": "convolution1d_1_dai_model", "b_constraint": null, "input_dim": null, "W_regularizer": null, "input_length": null, "activity_regularizer": null, "init": "uniform", "b_regularizer": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "W_constraint": null, "bias": true}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_dai_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "subsample_length": 1, "name": "convolution1d_2_dai_model", "b_constraint": null, "input_dim": null, "W_regularizer": null, "input_length": null, "activity_regularizer": null, "init": "uniform", "b_regularizer": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "W_constraint": null, "bias": true}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_2_dai_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_dai_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "mask_zero": false, "W_constraint": null, "name": "embedding_1_hul_model", "input_dim": 1062158, "W_regularizer": null, "input_length": 140, "activity_regularizer": null, "trainable": true, "init": "uniform", "dropout": 0.2, "output_dim": 52, "input_dtype": "int32"}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "subsample_length": 1, "name": "convolution1d_1_hul_model", "b_constraint": null, "input_dim": null, "W_regularizer": null, "input_length": null, "activity_regularizer": null, "init": "uniform", "b_regularizer": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "W_constraint": null, "bias": true}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_hul_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "subsample_length": 1, "name": "convolution1d_2_hul_model", "b_constraint": null, "input_dim": null, "W_regularizer": null, "input_length": null, "activity_regularizer": null, "init": "uniform", "b_regularizer": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "W_constraint": null, "bias": true}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_2_hul_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_hul_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}], "concat_axis": -1, "output_shape_type": "raw", "output_shape": null}, "class_name": "Merge"}, {"config": {"W_constraint": null, "name": "dense_1", "b_constraint": null, "input_dim": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 1028}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"W_constraint": null, "name": "dense_2", "b_constraint": null, "input_dim": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "activation": "softmax", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 3}, "class_name": "Dense"}], "class_name": "Sequential"}