{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"init": "uniform", "dropout": 0.2, "input_length": 140, "mask_zero": false, "input_dim": 1576890, "name": "embedding_1", "input_dtype": "int32", "output_dim": 52, "trainable": true, "W_constraint": null, "W_regularizer": null, "batch_input_shape": [null, 140], "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1", "padding": 5}}, {"class_name": "Convolution1D", "config": {"bias": true, "subsample_length": 1, "init": "uniform", "nb_filter": 200, "b_constraint": null, "input_length": null, "border_mode": "valid", "input_dim": null, "name": "convolution1d_1", "activity_regularizer": null, "activation": "relu", "trainable": true, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_1", "stride": 2}}, {"class_name": "Convolution1D", "config": {"bias": true, "subsample_length": 1, "init": "uniform", "nb_filter": 200, "b_constraint": null, "input_length": null, "border_mode": "valid", "input_dim": null, "name": "convolution1d_2", "activity_regularizer": null, "activation": "relu", "trainable": true, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_2", "stride": 66}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "b_constraint": null, "output_dim": 200, "input_dim": null, "name": "dense_1", "activity_regularizer": null, "activation": "linear", "trainable": true, "W_constraint": null, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "b_constraint": null, "output_dim": 3, "input_dim": null, "name": "dense_2", "activity_regularizer": null, "activation": "softmax", "trainable": true, "W_constraint": null, "W_regularizer": null, "b_regularizer": null}}]}