{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "name": "embedding_35", "W_regularizer": null, "input_length": 140, "init": "uniform", "input_dtype": "int32", "trainable": true, "output_dim": 52, "batch_input_shape": [null, 140], "mask_zero": false, "input_dim": 1576890, "W_constraint": null, "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_35", "padding": 5}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "name": "convolution1d_69", "W_regularizer": null, "input_length": null, "init": "uniform", "border_mode": "valid", "trainable": true, "filter_length": 6, "bias": true, "subsample_length": 1, "b_regularizer": null, "input_dim": null, "activation": "relu", "W_constraint": null, "b_constraint": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_69", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "name": "convolution1d_70", "W_regularizer": null, "input_length": null, "init": "uniform", "border_mode": "valid", "trainable": true, "filter_length": 6, "bias": true, "subsample_length": 1, "b_regularizer": null, "input_dim": null, "activation": "relu", "W_constraint": null, "b_constraint": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_70", "pool_length": 66}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_35"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_69", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 200, "bias": true, "b_regularizer": null, "input_dim": null, "activation": "linear", "W_constraint": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_35"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_35"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_70", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 3, "bias": true, "b_regularizer": null, "input_dim": null, "activation": "softmax", "W_constraint": null, "b_constraint": null}}]}