{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "activity_regularizer": null, "init": "uniform", "input_length": 140, "name": "embedding_1", "W_regularizer": null, "mask_zero": false, "input_dtype": "int32", "input_dim": 1062158, "batch_input_shape": [null, 140], "trainable": true, "W_constraint": null, "output_dim": 52}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "W_regularizer": null, "border_mode": "valid", "b_constraint": null, "activity_regularizer": null, "filter_length": 6, "init": "uniform", "activation": "relu", "input_length": null, "name": "convolution1d_1", "nb_filter": 200, "input_dim": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "W_regularizer": null, "border_mode": "valid", "b_constraint": null, "activity_regularizer": null, "filter_length": 6, "init": "uniform", "activation": "relu", "input_length": null, "name": "convolution1d_2", "nb_filter": 200, "input_dim": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 66, "border_mode": "valid", "name": "maxpooling1d_2", "pool_length": 66}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_1", "W_regularizer": null, "output_dim": 200, "b_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "input_dim": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_2", "W_regularizer": null, "output_dim": 3, "b_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "input_dim": null}}], "keras_version": "1.1.1"}