{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"concat_axis": -1, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dtype": "int32", "trainable": true, "output_dim": 52, "name": "embedding_1_dai_model", "input_dim": 1576890, "dropout": 0.2, "mask_zero": false, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140], "W_constraint": null, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "b_constraint": null, "bias": true, "name": "convolution1d_1_dai_model", "filter_length": 6, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "border_mode": "valid", "activation": "relu", "input_length": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dai_model", "pool_length": 4, "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "b_constraint": null, "bias": true, "name": "convolution1d_2_dai_model", "filter_length": 6, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "border_mode": "valid", "activation": "relu", "input_length": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dai_model", "pool_length": 66, "trainable": true, "stride": 66, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dai_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dtype": "int32", "trainable": true, "output_dim": 52, "name": "embedding_1_dil_model", "input_dim": 1576890, "dropout": 0.2, "mask_zero": false, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140], "W_constraint": null, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "b_constraint": null, "bias": true, "name": "convolution1d_1_dil_model", "filter_length": 6, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "border_mode": "valid", "activation": "relu", "input_length": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dil_model", "pool_length": 4, "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "b_constraint": null, "bias": true, "name": "convolution1d_2_dil_model", "filter_length": 6, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "border_mode": "valid", "activation": "relu", "input_length": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dil_model", "pool_length": 66, "trainable": true, "stride": 66, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dil_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dtype": "int32", "trainable": true, "output_dim": 52, "name": "embedding_1_semeval_model", "input_dim": 428669, "dropout": 0.2, "mask_zero": false, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140], "W_constraint": null, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "b_constraint": null, "bias": true, "name": "convolution1d_1_semeval_model", "filter_length": 6, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "border_mode": "valid", "activation": "relu", "input_length": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_semeval_model", "pool_length": 4, "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "b_constraint": null, "bias": true, "name": "convolution1d_2_semeval_model", "filter_length": 6, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "border_mode": "valid", "activation": "relu", "input_length": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_semeval_model", "pool_length": 66, "trainable": true, "stride": 66, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1_semeval_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dtype": "int32", "trainable": true, "output_dim": 52, "name": "embedding_17_mpq_model", "input_dim": 428669, "dropout": 0.2, "mask_zero": false, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140], "W_constraint": null, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "b_constraint": null, "bias": true, "name": "convolution1d_33_mpq_model", "filter_length": 6, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "border_mode": "valid", "activation": "relu", "input_length": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_33_mpq_model", "pool_length": 4, "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "b_constraint": null, "bias": true, "name": "convolution1d_34_mpq_model", "filter_length": 6, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "border_mode": "valid", "activation": "relu", "input_length": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_34_mpq_model", "pool_length": 66, "trainable": true, "stride": 66, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_17_mpq_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dtype": "int32", "trainable": true, "output_dim": 52, "name": "embedding_1_hul_model", "input_dim": 1062158, "dropout": 0.2, "mask_zero": false, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140], "W_constraint": null, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "b_constraint": null, "bias": true, "name": "convolution1d_1_hul_model", "filter_length": 6, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "border_mode": "valid", "activation": "relu", "input_length": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_hul_model", "pool_length": 4, "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "b_constraint": null, "bias": true, "name": "convolution1d_2_hul_model", "filter_length": 6, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "border_mode": "valid", "activation": "relu", "input_length": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_hul_model", "pool_length": 66, "trainable": true, "stride": 66, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1_hul_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dtype": "int32", "trainable": true, "output_dim": 52, "name": "embedding_1_tac_model", "input_dim": 428669, "dropout": 0.2, "mask_zero": false, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140], "W_constraint": null, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "b_constraint": null, "bias": true, "name": "convolution1d_1_tac_model", "filter_length": 6, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "border_mode": "valid", "activation": "relu", "input_length": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_tac_model", "pool_length": 4, "trainable": true, "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "b_constraint": null, "bias": true, "name": "convolution1d_2_tac_model", "filter_length": 6, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "border_mode": "valid", "activation": "relu", "input_length": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_tac_model", "pool_length": 66, "trainable": true, "stride": 66, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1_tac_model", "trainable": true}}]}], "name": "merge_1", "output_shape": null, "mode_type": "raw", "output_shape_type": "raw", "dot_axes": -1, "mode": "concat"}}, {"class_name": "Dense", "config": {"trainable": true, "b_constraint": null, "input_dim": null, "name": "dense_1", "output_dim": 1028, "bias": true, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "b_constraint": null, "input_dim": null, "name": "dense_2", "output_dim": 3, "bias": true, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "softmax"}}]}