{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"trainable": true, "batch_input_shape": [null, 140], "mask_zero": false, "input_dtype": "int32", "init": "uniform", "name": "embedding_1", "activity_regularizer": null, "input_length": 140, "input_dim": 1576890, "W_regularizer": null, "W_constraint": null, "dropout": 0.2, "output_dim": 52}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "border_mode": "valid", "bias": true, "name": "convolution1d_1", "init": "uniform", "activity_regularizer": null, "input_length": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "activation": "relu", "subsample_length": 1, "input_dim": null, "b_constraint": null, "nb_filter": 200, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "maxpooling1d_1", "stride": 2, "pool_length": 4, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "border_mode": "valid", "bias": true, "name": "convolution1d_2", "init": "uniform", "activity_regularizer": null, "input_length": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "activation": "relu", "subsample_length": 1, "input_dim": null, "b_constraint": null, "nb_filter": 200, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "maxpooling1d_2", "stride": 66, "pool_length": 66, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "name": "dense_1", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "activation": "linear", "output_dim": 200, "input_dim": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "name": "dense_2", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "activation": "softmax", "output_dim": 3, "input_dim": null, "b_constraint": null, "b_regularizer": null}}]}