{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"mode": "concat", "dot_axes": -1, "concat_axis": -1, "output_shape": null, "mode_type": "raw", "name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_regularizer": null, "output_dim": 52, "trainable": true, "input_length": 140, "activity_regularizer": null, "batch_input_shape": [null, 140], "init": "uniform", "input_dtype": "int32", "W_constraint": null, "input_dim": 1062158, "dropout": 0.2, "name": "embedding_1_hul_model", "mask_zero": false}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "uniform", "trainable": true, "input_length": null, "border_mode": "valid", "input_dim": null, "name": "convolution1d_1_hul_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_hul_model", "trainable": true, "stride": 2, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "uniform", "trainable": true, "input_length": null, "border_mode": "valid", "input_dim": null, "name": "convolution1d_2_hul_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_2_hul_model", "trainable": true, "stride": 66, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_hul_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_regularizer": null, "output_dim": 52, "trainable": true, "input_length": 140, "activity_regularizer": null, "batch_input_shape": [null, 140], "init": "uniform", "input_dtype": "int32", "W_constraint": null, "input_dim": 428669, "dropout": 0.2, "name": "embedding_1_semeval_model", "mask_zero": false}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "uniform", "trainable": true, "input_length": null, "border_mode": "valid", "input_dim": null, "name": "convolution1d_1_semeval_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "trainable": true, "stride": 2, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "uniform", "trainable": true, "input_length": null, "border_mode": "valid", "input_dim": null, "name": "convolution1d_2_semeval_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_2_semeval_model", "trainable": true, "stride": 66, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_semeval_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_regularizer": null, "output_dim": 52, "trainable": true, "input_length": 140, "activity_regularizer": null, "batch_input_shape": [null, 140], "init": "uniform", "input_dtype": "int32", "W_constraint": null, "input_dim": 1576890, "dropout": 0.2, "name": "embedding_1_dai_model", "mask_zero": false}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "uniform", "trainable": true, "input_length": null, "border_mode": "valid", "input_dim": null, "name": "convolution1d_1_dai_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_dai_model", "trainable": true, "stride": 2, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "uniform", "trainable": true, "input_length": null, "border_mode": "valid", "input_dim": null, "name": "convolution1d_2_dai_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_2_dai_model", "trainable": true, "stride": 66, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dai_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_regularizer": null, "output_dim": 52, "trainable": true, "input_length": 140, "activity_regularizer": null, "batch_input_shape": [null, 140], "init": "uniform", "input_dtype": "int32", "W_constraint": null, "input_dim": 1576890, "dropout": 0.2, "name": "embedding_1_dil_model", "mask_zero": false}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "uniform", "trainable": true, "input_length": null, "border_mode": "valid", "input_dim": null, "name": "convolution1d_1_dil_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_dil_model", "trainable": true, "stride": 2, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "uniform", "trainable": true, "input_length": null, "border_mode": "valid", "input_dim": null, "name": "convolution1d_2_dil_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_2_dil_model", "trainable": true, "stride": 66, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dil_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_regularizer": null, "output_dim": 52, "trainable": true, "input_length": 140, "activity_regularizer": null, "batch_input_shape": [null, 140], "init": "uniform", "input_dtype": "int32", "W_constraint": null, "input_dim": 428669, "dropout": 0.2, "name": "embedding_1_tac_model", "mask_zero": false}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "uniform", "trainable": true, "input_length": null, "border_mode": "valid", "input_dim": null, "name": "convolution1d_1_tac_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_tac_model", "trainable": true, "stride": 2, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "uniform", "trainable": true, "input_length": null, "border_mode": "valid", "input_dim": null, "name": "convolution1d_2_tac_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_2_tac_model", "trainable": true, "stride": 66, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_tac_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_regularizer": null, "output_dim": 52, "trainable": true, "input_length": 140, "activity_regularizer": null, "batch_input_shape": [null, 140], "init": "uniform", "input_dtype": "int32", "W_constraint": null, "input_dim": 428669, "dropout": 0.2, "name": "embedding_17_mpq_model", "mask_zero": false}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "uniform", "trainable": true, "input_length": null, "border_mode": "valid", "input_dim": null, "name": "convolution1d_33_mpq_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "trainable": true, "stride": 2, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "nb_filter": 200, "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "uniform", "trainable": true, "input_length": null, "border_mode": "valid", "input_dim": null, "name": "convolution1d_34_mpq_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_34_mpq_model", "trainable": true, "stride": 66, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_17_mpq_model", "trainable": true}}]}], "output_shape_type": "raw"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "name": "dense_1", "output_dim": 1028}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "softmax", "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "name": "dense_2", "output_dim": 3}}]}