{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "dot_axes": -1, "mode": "concat", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "output_dim": 52, "input_dtype": "int32", "trainable": true, "input_dim": 1576890, "mask_zero": false, "name": "embedding_1_dil_model", "activity_regularizer": null, "input_length": 140, "batch_input_shape": [null, 140], "W_regularizer": null, "init": "uniform", "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "nb_filter": 200, "filter_length": 6, "init": "uniform", "activation": "relu", "b_constraint": null, "subsample_length": 1, "name": "convolution1d_1_dil_model", "activity_regularizer": null, "input_length": null, "W_regularizer": null, "trainable": true, "bias": true, "b_regularizer": null, "input_dim": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dil_model", "pool_length": 4, "border_mode": "valid", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "nb_filter": 200, "filter_length": 6, "init": "uniform", "activation": "relu", "b_constraint": null, "subsample_length": 1, "name": "convolution1d_2_dil_model", "activity_regularizer": null, "input_length": null, "W_regularizer": null, "trainable": true, "bias": true, "b_regularizer": null, "input_dim": null, "W_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "output_dim": 52, "input_dtype": "int32", "trainable": true, "input_dim": 1062158, "mask_zero": false, "name": "embedding_1_hul_model", "activity_regularizer": null, "input_length": 140, "batch_input_shape": [null, 140], "W_regularizer": null, "init": "uniform", "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "nb_filter": 200, "filter_length": 6, "init": "uniform", "activation": "relu", "b_constraint": null, "subsample_length": 1, "name": "convolution1d_1_hul_model", "activity_regularizer": null, "input_length": null, "W_regularizer": null, "trainable": true, "bias": true, "b_regularizer": null, "input_dim": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_hul_model", "pool_length": 4, "border_mode": "valid", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "nb_filter": 200, "filter_length": 6, "init": "uniform", "activation": "relu", "b_constraint": null, "subsample_length": 1, "name": "convolution1d_2_hul_model", "activity_regularizer": null, "input_length": null, "W_regularizer": null, "trainable": true, "bias": true, "b_regularizer": null, "input_dim": null, "W_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "output_dim": 52, "input_dtype": "int32", "trainable": true, "input_dim": 428669, "mask_zero": false, "name": "embedding_17_mpq_model", "activity_regularizer": null, "input_length": 140, "batch_input_shape": [null, 140], "W_regularizer": null, "init": "uniform", "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "nb_filter": 200, "filter_length": 6, "init": "uniform", "activation": "relu", "b_constraint": null, "subsample_length": 1, "name": "convolution1d_33_mpq_model", "activity_regularizer": null, "input_length": null, "W_regularizer": null, "trainable": true, "bias": true, "b_regularizer": null, "input_dim": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_33_mpq_model", "pool_length": 4, "border_mode": "valid", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "nb_filter": 200, "filter_length": 6, "init": "uniform", "activation": "relu", "b_constraint": null, "subsample_length": 1, "name": "convolution1d_34_mpq_model", "activity_regularizer": null, "input_length": null, "W_regularizer": null, "trainable": true, "bias": true, "b_regularizer": null, "input_dim": null, "W_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "output_dim": 52, "input_dtype": "int32", "trainable": true, "input_dim": 1576890, "mask_zero": false, "name": "embedding_1_semeval_model", "activity_regularizer": null, "input_length": 140, "batch_input_shape": [null, 140], "W_regularizer": null, "init": "uniform", "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "nb_filter": 200, "filter_length": 6, "init": "uniform", "activation": "relu", "b_constraint": null, "subsample_length": 1, "name": "convolution1d_1_semeval_model", "activity_regularizer": null, "input_length": null, "W_regularizer": null, "trainable": true, "bias": true, "b_regularizer": null, "input_dim": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_semeval_model", "pool_length": 4, "border_mode": "valid", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "nb_filter": 200, "filter_length": 6, "init": "uniform", "activation": "relu", "b_constraint": null, "subsample_length": 1, "name": "convolution1d_2_semeval_model", "activity_regularizer": null, "input_length": null, "W_regularizer": null, "trainable": true, "bias": true, "b_regularizer": null, "input_dim": null, "W_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "output_dim": 52, "input_dtype": "int32", "trainable": true, "input_dim": 428669, "mask_zero": false, "name": "embedding_1_tac_model", "activity_regularizer": null, "input_length": 140, "batch_input_shape": [null, 140], "W_regularizer": null, "init": "uniform", "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "nb_filter": 200, "filter_length": 6, "init": "uniform", "activation": "relu", "b_constraint": null, "subsample_length": 1, "name": "convolution1d_1_tac_model", "activity_regularizer": null, "input_length": null, "W_regularizer": null, "trainable": true, "bias": true, "b_regularizer": null, "input_dim": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_tac_model", "pool_length": 4, "border_mode": "valid", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "nb_filter": 200, "filter_length": 6, "init": "uniform", "activation": "relu", "b_constraint": null, "subsample_length": 1, "name": "convolution1d_2_tac_model", "activity_regularizer": null, "input_length": null, "W_regularizer": null, "trainable": true, "bias": true, "b_regularizer": null, "input_dim": null, "W_constraint": null}}]}], "concat_axis": -1, "output_shape_type": "raw", "mode_type": "raw", "output_shape": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1", "pool_length": 4, "border_mode": "valid", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "nb_filter": 200, "filter_length": 6, "input_dim": null, "activation": "relu", "b_constraint": null, "subsample_length": 1, "name": "convolution1d_1", "activity_regularizer": null, "input_length": null, "W_regularizer": null, "trainable": true, "bias": true, "b_regularizer": null, "init": "uniform", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2", "pool_length": 4, "border_mode": "valid", "trainable": true, "stride": 2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 200, "trainable": true, "input_dim": null, "activation": "linear", "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 3, "trainable": true, "input_dim": null, "activation": "softmax", "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}]}