{"config": [{"config": {"mode": "concat", "output_shape": null, "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "layers": [{"config": [{"config": {"W_constraint": null, "init": "uniform", "input_dtype": "int32", "input_dim": 1576890, "W_regularizer": null, "output_dim": 52, "input_length": 140, "mask_zero": false, "dropout": 0.2, "trainable": true, "activity_regularizer": null, "name": "embedding_1_dil_model", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_dil_model"}, "class_name": "ZeroPadding1D"}, {"config": {"subsample_length": 1, "W_constraint": null, "init": "uniform", "input_dim": null, "W_regularizer": null, "border_mode": "valid", "activation": "relu", "b_regularizer": null, "bias": true, "input_length": null, "nb_filter": 200, "trainable": true, "activity_regularizer": null, "filter_length": 6, "name": "convolution1d_1_dil_model", "b_constraint": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_1_dil_model", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "W_constraint": null, "init": "uniform", "input_dim": null, "W_regularizer": null, "border_mode": "valid", "activation": "relu", "b_regularizer": null, "bias": true, "input_length": null, "nb_filter": 200, "trainable": true, "activity_regularizer": null, "filter_length": 6, "name": "convolution1d_2_dil_model", "b_constraint": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"W_constraint": null, "init": "uniform", "input_dtype": "int32", "input_dim": 1062158, "W_regularizer": null, "output_dim": 52, "input_length": 140, "mask_zero": false, "dropout": 0.2, "trainable": true, "activity_regularizer": null, "name": "embedding_1_hul_model", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_hul_model"}, "class_name": "ZeroPadding1D"}, {"config": {"subsample_length": 1, "W_constraint": null, "init": "uniform", "input_dim": null, "W_regularizer": null, "border_mode": "valid", "activation": "relu", "b_regularizer": null, "bias": true, "input_length": null, "nb_filter": 200, "trainable": true, "activity_regularizer": null, "filter_length": 6, "name": "convolution1d_1_hul_model", "b_constraint": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_1_hul_model", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "W_constraint": null, "init": "uniform", "input_dim": null, "W_regularizer": null, "border_mode": "valid", "activation": "relu", "b_regularizer": null, "bias": true, "input_length": null, "nb_filter": 200, "trainable": true, "activity_regularizer": null, "filter_length": 6, "name": "convolution1d_2_hul_model", "b_constraint": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"W_constraint": null, "init": "uniform", "input_dtype": "int32", "input_dim": 428669, "W_regularizer": null, "output_dim": 52, "input_length": 140, "mask_zero": false, "dropout": 0.2, "trainable": true, "activity_regularizer": null, "name": "embedding_17_mpq_model", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_17_mpq_model"}, "class_name": "ZeroPadding1D"}, {"config": {"subsample_length": 1, "W_constraint": null, "init": "uniform", "input_dim": null, "W_regularizer": null, "border_mode": "valid", "activation": "relu", "b_regularizer": null, "bias": true, "input_length": null, "nb_filter": 200, "trainable": true, "activity_regularizer": null, "filter_length": 6, "name": "convolution1d_33_mpq_model", "b_constraint": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "W_constraint": null, "init": "uniform", "input_dim": null, "W_regularizer": null, "border_mode": "valid", "activation": "relu", "b_regularizer": null, "bias": true, "input_length": null, "nb_filter": 200, "trainable": true, "activity_regularizer": null, "filter_length": 6, "name": "convolution1d_34_mpq_model", "b_constraint": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"W_constraint": null, "init": "uniform", "input_dtype": "int32", "input_dim": 428669, "W_regularizer": null, "output_dim": 52, "input_length": 140, "mask_zero": false, "dropout": 0.2, "trainable": true, "activity_regularizer": null, "name": "embedding_1_semeval_model", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_semeval_model"}, "class_name": "ZeroPadding1D"}, {"config": {"subsample_length": 1, "W_constraint": null, "init": "uniform", "input_dim": null, "W_regularizer": null, "border_mode": "valid", "activation": "relu", "b_regularizer": null, "bias": true, "input_length": null, "nb_filter": 200, "trainable": true, "activity_regularizer": null, "filter_length": 6, "name": "convolution1d_1_semeval_model", "b_constraint": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "W_constraint": null, "init": "uniform", "input_dim": null, "W_regularizer": null, "border_mode": "valid", "activation": "relu", "b_regularizer": null, "bias": true, "input_length": null, "nb_filter": 200, "trainable": true, "activity_regularizer": null, "filter_length": 6, "name": "convolution1d_2_semeval_model", "b_constraint": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"W_constraint": null, "init": "uniform", "input_dtype": "int32", "input_dim": 428669, "W_regularizer": null, "output_dim": 52, "input_length": 140, "mask_zero": false, "dropout": 0.2, "trainable": true, "activity_regularizer": null, "name": "embedding_1_tac_model", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_tac_model"}, "class_name": "ZeroPadding1D"}, {"config": {"subsample_length": 1, "W_constraint": null, "init": "uniform", "input_dim": null, "W_regularizer": null, "border_mode": "valid", "activation": "relu", "b_regularizer": null, "bias": true, "input_length": null, "nb_filter": 200, "trainable": true, "activity_regularizer": null, "filter_length": 6, "name": "convolution1d_1_tac_model", "b_constraint": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_1_tac_model", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "W_constraint": null, "init": "uniform", "input_dim": null, "W_regularizer": null, "border_mode": "valid", "activation": "relu", "b_regularizer": null, "bias": true, "input_length": null, "nb_filter": 200, "trainable": true, "activity_regularizer": null, "filter_length": 6, "name": "convolution1d_2_tac_model", "b_constraint": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}], "name": "merge_1"}, "class_name": "Merge"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activation": "linear", "output_dim": 200, "bias": true, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "name": "dense_1", "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activation": "softmax", "output_dim": 3, "bias": true, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "name": "dense_2", "b_constraint": null}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}