{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"mode_type": "raw", "output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "dot_axes": -1, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "mask_zero": false, "input_dtype": "int32", "W_constraint": null, "name": "embedding_1_dai_model", "init": "uniform", "input_length": 140, "dropout": 0.2, "batch_input_shape": [null, 140], "W_regularizer": null, "input_dim": 1576890, "output_dim": 52, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_dai_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"trainable": true, "subsample_length": 1, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_1_dai_model", "init": "uniform", "input_dim": null, "b_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "activation": "relu", "filter_length": 6, "W_regularizer": null, "bias": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "name": "maxpooling1d_1_dai_model", "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"trainable": true, "subsample_length": 1, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_2_dai_model", "init": "uniform", "input_dim": null, "b_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "activation": "relu", "filter_length": 6, "W_regularizer": null, "bias": true, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "mask_zero": false, "input_dtype": "int32", "W_constraint": null, "name": "embedding_1_dil_model", "init": "uniform", "input_length": 140, "dropout": 0.2, "batch_input_shape": [null, 140], "W_regularizer": null, "input_dim": 1576890, "output_dim": 52, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_dil_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"trainable": true, "subsample_length": 1, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_1_dil_model", "init": "uniform", "input_dim": null, "b_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "activation": "relu", "filter_length": 6, "W_regularizer": null, "bias": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "name": "maxpooling1d_1_dil_model", "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"trainable": true, "subsample_length": 1, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_2_dil_model", "init": "uniform", "input_dim": null, "b_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "activation": "relu", "filter_length": 6, "W_regularizer": null, "bias": true, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "mask_zero": false, "input_dtype": "int32", "W_constraint": null, "name": "embedding_1_hul_model", "init": "uniform", "input_length": 140, "dropout": 0.2, "batch_input_shape": [null, 140], "W_regularizer": null, "input_dim": 1062158, "output_dim": 52, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_hul_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"trainable": true, "subsample_length": 1, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_1_hul_model", "init": "uniform", "input_dim": null, "b_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "activation": "relu", "filter_length": 6, "W_regularizer": null, "bias": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "name": "maxpooling1d_1_hul_model", "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"trainable": true, "subsample_length": 1, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_2_hul_model", "init": "uniform", "input_dim": null, "b_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "activation": "relu", "filter_length": 6, "W_regularizer": null, "bias": true, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "mask_zero": false, "input_dtype": "int32", "W_constraint": null, "name": "embedding_1_semeval_model", "init": "uniform", "input_length": 140, "dropout": 0.2, "batch_input_shape": [null, 140], "W_regularizer": null, "input_dim": 428669, "output_dim": 52, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_semeval_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"trainable": true, "subsample_length": 1, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_1_semeval_model", "init": "uniform", "input_dim": null, "b_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "activation": "relu", "filter_length": 6, "W_regularizer": null, "bias": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "name": "maxpooling1d_1_semeval_model", "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"trainable": true, "subsample_length": 1, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_2_semeval_model", "init": "uniform", "input_dim": null, "b_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "activation": "relu", "filter_length": 6, "W_regularizer": null, "bias": true, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "mask_zero": false, "input_dtype": "int32", "W_constraint": null, "name": "embedding_1_tac_model", "init": "uniform", "input_length": 140, "dropout": 0.2, "batch_input_shape": [null, 140], "W_regularizer": null, "input_dim": 428669, "output_dim": 52, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_tac_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"trainable": true, "subsample_length": 1, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_1_tac_model", "init": "uniform", "input_dim": null, "b_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "activation": "relu", "filter_length": 6, "W_regularizer": null, "bias": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "name": "maxpooling1d_1_tac_model", "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"trainable": true, "subsample_length": 1, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "name": "convolution1d_2_tac_model", "init": "uniform", "input_dim": null, "b_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "activation": "relu", "filter_length": 6, "W_regularizer": null, "bias": true, "input_length": null}}]}], "name": "merge_1", "mode": "concat"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "b_constraint": null, "W_constraint": null, "name": "dense_1", "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "bias": true, "input_dim": null, "output_dim": 200}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "b_constraint": null, "W_constraint": null, "name": "dense_2", "init": "glorot_uniform", "activity_regularizer": null, "activation": "softmax", "b_regularizer": null, "W_regularizer": null, "bias": true, "input_dim": null, "output_dim": 3}}], "keras_version": "1.1.1"}