{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "activity_regularizer": null, "output_dim": 52, "trainable": true, "dropout": 0.2, "input_dim": 428669, "W_regularizer": null, "init": "uniform", "input_dtype": "int32", "name": "embedding_1_tac_model", "batch_input_shape": [null, 140], "input_length": 140, "mask_zero": false}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "filter_length": 6, "input_dim": null, "W_regularizer": null, "init": "uniform", "nb_filter": 200, "border_mode": "valid", "name": "convolution1d_1_tac_model", "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_tac_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "filter_length": 6, "input_dim": null, "W_regularizer": null, "init": "uniform", "nb_filter": 200, "border_mode": "valid", "name": "convolution1d_2_tac_model", "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_2_tac_model"}}, {"class_name": "Flatten", "config": {"name": "flatten_1_tac_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "activity_regularizer": null, "output_dim": 52, "trainable": true, "dropout": 0.2, "input_dim": 1576890, "W_regularizer": null, "init": "uniform", "input_dtype": "int32", "name": "embedding_1_dai_model", "batch_input_shape": [null, 140], "input_length": 140, "mask_zero": false}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dai_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "filter_length": 6, "input_dim": null, "W_regularizer": null, "init": "uniform", "nb_filter": 200, "border_mode": "valid", "name": "convolution1d_1_dai_model", "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_dai_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "filter_length": 6, "input_dim": null, "W_regularizer": null, "init": "uniform", "nb_filter": 200, "border_mode": "valid", "name": "convolution1d_2_dai_model", "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_2_dai_model"}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dai_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "activity_regularizer": null, "output_dim": 52, "trainable": true, "dropout": 0.2, "input_dim": 1062158, "W_regularizer": null, "init": "uniform", "input_dtype": "int32", "name": "embedding_1_hul_model", "batch_input_shape": [null, 140], "input_length": 140, "mask_zero": false}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "filter_length": 6, "input_dim": null, "W_regularizer": null, "init": "uniform", "nb_filter": 200, "border_mode": "valid", "name": "convolution1d_1_hul_model", "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_hul_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "filter_length": 6, "input_dim": null, "W_regularizer": null, "init": "uniform", "nb_filter": 200, "border_mode": "valid", "name": "convolution1d_2_hul_model", "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_2_hul_model"}}, {"class_name": "Flatten", "config": {"name": "flatten_1_hul_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "activity_regularizer": null, "output_dim": 52, "trainable": true, "dropout": 0.2, "input_dim": 428669, "W_regularizer": null, "init": "uniform", "input_dtype": "int32", "name": "embedding_1_semeval_model", "batch_input_shape": [null, 140], "input_length": 140, "mask_zero": false}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "filter_length": 6, "input_dim": null, "W_regularizer": null, "init": "uniform", "nb_filter": 200, "border_mode": "valid", "name": "convolution1d_1_semeval_model", "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "filter_length": 6, "input_dim": null, "W_regularizer": null, "init": "uniform", "nb_filter": 200, "border_mode": "valid", "name": "convolution1d_2_semeval_model", "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_2_semeval_model"}}, {"class_name": "Flatten", "config": {"name": "flatten_1_semeval_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "activity_regularizer": null, "output_dim": 52, "trainable": true, "dropout": 0.2, "input_dim": 1576890, "W_regularizer": null, "init": "uniform", "input_dtype": "int32", "name": "embedding_1_dil_model", "batch_input_shape": [null, 140], "input_length": 140, "mask_zero": false}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dil_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "filter_length": 6, "input_dim": null, "W_regularizer": null, "init": "uniform", "nb_filter": 200, "border_mode": "valid", "name": "convolution1d_1_dil_model", "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_dil_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "filter_length": 6, "input_dim": null, "W_regularizer": null, "init": "uniform", "nb_filter": 200, "border_mode": "valid", "name": "convolution1d_2_dil_model", "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_2_dil_model"}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dil_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "activity_regularizer": null, "output_dim": 52, "trainable": true, "dropout": 0.2, "input_dim": 428669, "W_regularizer": null, "init": "uniform", "input_dtype": "int32", "name": "embedding_17_mpq_model", "batch_input_shape": [null, 140], "input_length": 140, "mask_zero": false}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_17_mpq_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "filter_length": 6, "input_dim": null, "W_regularizer": null, "init": "uniform", "nb_filter": 200, "border_mode": "valid", "name": "convolution1d_33_mpq_model", "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_33_mpq_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "filter_length": 6, "input_dim": null, "W_regularizer": null, "init": "uniform", "nb_filter": 200, "border_mode": "valid", "name": "convolution1d_34_mpq_model", "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_34_mpq_model"}}, {"class_name": "Flatten", "config": {"name": "flatten_17_mpq_model", "trainable": true}}]}], "dot_axes": -1, "mode_type": "raw", "output_shape_type": "raw", "name": "merge_1", "output_shape": null, "concat_axis": -1, "mode": "concat"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "output_dim": 1028, "trainable": true, "b_constraint": null, "activation": "linear", "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "b_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "output_dim": 3, "trainable": true, "b_constraint": null, "activation": "softmax", "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "b_regularizer": null, "bias": true}}]}