{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"mode_type": "raw", "name": "merge_1", "output_shape": null, "output_shape_type": "raw", "dot_axes": -1, "mode": "concat", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "init": "uniform", "W_regularizer": null, "input_dtype": "int32", "activity_regularizer": null, "input_length": 140, "mask_zero": false, "name": "embedding_1_dai_model", "dropout": 0.2, "input_dim": 1576890, "output_dim": 52, "trainable": true, "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "bias": true, "subsample_length": 1, "activity_regularizer": null, "input_length": null, "filter_length": 6, "name": "convolution1d_1_dai_model", "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "activation": "relu", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "name": "maxpooling1d_1_dai_model", "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "bias": true, "subsample_length": 1, "activity_regularizer": null, "input_length": null, "filter_length": 6, "name": "convolution1d_2_dai_model", "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "activation": "relu", "W_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "init": "uniform", "W_regularizer": null, "input_dtype": "int32", "activity_regularizer": null, "input_length": 140, "mask_zero": false, "name": "embedding_1_dil_model", "dropout": 0.2, "input_dim": 1576890, "output_dim": 52, "trainable": true, "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "bias": true, "subsample_length": 1, "activity_regularizer": null, "input_length": null, "filter_length": 6, "name": "convolution1d_1_dil_model", "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "activation": "relu", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "name": "maxpooling1d_1_dil_model", "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "bias": true, "subsample_length": 1, "activity_regularizer": null, "input_length": null, "filter_length": 6, "name": "convolution1d_2_dil_model", "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "activation": "relu", "W_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "init": "uniform", "W_regularizer": null, "input_dtype": "int32", "activity_regularizer": null, "input_length": 140, "mask_zero": false, "name": "embedding_17_mpq_model", "dropout": 0.2, "input_dim": 428669, "output_dim": 52, "trainable": true, "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "bias": true, "subsample_length": 1, "activity_regularizer": null, "input_length": null, "filter_length": 6, "name": "convolution1d_33_mpq_model", "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "activation": "relu", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "name": "maxpooling1d_33_mpq_model", "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "bias": true, "subsample_length": 1, "activity_regularizer": null, "input_length": null, "filter_length": 6, "name": "convolution1d_34_mpq_model", "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "activation": "relu", "W_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "init": "uniform", "W_regularizer": null, "input_dtype": "int32", "activity_regularizer": null, "input_length": 140, "mask_zero": false, "name": "embedding_1_semeval_model", "dropout": 0.2, "input_dim": 428669, "output_dim": 52, "trainable": true, "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "bias": true, "subsample_length": 1, "activity_regularizer": null, "input_length": null, "filter_length": 6, "name": "convolution1d_1_semeval_model", "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "activation": "relu", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "name": "maxpooling1d_1_semeval_model", "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "bias": true, "subsample_length": 1, "activity_regularizer": null, "input_length": null, "filter_length": 6, "name": "convolution1d_2_semeval_model", "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "activation": "relu", "W_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "init": "uniform", "W_regularizer": null, "input_dtype": "int32", "activity_regularizer": null, "input_length": 140, "mask_zero": false, "name": "embedding_1_tac_model", "dropout": 0.2, "input_dim": 428669, "output_dim": 52, "trainable": true, "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "bias": true, "subsample_length": 1, "activity_regularizer": null, "input_length": null, "filter_length": 6, "name": "convolution1d_1_tac_model", "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "activation": "relu", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "name": "maxpooling1d_1_tac_model", "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "b_regularizer": null, "W_regularizer": null, "nb_filter": 200, "bias": true, "subsample_length": 1, "activity_regularizer": null, "input_length": null, "filter_length": 6, "name": "convolution1d_2_tac_model", "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "activation": "relu", "W_constraint": null}}]}], "concat_axis": -1}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "name": "dense_1", "b_constraint": null, "input_dim": null, "output_dim": 200, "trainable": true, "activation": "linear", "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "name": "dense_2", "b_constraint": null, "input_dim": null, "output_dim": 3, "trainable": true, "activation": "softmax", "W_constraint": null}}]}