{"config": [{"config": {"init": "uniform", "input_dim": 1576890, "input_dtype": "int32", "name": "embedding_38", "output_dim": 52, "dropout": 0.2, "activity_regularizer": null, "input_length": 140, "trainable": true, "W_regularizer": null, "mask_zero": false, "batch_input_shape": [null, 140], "W_constraint": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_38", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"bias": true, "name": "convolution1d_149", "input_dim": null, "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "input_length": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "b_constraint": null, "activation": "relu", "subsample_length": 1, "init": "uniform", "nb_filter": 200, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_149", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"bias": true, "name": "convolution1d_150", "input_dim": null, "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "input_length": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "b_constraint": null, "activation": "relu", "subsample_length": 1, "init": "uniform", "nb_filter": 200, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_150", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"bias": true, "name": "convolution1d_151", "input_dim": null, "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "input_length": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "b_constraint": null, "activation": "relu", "subsample_length": 1, "init": "uniform", "nb_filter": 200, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_151", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"bias": true, "name": "convolution1d_152", "input_dim": null, "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "input_length": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "b_constraint": null, "activation": "relu", "subsample_length": 1, "init": "uniform", "nb_filter": 200, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 7, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_152", "stride": 7}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_38", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "input_dim": null, "name": "dense_75", "output_dim": 200, "bias": true, "activation": "linear", "activity_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_38", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "activation_38", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "input_dim": null, "name": "dense_76", "output_dim": 3, "bias": true, "activation": "softmax", "activity_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.0"}