{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "batch_input_shape": [null, 140], "name": "embedding_17_mpq_model", "W_constraint": null, "input_dtype": "int32", "output_dim": 52, "activity_regularizer": null, "input_dim": 428669, "W_regularizer": null, "input_length": 140, "trainable": true, "init": "uniform", "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "name": "convolution1d_33_mpq_model", "subsample_length": 1, "W_constraint": null, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_filter": 200, "W_regularizer": null, "input_length": null, "trainable": true, "b_constraint": null, "border_mode": "valid", "init": "uniform", "input_dim": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_33_mpq_model", "pool_length": 4, "stride": 2, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "name": "convolution1d_34_mpq_model", "subsample_length": 1, "W_constraint": null, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_filter": 200, "W_regularizer": null, "input_length": null, "trainable": true, "b_constraint": null, "border_mode": "valid", "init": "uniform", "input_dim": null, "bias": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "batch_input_shape": [null, 140], "name": "embedding_1_semeval_model", "W_constraint": null, "input_dtype": "int32", "output_dim": 52, "activity_regularizer": null, "input_dim": 1576890, "W_regularizer": null, "input_length": 140, "trainable": true, "init": "uniform", "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "name": "convolution1d_1_semeval_model", "subsample_length": 1, "W_constraint": null, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_filter": 200, "W_regularizer": null, "input_length": null, "trainable": true, "b_constraint": null, "border_mode": "valid", "init": "uniform", "input_dim": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_semeval_model", "pool_length": 4, "stride": 2, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "name": "convolution1d_2_semeval_model", "subsample_length": 1, "W_constraint": null, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_filter": 200, "W_regularizer": null, "input_length": null, "trainable": true, "b_constraint": null, "border_mode": "valid", "init": "uniform", "input_dim": null, "bias": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "batch_input_shape": [null, 140], "name": "embedding_1_tac_model", "W_constraint": null, "input_dtype": "int32", "output_dim": 52, "activity_regularizer": null, "input_dim": 428669, "W_regularizer": null, "input_length": 140, "trainable": true, "init": "uniform", "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "name": "convolution1d_1_tac_model", "subsample_length": 1, "W_constraint": null, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_filter": 200, "W_regularizer": null, "input_length": null, "trainable": true, "b_constraint": null, "border_mode": "valid", "init": "uniform", "input_dim": null, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_tac_model", "pool_length": 4, "stride": 2, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "name": "convolution1d_2_tac_model", "subsample_length": 1, "W_constraint": null, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_filter": 200, "W_regularizer": null, "input_length": null, "trainable": true, "b_constraint": null, "border_mode": "valid", "init": "uniform", "input_dim": null, "bias": true}}]}], "output_shape": null, "mode": "concat", "output_shape_type": "raw"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1", "trainable": true, "stride": 2, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "name": "convolution1d_1", "subsample_length": 1, "input_length": null, "bias": true, "activation": "relu", "activity_regularizer": null, "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "border_mode": "valid", "init": "uniform", "input_dim": null, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2", "trainable": true, "stride": 2, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "linear", "output_dim": 200, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "activation": "softmax", "output_dim": 3, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "bias": true}}], "keras_version": "1.1.1"}