{"config": [{"config": {"name": "merge_1", "output_shape_type": "raw", "output_shape": null, "layers": [{"config": [{"config": {"name": "embedding_17_mpq_model", "batch_input_shape": [null, 140], "W_regularizer": null, "mask_zero": false, "dropout": 0.2, "W_constraint": null, "output_dim": 52, "init": "uniform", "input_dim": 428669, "input_length": 140, "input_dtype": "int32", "trainable": true, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"name": "convolution1d_33_mpq_model", "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "bias": true, "filter_length": 6, "activation": "relu", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_33_mpq_model", "border_mode": "valid", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "convolution1d_34_mpq_model", "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "bias": true, "filter_length": 6, "activation": "relu", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"name": "embedding_1_tac_model", "batch_input_shape": [null, 140], "W_regularizer": null, "mask_zero": false, "dropout": 0.2, "W_constraint": null, "output_dim": 52, "init": "uniform", "input_dim": 428669, "input_length": 140, "input_dtype": "int32", "trainable": true, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"name": "convolution1d_1_tac_model", "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "bias": true, "filter_length": 6, "activation": "relu", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_tac_model", "border_mode": "valid", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "convolution1d_2_tac_model", "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "bias": true, "filter_length": 6, "activation": "relu", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"name": "embedding_1_dil_model", "batch_input_shape": [null, 140], "W_regularizer": null, "mask_zero": false, "dropout": 0.2, "W_constraint": null, "output_dim": 52, "init": "uniform", "input_dim": 1576890, "input_length": 140, "input_dtype": "int32", "trainable": true, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"name": "convolution1d_1_dil_model", "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "bias": true, "filter_length": 6, "activation": "relu", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_dil_model", "border_mode": "valid", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "convolution1d_2_dil_model", "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "bias": true, "filter_length": 6, "activation": "relu", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"name": "embedding_1_hul_model", "batch_input_shape": [null, 140], "W_regularizer": null, "mask_zero": false, "dropout": 0.2, "W_constraint": null, "output_dim": 52, "init": "uniform", "input_dim": 1062158, "input_length": 140, "input_dtype": "int32", "trainable": true, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"name": "convolution1d_1_hul_model", "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "bias": true, "filter_length": 6, "activation": "relu", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_hul_model", "border_mode": "valid", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "convolution1d_2_hul_model", "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "bias": true, "filter_length": 6, "activation": "relu", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"name": "embedding_1_semeval_model", "batch_input_shape": [null, 140], "W_regularizer": null, "mask_zero": false, "dropout": 0.2, "W_constraint": null, "output_dim": 52, "init": "uniform", "input_dim": 428669, "input_length": 140, "input_dtype": "int32", "trainable": true, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"name": "convolution1d_1_semeval_model", "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "bias": true, "filter_length": 6, "activation": "relu", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_semeval_model", "border_mode": "valid", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "convolution1d_2_semeval_model", "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "bias": true, "filter_length": 6, "activation": "relu", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"name": "embedding_1_dai_model", "batch_input_shape": [null, 140], "W_regularizer": null, "mask_zero": false, "dropout": 0.2, "W_constraint": null, "output_dim": 52, "init": "uniform", "input_dim": 1576890, "input_length": 140, "input_dtype": "int32", "trainable": true, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"name": "convolution1d_1_dai_model", "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "bias": true, "filter_length": 6, "activation": "relu", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_dai_model", "border_mode": "valid", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "convolution1d_2_dai_model", "W_regularizer": null, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "bias": true, "filter_length": 6, "activation": "relu", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}], "concat_axis": -1, "mode": "concat", "mode_type": "raw", "dot_axes": -1}, "class_name": "Merge"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "bias": true, "input_dim": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 200, "b_constraint": null, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dense_2", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "bias": true, "input_dim": null, "activation": "softmax", "init": "glorot_uniform", "output_dim": 3, "b_constraint": null, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}