{"config": [{"config": {"layers": [{"config": [{"config": {"input_dtype": "int32", "dropout": 0.2, "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "embedding_1_hul_model", "mask_zero": false, "input_dim": 1062158, "batch_input_shape": [null, 140], "input_length": 140}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "convolution1d_1_hul_model", "activation": "relu", "bias": true, "border_mode": "valid", "input_dim": null, "filter_length": 6, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_hul_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "convolution1d_2_hul_model", "activation": "relu", "bias": true, "border_mode": "valid", "input_dim": null, "filter_length": 6, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_2_hul_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_hul_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dtype": "int32", "dropout": 0.2, "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "embedding_1_tac_model", "mask_zero": false, "input_dim": 428669, "batch_input_shape": [null, 140], "input_length": 140}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "convolution1d_1_tac_model", "activation": "relu", "bias": true, "border_mode": "valid", "input_dim": null, "filter_length": 6, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_tac_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "convolution1d_2_tac_model", "activation": "relu", "bias": true, "border_mode": "valid", "input_dim": null, "filter_length": 6, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_2_tac_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_tac_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dtype": "int32", "dropout": 0.2, "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "embedding_1_semeval_model", "mask_zero": false, "input_dim": 428669, "batch_input_shape": [null, 140], "input_length": 140}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "convolution1d_1_semeval_model", "activation": "relu", "bias": true, "border_mode": "valid", "input_dim": null, "filter_length": 6, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "convolution1d_2_semeval_model", "activation": "relu", "bias": true, "border_mode": "valid", "input_dim": null, "filter_length": 6, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_2_semeval_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_semeval_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dtype": "int32", "dropout": 0.2, "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "embedding_1_dai_model", "mask_zero": false, "input_dim": 1576890, "batch_input_shape": [null, 140], "input_length": 140}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_dai_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "convolution1d_1_dai_model", "activation": "relu", "bias": true, "border_mode": "valid", "input_dim": null, "filter_length": 6, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_dai_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "convolution1d_2_dai_model", "activation": "relu", "bias": true, "border_mode": "valid", "input_dim": null, "filter_length": 6, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_2_dai_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_dai_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dtype": "int32", "dropout": 0.2, "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "embedding_1_dil_model", "mask_zero": false, "input_dim": 1576890, "batch_input_shape": [null, 140], "input_length": 140}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_dil_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "convolution1d_1_dil_model", "activation": "relu", "bias": true, "border_mode": "valid", "input_dim": null, "filter_length": 6, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_dil_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "convolution1d_2_dil_model", "activation": "relu", "bias": true, "border_mode": "valid", "input_dim": null, "filter_length": 6, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_2_dil_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_dil_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dtype": "int32", "dropout": 0.2, "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "embedding_17_mpq_model", "mask_zero": false, "input_dim": 428669, "batch_input_shape": [null, 140], "input_length": 140}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_17_mpq_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "convolution1d_33_mpq_model", "activation": "relu", "bias": true, "border_mode": "valid", "input_dim": null, "filter_length": 6, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "name": "convolution1d_34_mpq_model", "activation": "relu", "bias": true, "border_mode": "valid", "input_dim": null, "filter_length": 6, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_34_mpq_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_17_mpq_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}], "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape_type": "raw", "concat_axis": -1, "output_shape": null, "name": "merge_1"}, "class_name": "Merge"}, {"config": {"b_constraint": null, "output_dim": 1028, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "dense_1", "activation": "linear", "input_dim": null, "bias": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "output_dim": 3, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "dense_2", "activation": "softmax", "input_dim": null, "bias": true, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}