{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"init": "uniform", "input_length": 140, "W_regularizer": null, "batch_input_shape": [null, 140], "mask_zero": false, "dropout": 0.2, "name": "embedding_1", "input_dtype": "int32", "W_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": 1576890, "output_dim": 52}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1"}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "filter_length": 6, "init": "uniform", "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "nb_filter": 200, "input_dim": null, "name": "convolution1d_1", "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "trainable": true, "bias": true, "activity_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling1d_1", "stride": 2, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "filter_length": 6, "init": "uniform", "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "nb_filter": 200, "input_dim": null, "name": "convolution1d_2", "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "trainable": true, "bias": true, "activity_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling1d_2", "stride": 66, "pool_length": 66}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "name": "dense_1", "b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "output_dim": 200}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"activation": "softmax", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "name": "dense_2", "b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "output_dim": 3}}]}