{"config": [{"config": {"output_shape_type": "raw", "layers": [{"config": [{"config": {"init": "uniform", "dropout": 0.2, "W_regularizer": null, "trainable": true, "mask_zero": false, "batch_input_shape": [null, 140], "W_constraint": null, "input_dtype": "int32", "output_dim": 52, "activity_regularizer": null, "name": "embedding_1_dai_model", "input_length": 140, "input_dim": 1576890}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_dai_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "b_constraint": null, "subsample_length": 1, "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "name": "convolution1d_1_dai_model", "activation": "relu", "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_1_dai_model", "pool_length": 4, "border_mode": "valid", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "b_constraint": null, "subsample_length": 1, "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "name": "convolution1d_2_dai_model", "activation": "relu", "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_2_dai_model", "pool_length": 66, "border_mode": "valid", "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_dai_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "dropout": 0.2, "W_regularizer": null, "trainable": true, "mask_zero": false, "batch_input_shape": [null, 140], "W_constraint": null, "input_dtype": "int32", "output_dim": 52, "activity_regularizer": null, "name": "embedding_1_tac_model", "input_length": 140, "input_dim": 428669}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_tac_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "b_constraint": null, "subsample_length": 1, "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "name": "convolution1d_1_tac_model", "activation": "relu", "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_1_tac_model", "pool_length": 4, "border_mode": "valid", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "b_constraint": null, "subsample_length": 1, "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "name": "convolution1d_2_tac_model", "activation": "relu", "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_2_tac_model", "pool_length": 66, "border_mode": "valid", "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_tac_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "dropout": 0.2, "W_regularizer": null, "trainable": true, "mask_zero": false, "batch_input_shape": [null, 140], "W_constraint": null, "input_dtype": "int32", "output_dim": 52, "activity_regularizer": null, "name": "embedding_17_mpq_model", "input_length": 140, "input_dim": 428669}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_17_mpq_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "b_constraint": null, "subsample_length": 1, "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "name": "convolution1d_33_mpq_model", "activation": "relu", "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_33_mpq_model", "pool_length": 4, "border_mode": "valid", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "b_constraint": null, "subsample_length": 1, "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "name": "convolution1d_34_mpq_model", "activation": "relu", "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_34_mpq_model", "pool_length": 66, "border_mode": "valid", "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_17_mpq_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "dropout": 0.2, "W_regularizer": null, "trainable": true, "mask_zero": false, "batch_input_shape": [null, 140], "W_constraint": null, "input_dtype": "int32", "output_dim": 52, "activity_regularizer": null, "name": "embedding_1_hul_model", "input_length": 140, "input_dim": 1062158}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_hul_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "b_constraint": null, "subsample_length": 1, "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "name": "convolution1d_1_hul_model", "activation": "relu", "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_1_hul_model", "pool_length": 4, "border_mode": "valid", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "b_constraint": null, "subsample_length": 1, "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "name": "convolution1d_2_hul_model", "activation": "relu", "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_2_hul_model", "pool_length": 66, "border_mode": "valid", "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_hul_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "dropout": 0.2, "W_regularizer": null, "trainable": true, "mask_zero": false, "batch_input_shape": [null, 140], "W_constraint": null, "input_dtype": "int32", "output_dim": 52, "activity_regularizer": null, "name": "embedding_1_semeval_model", "input_length": 140, "input_dim": 428669}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_semeval_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "b_constraint": null, "subsample_length": 1, "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "name": "convolution1d_1_semeval_model", "activation": "relu", "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_1_semeval_model", "pool_length": 4, "border_mode": "valid", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "b_constraint": null, "subsample_length": 1, "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "name": "convolution1d_2_semeval_model", "activation": "relu", "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_2_semeval_model", "pool_length": 66, "border_mode": "valid", "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_semeval_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "dropout": 0.2, "W_regularizer": null, "trainable": true, "mask_zero": false, "batch_input_shape": [null, 140], "W_constraint": null, "input_dtype": "int32", "output_dim": 52, "activity_regularizer": null, "name": "embedding_1_dil_model", "input_length": 140, "input_dim": 1576890}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_dil_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "b_constraint": null, "subsample_length": 1, "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "name": "convolution1d_1_dil_model", "activation": "relu", "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_1_dil_model", "pool_length": 4, "border_mode": "valid", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"init": "uniform", "input_length": null, "filter_length": 6, "bias": true, "b_constraint": null, "subsample_length": 1, "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "name": "convolution1d_2_dil_model", "activation": "relu", "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "name": "maxpooling1d_2_dil_model", "pool_length": 66, "border_mode": "valid", "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_dil_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}], "mode_type": "raw", "concat_axis": -1, "name": "merge_1", "dot_axes": -1, "mode": "concat", "output_shape": null}, "class_name": "Merge"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "name": "dense_1", "input_dim": null, "activation": "linear", "output_dim": 1028}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "name": "dense_2", "input_dim": null, "activation": "softmax", "output_dim": 3}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}