{"keras_version": "1.1.0", "config": [{"config": {"input_dtype": "int32", "input_dim": 1576890, "activity_regularizer": null, "mask_zero": false, "name": "embedding_91", "W_constraint": null, "input_length": 140, "init": "uniform", "W_regularizer": null, "batch_input_shape": [null, 140], "dropout": 0.2, "output_dim": 52, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_91", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"trainable": true, "input_dim": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "nb_filter": 200, "name": "convolution1d_181", "filter_length": 6, "b_regularizer": null, "border_mode": "valid", "b_constraint": null, "input_length": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "uniform"}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_181", "stride": 2, "border_mode": "valid", "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "input_dim": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "nb_filter": 200, "name": "convolution1d_182", "filter_length": 6, "b_regularizer": null, "border_mode": "valid", "b_constraint": null, "input_length": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "uniform"}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_182", "stride": 66, "border_mode": "valid", "pool_length": 66, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_91", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "activity_regularizer": null, "bias": true, "name": "dense_181", "W_constraint": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "linear", "output_dim": 200, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_91", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_91", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": null, "activity_regularizer": null, "bias": true, "name": "dense_182", "W_constraint": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "softmax", "output_dim": 3, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}