{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"output_shape": null, "name": "merge_1", "output_shape_type": "raw", "mode_type": "raw", "dot_axes": -1, "mode": "concat", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "W_constraint": null, "name": "embedding_1_dai_model", "mask_zero": false, "input_dtype": "int32", "dropout": 0.2, "input_length": 140, "input_dim": 1576890, "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_dai_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"trainable": true, "activity_regularizer": null, "name": "convolution1d_1_dai_model", "W_constraint": null, "subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "b_constraint": null, "input_length": null, "input_dim": null, "W_regularizer": null, "filter_length": 6, "activation": "relu", "init": "uniform", "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_dai_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"trainable": true, "activity_regularizer": null, "name": "convolution1d_2_dai_model", "W_constraint": null, "subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "b_constraint": null, "input_length": null, "input_dim": null, "W_regularizer": null, "filter_length": 6, "activation": "relu", "init": "uniform", "border_mode": "valid", "bias": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "W_constraint": null, "name": "embedding_17_mpq_model", "mask_zero": false, "input_dtype": "int32", "dropout": 0.2, "input_length": 140, "input_dim": 428669, "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_17_mpq_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"trainable": true, "activity_regularizer": null, "name": "convolution1d_33_mpq_model", "W_constraint": null, "subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "b_constraint": null, "input_length": null, "input_dim": null, "W_regularizer": null, "filter_length": 6, "activation": "relu", "init": "uniform", "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"trainable": true, "activity_regularizer": null, "name": "convolution1d_34_mpq_model", "W_constraint": null, "subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "b_constraint": null, "input_length": null, "input_dim": null, "W_regularizer": null, "filter_length": 6, "activation": "relu", "init": "uniform", "border_mode": "valid", "bias": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "W_constraint": null, "name": "embedding_1_semeval_model", "mask_zero": false, "input_dtype": "int32", "dropout": 0.2, "input_length": 140, "input_dim": 1576890, "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_semeval_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"trainable": true, "activity_regularizer": null, "name": "convolution1d_1_semeval_model", "W_constraint": null, "subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "b_constraint": null, "input_length": null, "input_dim": null, "W_regularizer": null, "filter_length": 6, "activation": "relu", "init": "uniform", "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"trainable": true, "activity_regularizer": null, "name": "convolution1d_2_semeval_model", "W_constraint": null, "subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "b_constraint": null, "input_length": null, "input_dim": null, "W_regularizer": null, "filter_length": 6, "activation": "relu", "init": "uniform", "border_mode": "valid", "bias": true}}]}], "concat_axis": -1}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1", "stride": 2}}, {"class_name": "Convolution1D", "config": {"trainable": true, "activity_regularizer": null, "input_dim": null, "name": "convolution1d_1", "W_constraint": null, "subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "input_length": null, "b_constraint": null, "W_regularizer": null, "filter_length": 6, "activation": "relu", "init": "uniform", "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_2", "stride": 2}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "name": "dense_1", "W_constraint": null, "b_regularizer": null, "b_constraint": null, "input_dim": null, "output_dim": 200, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "name": "dense_2", "W_constraint": null, "b_regularizer": null, "b_constraint": null, "input_dim": null, "output_dim": 3, "W_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "bias": true}}]}