{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode": "concat", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_tac_model", "input_length": 140, "mask_zero": false, "output_dim": 52, "batch_input_shape": [null, 140], "W_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "init": "uniform", "input_dim": 428669, "input_dtype": "int32", "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_tac_model", "subsample_length": 1, "activity_regularizer": null, "filter_length": 6, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "input_dim": null, "activation": "relu", "border_mode": "valid", "bias": true, "input_length": null, "nb_filter": 200, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_tac_model", "trainable": true, "border_mode": "valid", "stride": 2, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_tac_model", "subsample_length": 1, "activity_regularizer": null, "filter_length": 6, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "input_dim": null, "activation": "relu", "border_mode": "valid", "bias": true, "input_length": null, "nb_filter": 200, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_tac_model", "trainable": true, "border_mode": "valid", "stride": 66, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_tac_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_17_mpq_model", "input_length": 140, "mask_zero": false, "output_dim": 52, "batch_input_shape": [null, 140], "W_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "init": "uniform", "input_dim": 428669, "input_dtype": "int32", "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_33_mpq_model", "subsample_length": 1, "activity_regularizer": null, "filter_length": 6, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "input_dim": null, "activation": "relu", "border_mode": "valid", "bias": true, "input_length": null, "nb_filter": 200, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_33_mpq_model", "trainable": true, "border_mode": "valid", "stride": 2, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_34_mpq_model", "subsample_length": 1, "activity_regularizer": null, "filter_length": 6, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "input_dim": null, "activation": "relu", "border_mode": "valid", "bias": true, "input_length": null, "nb_filter": 200, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_34_mpq_model", "trainable": true, "border_mode": "valid", "stride": 66, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_17_mpq_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_semeval_model", "input_length": 140, "mask_zero": false, "output_dim": 52, "batch_input_shape": [null, 140], "W_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "init": "uniform", "input_dim": 428669, "input_dtype": "int32", "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_semeval_model", "subsample_length": 1, "activity_regularizer": null, "filter_length": 6, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "input_dim": null, "activation": "relu", "border_mode": "valid", "bias": true, "input_length": null, "nb_filter": 200, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_semeval_model", "trainable": true, "border_mode": "valid", "stride": 2, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_semeval_model", "subsample_length": 1, "activity_regularizer": null, "filter_length": 6, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "input_dim": null, "activation": "relu", "border_mode": "valid", "bias": true, "input_length": null, "nb_filter": 200, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_semeval_model", "trainable": true, "border_mode": "valid", "stride": 66, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_semeval_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_dai_model", "input_length": 140, "mask_zero": false, "output_dim": 52, "batch_input_shape": [null, 140], "W_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "init": "uniform", "input_dim": 1576890, "input_dtype": "int32", "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_dai_model", "subsample_length": 1, "activity_regularizer": null, "filter_length": 6, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "input_dim": null, "activation": "relu", "border_mode": "valid", "bias": true, "input_length": null, "nb_filter": 200, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dai_model", "trainable": true, "border_mode": "valid", "stride": 2, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_dai_model", "subsample_length": 1, "activity_regularizer": null, "filter_length": 6, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "input_dim": null, "activation": "relu", "border_mode": "valid", "bias": true, "input_length": null, "nb_filter": 200, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dai_model", "trainable": true, "border_mode": "valid", "stride": 66, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dai_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_dil_model", "input_length": 140, "mask_zero": false, "output_dim": 52, "batch_input_shape": [null, 140], "W_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "init": "uniform", "input_dim": 1576890, "input_dtype": "int32", "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_dil_model", "subsample_length": 1, "activity_regularizer": null, "filter_length": 6, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "input_dim": null, "activation": "relu", "border_mode": "valid", "bias": true, "input_length": null, "nb_filter": 200, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dil_model", "trainable": true, "border_mode": "valid", "stride": 2, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_dil_model", "subsample_length": 1, "activity_regularizer": null, "filter_length": 6, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "input_dim": null, "activation": "relu", "border_mode": "valid", "bias": true, "input_length": null, "nb_filter": 200, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dil_model", "trainable": true, "border_mode": "valid", "stride": 66, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dil_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_hul_model", "input_length": 140, "mask_zero": false, "output_dim": 52, "batch_input_shape": [null, 140], "W_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "init": "uniform", "input_dim": 1062158, "input_dtype": "int32", "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_hul_model", "subsample_length": 1, "activity_regularizer": null, "filter_length": 6, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "input_dim": null, "activation": "relu", "border_mode": "valid", "bias": true, "input_length": null, "nb_filter": 200, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_hul_model", "trainable": true, "border_mode": "valid", "stride": 2, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_hul_model", "subsample_length": 1, "activity_regularizer": null, "filter_length": 6, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "input_dim": null, "activation": "relu", "border_mode": "valid", "bias": true, "input_length": null, "nb_filter": 200, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_hul_model", "trainable": true, "border_mode": "valid", "stride": 66, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_hul_model", "trainable": true}}]}], "output_shape_type": "raw", "output_shape": null, "dot_axes": -1, "mode_type": "raw"}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_constraint": null, "output_dim": 1028, "W_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "activation": "linear", "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_constraint": null, "output_dim": 3, "W_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "activation": "softmax", "bias": true}}], "keras_version": "1.1.1"}