{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"mode_type": "raw", "dot_axes": -1, "output_shape": null, "name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 1576890, "name": "embedding_1_dai_model", "W_constraint": null, "output_dim": 52, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "batch_input_shape": [null, 140], "input_dtype": "int32", "trainable": true, "input_length": 140, "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dai_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_dim": null, "name": "convolution1d_1_dai_model", "nb_filter": 200, "bias": true, "W_constraint": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "input_length": null, "b_regularizer": null, "trainable": true, "subsample_length": 1, "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_dai_model", "stride": 2, "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_dim": null, "name": "convolution1d_2_dai_model", "nb_filter": 200, "bias": true, "W_constraint": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "input_length": null, "b_regularizer": null, "trainable": true, "subsample_length": 1, "filter_length": 6}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 1062158, "name": "embedding_1_hul_model", "W_constraint": null, "output_dim": 52, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "batch_input_shape": [null, 140], "input_dtype": "int32", "trainable": true, "input_length": 140, "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_dim": null, "name": "convolution1d_1_hul_model", "nb_filter": 200, "bias": true, "W_constraint": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "input_length": null, "b_regularizer": null, "trainable": true, "subsample_length": 1, "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_hul_model", "stride": 2, "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_dim": null, "name": "convolution1d_2_hul_model", "nb_filter": 200, "bias": true, "W_constraint": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "input_length": null, "b_regularizer": null, "trainable": true, "subsample_length": 1, "filter_length": 6}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 1576890, "name": "embedding_1_semeval_model", "W_constraint": null, "output_dim": 52, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "batch_input_shape": [null, 140], "input_dtype": "int32", "trainable": true, "input_length": 140, "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_dim": null, "name": "convolution1d_1_semeval_model", "nb_filter": 200, "bias": true, "W_constraint": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "input_length": null, "b_regularizer": null, "trainable": true, "subsample_length": 1, "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "stride": 2, "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_dim": null, "name": "convolution1d_2_semeval_model", "nb_filter": 200, "bias": true, "W_constraint": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "input_length": null, "b_regularizer": null, "trainable": true, "subsample_length": 1, "filter_length": 6}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 428669, "name": "embedding_1_tac_model", "W_constraint": null, "output_dim": 52, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "batch_input_shape": [null, 140], "input_dtype": "int32", "trainable": true, "input_length": 140, "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_dim": null, "name": "convolution1d_1_tac_model", "nb_filter": 200, "bias": true, "W_constraint": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "input_length": null, "b_regularizer": null, "trainable": true, "subsample_length": 1, "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_tac_model", "stride": 2, "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_dim": null, "name": "convolution1d_2_tac_model", "nb_filter": 200, "bias": true, "W_constraint": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "input_length": null, "b_regularizer": null, "trainable": true, "subsample_length": 1, "filter_length": 6}}]}], "output_shape_type": "raw", "mode": "concat", "concat_axis": -1}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1", "stride": 2, "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_dim": null, "name": "convolution1d_1", "nb_filter": 200, "bias": true, "W_constraint": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "input_length": null, "b_regularizer": null, "trainable": true, "subsample_length": 1, "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_2", "stride": 2, "pool_length": 4, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "name": "dense_1", "bias": true, "W_constraint": null, "output_dim": 200, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "trainable": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "name": "dense_2", "bias": true, "W_constraint": null, "output_dim": 3, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "activation": "softmax", "W_regularizer": null, "trainable": true, "b_constraint": null}}]}