{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "W_constraint": null, "name": "embedding_1_tac_model", "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "input_dim": 428669, "W_regularizer": null, "input_length": 140, "activity_regularizer": null, "batch_input_shape": [null, 140], "output_dim": 52, "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_1_tac_model", "W_constraint": null, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "input_dim": null, "b_constraint": null, "filter_length": 6, "bias": true, "border_mode": "valid", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "name": "maxpooling1d_1_tac_model", "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_2_tac_model", "W_constraint": null, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "input_dim": null, "b_constraint": null, "filter_length": 6, "bias": true, "border_mode": "valid", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "pool_length": 66, "name": "maxpooling1d_2_tac_model", "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1_tac_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "W_constraint": null, "name": "embedding_1_semeval_model", "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "input_dim": 428669, "W_regularizer": null, "input_length": 140, "activity_regularizer": null, "batch_input_shape": [null, 140], "output_dim": 52, "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_1_semeval_model", "W_constraint": null, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "input_dim": null, "b_constraint": null, "filter_length": 6, "bias": true, "border_mode": "valid", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "name": "maxpooling1d_1_semeval_model", "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_2_semeval_model", "W_constraint": null, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "input_dim": null, "b_constraint": null, "filter_length": 6, "bias": true, "border_mode": "valid", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "pool_length": 66, "name": "maxpooling1d_2_semeval_model", "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1_semeval_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "W_constraint": null, "name": "embedding_1_hul_model", "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "input_dim": 1062158, "W_regularizer": null, "input_length": 140, "activity_regularizer": null, "batch_input_shape": [null, 140], "output_dim": 52, "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_1_hul_model", "W_constraint": null, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "input_dim": null, "b_constraint": null, "filter_length": 6, "bias": true, "border_mode": "valid", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "name": "maxpooling1d_1_hul_model", "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_2_hul_model", "W_constraint": null, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "input_dim": null, "b_constraint": null, "filter_length": 6, "bias": true, "border_mode": "valid", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "pool_length": 66, "name": "maxpooling1d_2_hul_model", "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1_hul_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "W_constraint": null, "name": "embedding_1_dai_model", "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "input_dim": 1576890, "W_regularizer": null, "input_length": 140, "activity_regularizer": null, "batch_input_shape": [null, 140], "output_dim": 52, "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dai_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_1_dai_model", "W_constraint": null, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "input_dim": null, "b_constraint": null, "filter_length": 6, "bias": true, "border_mode": "valid", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "name": "maxpooling1d_1_dai_model", "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_2_dai_model", "W_constraint": null, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "input_dim": null, "b_constraint": null, "filter_length": 6, "bias": true, "border_mode": "valid", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "pool_length": 66, "name": "maxpooling1d_2_dai_model", "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dai_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "W_constraint": null, "name": "embedding_1_dil_model", "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "input_dim": 1576890, "W_regularizer": null, "input_length": 140, "activity_regularizer": null, "batch_input_shape": [null, 140], "output_dim": 52, "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dil_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_1_dil_model", "W_constraint": null, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "input_dim": null, "b_constraint": null, "filter_length": 6, "bias": true, "border_mode": "valid", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "name": "maxpooling1d_1_dil_model", "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_2_dil_model", "W_constraint": null, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "input_dim": null, "b_constraint": null, "filter_length": 6, "bias": true, "border_mode": "valid", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "pool_length": 66, "name": "maxpooling1d_2_dil_model", "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dil_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "W_constraint": null, "name": "embedding_17_mpq_model", "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "input_dim": 428669, "W_regularizer": null, "input_length": 140, "activity_regularizer": null, "batch_input_shape": [null, 140], "output_dim": 52, "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_17_mpq_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_33_mpq_model", "W_constraint": null, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "input_dim": null, "b_constraint": null, "filter_length": 6, "bias": true, "border_mode": "valid", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "name": "maxpooling1d_33_mpq_model", "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_34_mpq_model", "W_constraint": null, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "input_dim": null, "b_constraint": null, "filter_length": 6, "bias": true, "border_mode": "valid", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "pool_length": 66, "name": "maxpooling1d_34_mpq_model", "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_17_mpq_model", "trainable": true}}]}], "output_shape_type": "raw", "concat_axis": -1, "mode": "concat", "dot_axes": -1, "output_shape": null, "name": "merge_1", "mode_type": "raw"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "name": "dense_1", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "activation": "linear", "output_dim": 1028, "b_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "name": "dense_2", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "activation": "softmax", "output_dim": 3, "b_constraint": null, "trainable": true}}]}