{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"mode": "concat", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_shape_type": "raw", "name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "input_length": 140, "activity_regularizer": null, "dropout": 0.2, "W_constraint": null, "input_dim": 1576890, "output_dim": 52, "mask_zero": false, "input_dtype": "int32", "trainable": true, "name": "embedding_1_dil_model", "W_regularizer": null, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_dil_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_length": null, "name": "convolution1d_1_dil_model", "subsample_length": 1, "trainable": true, "activation": "relu", "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_dil_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_length": null, "name": "convolution1d_2_dil_model", "subsample_length": 1, "trainable": true, "activation": "relu", "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 66, "border_mode": "valid", "name": "maxpooling1d_2_dil_model", "stride": 66}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_dil_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "input_length": 140, "activity_regularizer": null, "dropout": 0.2, "W_constraint": null, "input_dim": 428669, "output_dim": 52, "mask_zero": false, "input_dtype": "int32", "trainable": true, "name": "embedding_1_semeval_model", "W_regularizer": null, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_semeval_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_length": null, "name": "convolution1d_1_semeval_model", "subsample_length": 1, "trainable": true, "activation": "relu", "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_length": null, "name": "convolution1d_2_semeval_model", "subsample_length": 1, "trainable": true, "activation": "relu", "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 66, "border_mode": "valid", "name": "maxpooling1d_2_semeval_model", "stride": 66}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_semeval_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "input_length": 140, "activity_regularizer": null, "dropout": 0.2, "W_constraint": null, "input_dim": 1576890, "output_dim": 52, "mask_zero": false, "input_dtype": "int32", "trainable": true, "name": "embedding_1_dai_model", "W_regularizer": null, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_dai_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_length": null, "name": "convolution1d_1_dai_model", "subsample_length": 1, "trainable": true, "activation": "relu", "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_dai_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_length": null, "name": "convolution1d_2_dai_model", "subsample_length": 1, "trainable": true, "activation": "relu", "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 66, "border_mode": "valid", "name": "maxpooling1d_2_dai_model", "stride": 66}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_dai_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "input_length": 140, "activity_regularizer": null, "dropout": 0.2, "W_constraint": null, "input_dim": 1062158, "output_dim": 52, "mask_zero": false, "input_dtype": "int32", "trainable": true, "name": "embedding_1_hul_model", "W_regularizer": null, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_hul_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_length": null, "name": "convolution1d_1_hul_model", "subsample_length": 1, "trainable": true, "activation": "relu", "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_hul_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_length": null, "name": "convolution1d_2_hul_model", "subsample_length": 1, "trainable": true, "activation": "relu", "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 66, "border_mode": "valid", "name": "maxpooling1d_2_hul_model", "stride": 66}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_hul_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "input_length": 140, "activity_regularizer": null, "dropout": 0.2, "W_constraint": null, "input_dim": 428669, "output_dim": 52, "mask_zero": false, "input_dtype": "int32", "trainable": true, "name": "embedding_17_mpq_model", "W_regularizer": null, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_17_mpq_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_length": null, "name": "convolution1d_33_mpq_model", "subsample_length": 1, "trainable": true, "activation": "relu", "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_length": null, "name": "convolution1d_34_mpq_model", "subsample_length": 1, "trainable": true, "activation": "relu", "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 66, "border_mode": "valid", "name": "maxpooling1d_34_mpq_model", "stride": 66}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_17_mpq_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "input_length": 140, "activity_regularizer": null, "dropout": 0.2, "W_constraint": null, "input_dim": 428669, "output_dim": 52, "mask_zero": false, "input_dtype": "int32", "trainable": true, "name": "embedding_1_tac_model", "W_regularizer": null, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_tac_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_length": null, "name": "convolution1d_1_tac_model", "subsample_length": 1, "trainable": true, "activation": "relu", "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_tac_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_length": null, "name": "convolution1d_2_tac_model", "subsample_length": 1, "trainable": true, "activation": "relu", "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 66, "border_mode": "valid", "name": "maxpooling1d_2_tac_model", "stride": 66}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_tac_model"}}]}]}}, {"class_name": "Dense", "config": {"input_dim": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "name": "dense_1", "trainable": true, "activation": "linear", "bias": true, "output_dim": 1028, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "name": "dense_2", "trainable": true, "activation": "softmax", "bias": true, "output_dim": 3, "b_constraint": null, "init": "glorot_uniform"}}]}