{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "mode": "concat", "output_shape": null, "concat_axis": -1, "dot_axes": -1, "mode_type": "raw", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "name": "embedding_1_tac_model", "batch_input_shape": [null, 140], "W_constraint": null, "trainable": true, "mask_zero": false, "activity_regularizer": null, "input_length": 140, "W_regularizer": null, "input_dim": 428669, "init": "uniform", "dropout": 0.2, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "b_constraint": null, "name": "convolution1d_1_tac_model", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 200, "activation": "relu", "init": "uniform", "filter_length": 6, "input_length": null, "subsample_length": 1, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_tac_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "b_constraint": null, "name": "convolution1d_2_tac_model", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 200, "activation": "relu", "init": "uniform", "filter_length": 6, "input_length": null, "subsample_length": 1, "input_dim": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "name": "embedding_17_mpq_model", "batch_input_shape": [null, 140], "W_constraint": null, "trainable": true, "mask_zero": false, "activity_regularizer": null, "input_length": 140, "W_regularizer": null, "input_dim": 428669, "init": "uniform", "dropout": 0.2, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "b_constraint": null, "name": "convolution1d_33_mpq_model", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 200, "activation": "relu", "init": "uniform", "filter_length": 6, "input_length": null, "subsample_length": 1, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_33_mpq_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "b_constraint": null, "name": "convolution1d_34_mpq_model", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 200, "activation": "relu", "init": "uniform", "filter_length": 6, "input_length": null, "subsample_length": 1, "input_dim": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "name": "embedding_1_dai_model", "batch_input_shape": [null, 140], "W_constraint": null, "trainable": true, "mask_zero": false, "activity_regularizer": null, "input_length": 140, "W_regularizer": null, "input_dim": 1576890, "init": "uniform", "dropout": 0.2, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "b_constraint": null, "name": "convolution1d_1_dai_model", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 200, "activation": "relu", "init": "uniform", "filter_length": 6, "input_length": null, "subsample_length": 1, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_dai_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "b_constraint": null, "name": "convolution1d_2_dai_model", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 200, "activation": "relu", "init": "uniform", "filter_length": 6, "input_length": null, "subsample_length": 1, "input_dim": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "name": "embedding_1_dil_model", "batch_input_shape": [null, 140], "W_constraint": null, "trainable": true, "mask_zero": false, "activity_regularizer": null, "input_length": 140, "W_regularizer": null, "input_dim": 1576890, "init": "uniform", "dropout": 0.2, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "b_constraint": null, "name": "convolution1d_1_dil_model", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 200, "activation": "relu", "init": "uniform", "filter_length": 6, "input_length": null, "subsample_length": 1, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_dil_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "b_constraint": null, "name": "convolution1d_2_dil_model", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 200, "activation": "relu", "init": "uniform", "filter_length": 6, "input_length": null, "subsample_length": 1, "input_dim": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "name": "embedding_1_hul_model", "batch_input_shape": [null, 140], "W_constraint": null, "trainable": true, "mask_zero": false, "activity_regularizer": null, "input_length": 140, "W_regularizer": null, "input_dim": 1062158, "init": "uniform", "dropout": 0.2, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "b_constraint": null, "name": "convolution1d_1_hul_model", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 200, "activation": "relu", "init": "uniform", "filter_length": 6, "input_length": null, "subsample_length": 1, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_hul_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "b_constraint": null, "name": "convolution1d_2_hul_model", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 200, "activation": "relu", "init": "uniform", "filter_length": 6, "input_length": null, "subsample_length": 1, "input_dim": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "name": "embedding_1_semeval_model", "batch_input_shape": [null, 140], "W_constraint": null, "trainable": true, "mask_zero": false, "activity_regularizer": null, "input_length": 140, "W_regularizer": null, "input_dim": 428669, "init": "uniform", "dropout": 0.2, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "b_constraint": null, "name": "convolution1d_1_semeval_model", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 200, "activation": "relu", "init": "uniform", "filter_length": 6, "input_length": null, "subsample_length": 1, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_semeval_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "b_constraint": null, "name": "convolution1d_2_semeval_model", "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 200, "activation": "relu", "init": "uniform", "filter_length": 6, "input_length": null, "subsample_length": 1, "input_dim": null}}]}], "output_shape_type": "raw"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 200, "b_constraint": null, "W_constraint": null, "trainable": true, "input_dim": null, "activity_regularizer": null, "name": "dense_1", "bias": true, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 3, "b_constraint": null, "W_constraint": null, "trainable": true, "input_dim": null, "activity_regularizer": null, "name": "dense_2", "bias": true, "W_regularizer": null, "b_regularizer": null, "activation": "softmax", "init": "glorot_uniform"}}], "keras_version": "1.1.1"}