{"keras_version": "1.1.1", "config": [{"config": {"mask_zero": false, "output_dim": 52, "input_dim": 428669, "init": "uniform", "input_length": 140, "input_dtype": "int32", "dropout": 0.2, "batch_input_shape": [null, 140], "activity_regularizer": null, "name": "embedding_13", "W_regularizer": null, "W_constraint": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"padding": 5, "trainable": true, "name": "zeropadding1d_13"}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "bias": true, "init": "uniform", "input_dim": null, "b_regularizer": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "name": "convolution1d_25", "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "W_constraint": null, "trainable": true, "border_mode": "valid", "input_length": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "stride": 2, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_25"}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "bias": true, "init": "uniform", "input_dim": null, "b_regularizer": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "name": "convolution1d_26", "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "W_constraint": null, "trainable": true, "border_mode": "valid", "input_length": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 66, "stride": 66, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_26"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_13"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "b_regularizer": null, "output_dim": 200, "name": "dense_25", "b_constraint": null, "W_regularizer": null, "W_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_13"}, "class_name": "Dropout"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "class_name": "Activation"}, {"config": {"activation": "softmax", "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "b_regularizer": null, "output_dim": 3, "name": "dense_26", "b_constraint": null, "W_regularizer": null, "W_constraint": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}