{"config": [{"config": {"mode": "concat", "name": "merge_8", "dot_axes": -1, "output_shape": null, "concat_axis": -1, "output_shape_type": "raw", "layers": [{"config": [{"config": {"trainable": true, "output_dim": 52, "input_dim": 1576890, "batch_input_shape": [null, 140], "mask_zero": false, "name": "embedding_1_dai_model", "activity_regularizer": null, "dropout": 0.2, "W_constraint": null, "input_length": 140, "init": "uniform", "input_dtype": "int32", "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_dai_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"trainable": true, "border_mode": "valid", "bias": true, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "filter_length": 6, "input_length": null, "name": "convolution1d_1_dai_model", "subsample_length": 1, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "activation": "relu", "init": "uniform", "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "pool_length": 4, "name": "maxpooling1d_1_dai_model", "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "border_mode": "valid", "bias": true, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "filter_length": 6, "input_length": null, "name": "convolution1d_2_dai_model", "subsample_length": 1, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "activation": "relu", "init": "uniform", "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "pool_length": 66, "name": "maxpooling1d_2_dai_model", "stride": 66, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_dai_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"trainable": true, "output_dim": 52, "input_dim": 428669, "batch_input_shape": [null, 140], "mask_zero": false, "name": "embedding_1_semeval_model", "activity_regularizer": null, "dropout": 0.2, "W_constraint": null, "input_length": 140, "init": "uniform", "input_dtype": "int32", "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_semeval_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"trainable": true, "border_mode": "valid", "bias": true, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "filter_length": 6, "input_length": null, "name": "convolution1d_1_semeval_model", "subsample_length": 1, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "activation": "relu", "init": "uniform", "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "pool_length": 4, "name": "maxpooling1d_1_semeval_model", "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "border_mode": "valid", "bias": true, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "filter_length": 6, "input_length": null, "name": "convolution1d_2_semeval_model", "subsample_length": 1, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "activation": "relu", "init": "uniform", "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "pool_length": 66, "name": "maxpooling1d_2_semeval_model", "stride": 66, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_semeval_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"trainable": true, "output_dim": 52, "input_dim": 428669, "batch_input_shape": [null, 140], "mask_zero": false, "name": "embedding_17_mpq_model", "activity_regularizer": null, "dropout": 0.2, "W_constraint": null, "input_length": 140, "init": "uniform", "input_dtype": "int32", "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_17_mpq_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"trainable": true, "border_mode": "valid", "bias": true, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "filter_length": 6, "input_length": null, "name": "convolution1d_33_mpq_model", "subsample_length": 1, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "activation": "relu", "init": "uniform", "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "pool_length": 4, "name": "maxpooling1d_33_mpq_model", "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "border_mode": "valid", "bias": true, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "filter_length": 6, "input_length": null, "name": "convolution1d_34_mpq_model", "subsample_length": 1, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "activation": "relu", "init": "uniform", "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "pool_length": 66, "name": "maxpooling1d_34_mpq_model", "stride": 66, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_17_mpq_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}], "mode_type": "raw"}, "class_name": "Merge"}, {"config": {"trainable": true, "output_dim": 1028, "activation": "linear", "b_regularizer": null, "bias": true, "name": "dense_15", "W_regularizer": null, "b_constraint": null, "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "output_dim": 3, "activation": "softmax", "b_regularizer": null, "bias": true, "name": "dense_16", "W_regularizer": null, "b_constraint": null, "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}