{"config": [{"config": {"output_shape": null, "dot_axes": -1, "mode_type": "raw", "layers": [{"config": [{"config": {"input_dtype": "int32", "dropout": 0.2, "mask_zero": false, "input_length": 140, "activity_regularizer": null, "output_dim": 52, "input_dim": 428669, "trainable": true, "init": "uniform", "W_constraint": null, "W_regularizer": null, "name": "embedding_1_semeval_model", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_semeval_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"border_mode": "valid", "init": "uniform", "bias": true, "input_length": null, "activity_regularizer": null, "filter_length": 6, "input_dim": null, "trainable": true, "b_constraint": null, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "nb_filter": 200, "W_regularizer": null, "name": "convolution1d_1_semeval_model", "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "stride": 2, "pool_length": 4, "name": "maxpooling1d_1_semeval_model", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"border_mode": "valid", "init": "uniform", "bias": true, "input_length": null, "activity_regularizer": null, "filter_length": 6, "input_dim": null, "trainable": true, "b_constraint": null, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "nb_filter": 200, "W_regularizer": null, "name": "convolution1d_2_semeval_model", "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "stride": 66, "pool_length": 66, "name": "maxpooling1d_2_semeval_model", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_semeval_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dtype": "int32", "dropout": 0.2, "mask_zero": false, "input_length": 140, "activity_regularizer": null, "output_dim": 52, "input_dim": 428669, "trainable": true, "init": "uniform", "W_constraint": null, "W_regularizer": null, "name": "embedding_17_mpq_model", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_17_mpq_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"border_mode": "valid", "init": "uniform", "bias": true, "input_length": null, "activity_regularizer": null, "filter_length": 6, "input_dim": null, "trainable": true, "b_constraint": null, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "nb_filter": 200, "W_regularizer": null, "name": "convolution1d_33_mpq_model", "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "stride": 2, "pool_length": 4, "name": "maxpooling1d_33_mpq_model", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"border_mode": "valid", "init": "uniform", "bias": true, "input_length": null, "activity_regularizer": null, "filter_length": 6, "input_dim": null, "trainable": true, "b_constraint": null, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "nb_filter": 200, "W_regularizer": null, "name": "convolution1d_34_mpq_model", "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "stride": 66, "pool_length": 66, "name": "maxpooling1d_34_mpq_model", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_17_mpq_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dtype": "int32", "dropout": 0.2, "mask_zero": false, "input_length": 140, "activity_regularizer": null, "output_dim": 52, "input_dim": 1062158, "trainable": true, "init": "uniform", "W_constraint": null, "W_regularizer": null, "name": "embedding_1_hul_model", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_hul_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"border_mode": "valid", "init": "uniform", "bias": true, "input_length": null, "activity_regularizer": null, "filter_length": 6, "input_dim": null, "trainable": true, "b_constraint": null, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "nb_filter": 200, "W_regularizer": null, "name": "convolution1d_1_hul_model", "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "stride": 2, "pool_length": 4, "name": "maxpooling1d_1_hul_model", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"border_mode": "valid", "init": "uniform", "bias": true, "input_length": null, "activity_regularizer": null, "filter_length": 6, "input_dim": null, "trainable": true, "b_constraint": null, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "nb_filter": 200, "W_regularizer": null, "name": "convolution1d_2_hul_model", "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "stride": 66, "pool_length": 66, "name": "maxpooling1d_2_hul_model", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_hul_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}], "mode": "concat", "name": "merge_17", "concat_axis": -1, "output_shape_type": "raw"}, "class_name": "Merge"}, {"config": {"bias": true, "activity_regularizer": null, "output_dim": 1028, "name": "dense_33", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_17", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "activity_regularizer": null, "output_dim": 3, "name": "dense_34", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "softmax", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}