{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"mode": "concat", "concat_axis": -1, "dot_axes": -1, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "activity_regularizer": null, "input_dtype": "int32", "W_constraint": null, "trainable": true, "input_length": 140, "batch_input_shape": [null, 140], "input_dim": 1062158, "W_regularizer": null, "name": "embedding_1_hul_model", "dropout": 0.2, "mask_zero": false, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_hul_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "input_length": null, "name": "convolution1d_1_hul_model", "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_hul_model", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "input_length": null, "name": "convolution1d_2_hul_model", "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_2_hul_model", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_hul_model"}}, {"class_name": "Dense", "config": {"output_dim": 200, "W_constraint": null, "activation": "linear", "trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_1_hul_model", "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1_hul_model", "p": 0.2}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1_hul_model"}}, {"class_name": "Dense", "config": {"output_dim": 3, "W_constraint": null, "activation": "softmax", "trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_2_hul_model", "activity_regularizer": null, "init": "glorot_uniform"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "activity_regularizer": null, "input_dtype": "int32", "W_constraint": null, "trainable": true, "input_length": 140, "batch_input_shape": [null, 140], "input_dim": 428669, "W_regularizer": null, "name": "embedding_1_semeval_model", "dropout": 0.2, "mask_zero": false, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "input_length": null, "name": "convolution1d_1_semeval_model", "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_semeval_model", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "input_length": null, "name": "convolution1d_2_semeval_model", "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_2_semeval_model", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_semeval_model"}}, {"class_name": "Dense", "config": {"output_dim": 200, "W_constraint": null, "activation": "linear", "trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_1_semeval_model", "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1_semeval_model", "p": 0.2}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1_semeval_model"}}, {"class_name": "Dense", "config": {"output_dim": 3, "W_constraint": null, "activation": "softmax", "trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_2_semeval_model", "activity_regularizer": null, "init": "glorot_uniform"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "activity_regularizer": null, "input_dtype": "int32", "W_constraint": null, "trainable": true, "input_length": 140, "batch_input_shape": [null, 140], "input_dim": 428669, "W_regularizer": null, "name": "embedding_17_mpq_model", "dropout": 0.2, "mask_zero": false, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_17_mpq_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "input_length": null, "name": "convolution1d_33_mpq_model", "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_33_mpq_model", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "input_length": null, "name": "convolution1d_34_mpq_model", "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_34_mpq_model", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_17_mpq_model"}}, {"class_name": "Dense", "config": {"output_dim": 200, "W_constraint": null, "activation": "linear", "trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_33_mpq_model", "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_17_mpq_model", "p": 0.2}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_17_mpq_model"}}, {"class_name": "Dense", "config": {"output_dim": 3, "W_constraint": null, "activation": "softmax", "trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_34_mpq_model", "activity_regularizer": null, "init": "glorot_uniform"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "activity_regularizer": null, "input_dtype": "int32", "W_constraint": null, "trainable": true, "input_length": 140, "batch_input_shape": [null, 140], "input_dim": 1576890, "W_regularizer": null, "name": "embedding_1_dai_model", "dropout": 0.2, "mask_zero": false, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_dai_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "input_length": null, "name": "convolution1d_1_dai_model", "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_dai_model", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "input_length": null, "name": "convolution1d_2_dai_model", "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_2_dai_model", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_dai_model"}}, {"class_name": "Dense", "config": {"output_dim": 200, "W_constraint": null, "activation": "linear", "trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_1_dai_model", "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1_dai_model", "p": 0.2}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1_dai_model"}}, {"class_name": "Dense", "config": {"output_dim": 3, "W_constraint": null, "activation": "softmax", "trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_2_dai_model", "activity_regularizer": null, "init": "glorot_uniform"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "activity_regularizer": null, "input_dtype": "int32", "W_constraint": null, "trainable": true, "input_length": 140, "batch_input_shape": [null, 140], "input_dim": 428669, "W_regularizer": null, "name": "embedding_1_tac_model", "dropout": 0.2, "mask_zero": false, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_tac_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "input_length": null, "name": "convolution1d_1_tac_model", "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_tac_model", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "input_length": null, "name": "convolution1d_2_tac_model", "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_2_tac_model", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_tac_model"}}, {"class_name": "Dense", "config": {"output_dim": 200, "W_constraint": null, "activation": "linear", "trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_1_tac_model", "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1_tac_model", "p": 0.2}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1_tac_model"}}, {"class_name": "Dense", "config": {"output_dim": 3, "W_constraint": null, "activation": "softmax", "trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_2_tac_model", "activity_regularizer": null, "init": "glorot_uniform"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "activity_regularizer": null, "input_dtype": "int32", "W_constraint": null, "trainable": true, "input_length": 140, "batch_input_shape": [null, 140], "input_dim": 1576890, "W_regularizer": null, "name": "embedding_1_dil_model", "dropout": 0.2, "mask_zero": false, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_dil_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "input_length": null, "name": "convolution1d_1_dil_model", "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_dil_model", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "activation": "relu", "filter_length": 6, "trainable": true, "border_mode": "valid", "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "input_length": null, "name": "convolution1d_2_dil_model", "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_2_dil_model", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_dil_model"}}, {"class_name": "Dense", "config": {"output_dim": 200, "W_constraint": null, "activation": "linear", "trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_1_dil_model", "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1_dil_model", "p": 0.2}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1_dil_model"}}, {"class_name": "Dense", "config": {"output_dim": 3, "W_constraint": null, "activation": "softmax", "trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_2_dil_model", "activity_regularizer": null, "init": "glorot_uniform"}}]}], "mode_type": "raw", "output_shape": null, "name": "merge_1", "output_shape_type": "raw"}}, {"class_name": "Dense", "config": {"output_dim": 256, "W_constraint": null, "activation": "linear", "trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_1", "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"output_dim": 3, "W_constraint": null, "activation": "softmax", "trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "bias": true, "name": "dense_2", "activity_regularizer": null, "init": "glorot_uniform"}}], "keras_version": "1.1.1"}