{"keras_version": "1.1.1", "config": [{"config": {"layers": [{"config": [{"config": {"activity_regularizer": null, "W_regularizer": null, "dropout": 0.2, "batch_input_shape": [null, 140], "input_dtype": "int32", "trainable": true, "mask_zero": false, "input_dim": 1576890, "output_dim": 52, "init": "uniform", "input_length": 140, "W_constraint": null, "name": "embedding_1_dai_model"}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_dai_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": null, "border_mode": "valid", "subsample_length": 1, "nb_filter": 200, "init": "uniform", "input_length": null, "activation": "relu", "W_constraint": null, "name": "convolution1d_1_dai_model", "bias": true}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_dai_model"}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": null, "border_mode": "valid", "subsample_length": 1, "nb_filter": 200, "init": "uniform", "input_length": null, "activation": "relu", "W_constraint": null, "name": "convolution1d_2_dai_model", "bias": true}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"activity_regularizer": null, "W_regularizer": null, "dropout": 0.2, "batch_input_shape": [null, 140], "input_dtype": "int32", "trainable": true, "mask_zero": false, "input_dim": 1576890, "output_dim": 52, "init": "uniform", "input_length": 140, "W_constraint": null, "name": "embedding_1_dil_model"}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_dil_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": null, "border_mode": "valid", "subsample_length": 1, "nb_filter": 200, "init": "uniform", "input_length": null, "activation": "relu", "W_constraint": null, "name": "convolution1d_1_dil_model", "bias": true}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_dil_model"}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": null, "border_mode": "valid", "subsample_length": 1, "nb_filter": 200, "init": "uniform", "input_length": null, "activation": "relu", "W_constraint": null, "name": "convolution1d_2_dil_model", "bias": true}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"activity_regularizer": null, "W_regularizer": null, "dropout": 0.2, "batch_input_shape": [null, 140], "input_dtype": "int32", "trainable": true, "mask_zero": false, "input_dim": 1062158, "output_dim": 52, "init": "uniform", "input_length": 140, "W_constraint": null, "name": "embedding_1_hul_model"}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_hul_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": null, "border_mode": "valid", "subsample_length": 1, "nb_filter": 200, "init": "uniform", "input_length": null, "activation": "relu", "W_constraint": null, "name": "convolution1d_1_hul_model", "bias": true}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_hul_model"}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": null, "border_mode": "valid", "subsample_length": 1, "nb_filter": 200, "init": "uniform", "input_length": null, "activation": "relu", "W_constraint": null, "name": "convolution1d_2_hul_model", "bias": true}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"activity_regularizer": null, "W_regularizer": null, "dropout": 0.2, "batch_input_shape": [null, 140], "input_dtype": "int32", "trainable": true, "mask_zero": false, "input_dim": 428669, "output_dim": 52, "init": "uniform", "input_length": 140, "W_constraint": null, "name": "embedding_17_mpq_model"}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_17_mpq_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": null, "border_mode": "valid", "subsample_length": 1, "nb_filter": 200, "init": "uniform", "input_length": null, "activation": "relu", "W_constraint": null, "name": "convolution1d_33_mpq_model", "bias": true}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_33_mpq_model"}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": null, "border_mode": "valid", "subsample_length": 1, "nb_filter": 200, "init": "uniform", "input_length": null, "activation": "relu", "W_constraint": null, "name": "convolution1d_34_mpq_model", "bias": true}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"activity_regularizer": null, "W_regularizer": null, "dropout": 0.2, "batch_input_shape": [null, 140], "input_dtype": "int32", "trainable": true, "mask_zero": false, "input_dim": 428669, "output_dim": 52, "init": "uniform", "input_length": 140, "W_constraint": null, "name": "embedding_1_semeval_model"}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_semeval_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": null, "border_mode": "valid", "subsample_length": 1, "nb_filter": 200, "init": "uniform", "input_length": null, "activation": "relu", "W_constraint": null, "name": "convolution1d_1_semeval_model", "bias": true}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model"}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": null, "border_mode": "valid", "subsample_length": 1, "nb_filter": 200, "init": "uniform", "input_length": null, "activation": "relu", "W_constraint": null, "name": "convolution1d_2_semeval_model", "bias": true}, "class_name": "Convolution1D"}], "class_name": "Sequential"}], "mode_type": "raw", "output_shape_type": "raw", "output_shape": null, "mode": "concat", "name": "merge_1", "concat_axis": -1, "dot_axes": -1}, "class_name": "Merge"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": null, "output_dim": 200, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "name": "dense_1", "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": null, "output_dim": 3, "init": "glorot_uniform", "activation": "softmax", "W_constraint": null, "name": "dense_2", "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}