{"keras_version": "1.1.1", "config": [{"config": {"dot_axes": -1, "output_shape_type": "raw", "mode_type": "raw", "concat_axis": -1, "output_shape": null, "layers": [{"config": [{"config": {"batch_input_shape": [null, 140], "output_dim": 52, "W_regularizer": null, "input_dim": 428669, "input_dtype": "int32", "mask_zero": false, "activity_regularizer": null, "trainable": true, "dropout": 0.2, "W_constraint": null, "input_length": 140, "init": "uniform", "name": "embedding_17_mpq_model"}, "class_name": "Embedding"}, {"config": {"padding": 5, "trainable": true, "name": "zeropadding1d_17_mpq_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "input_dim": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "W_constraint": null, "input_length": null, "trainable": true, "name": "convolution1d_33_mpq_model"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_33_mpq_model"}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "input_dim": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "W_constraint": null, "input_length": null, "trainable": true, "name": "convolution1d_34_mpq_model"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "output_dim": 52, "W_regularizer": null, "input_dim": 428669, "input_dtype": "int32", "mask_zero": false, "activity_regularizer": null, "trainable": true, "dropout": 0.2, "W_constraint": null, "input_length": 140, "init": "uniform", "name": "embedding_1_tac_model"}, "class_name": "Embedding"}, {"config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_tac_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "input_dim": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "W_constraint": null, "input_length": null, "trainable": true, "name": "convolution1d_1_tac_model"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_1_tac_model"}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "input_dim": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "W_constraint": null, "input_length": null, "trainable": true, "name": "convolution1d_2_tac_model"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "output_dim": 52, "W_regularizer": null, "input_dim": 1576890, "input_dtype": "int32", "mask_zero": false, "activity_regularizer": null, "trainable": true, "dropout": 0.2, "W_constraint": null, "input_length": 140, "init": "uniform", "name": "embedding_1_dil_model"}, "class_name": "Embedding"}, {"config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_dil_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "input_dim": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "W_constraint": null, "input_length": null, "trainable": true, "name": "convolution1d_1_dil_model"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_1_dil_model"}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "input_dim": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "W_constraint": null, "input_length": null, "trainable": true, "name": "convolution1d_2_dil_model"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "output_dim": 52, "W_regularizer": null, "input_dim": 428669, "input_dtype": "int32", "mask_zero": false, "activity_regularizer": null, "trainable": true, "dropout": 0.2, "W_constraint": null, "input_length": 140, "init": "uniform", "name": "embedding_1_semeval_model"}, "class_name": "Embedding"}, {"config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_semeval_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "input_dim": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "W_constraint": null, "input_length": null, "trainable": true, "name": "convolution1d_1_semeval_model"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_1_semeval_model"}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "input_dim": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "W_constraint": null, "input_length": null, "trainable": true, "name": "convolution1d_2_semeval_model"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "output_dim": 52, "W_regularizer": null, "input_dim": 1062158, "input_dtype": "int32", "mask_zero": false, "activity_regularizer": null, "trainable": true, "dropout": 0.2, "W_constraint": null, "input_length": 140, "init": "uniform", "name": "embedding_1_hul_model"}, "class_name": "Embedding"}, {"config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_hul_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "input_dim": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "W_constraint": null, "input_length": null, "trainable": true, "name": "convolution1d_1_hul_model"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_1_hul_model"}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "input_dim": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "W_constraint": null, "input_length": null, "trainable": true, "name": "convolution1d_2_hul_model"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "output_dim": 52, "W_regularizer": null, "input_dim": 1576890, "input_dtype": "int32", "mask_zero": false, "activity_regularizer": null, "trainable": true, "dropout": 0.2, "W_constraint": null, "input_length": 140, "init": "uniform", "name": "embedding_1_dai_model"}, "class_name": "Embedding"}, {"config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_dai_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "input_dim": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "W_constraint": null, "input_length": null, "trainable": true, "name": "convolution1d_1_dai_model"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_1_dai_model"}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "input_dim": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "W_constraint": null, "input_length": null, "trainable": true, "name": "convolution1d_2_dai_model"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}], "mode": "concat", "name": "merge_1"}, "class_name": "Merge"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "b_constraint": null, "output_dim": 200, "W_regularizer": null, "bias": true, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "W_constraint": null, "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"activation": "softmax", "b_constraint": null, "output_dim": 3, "W_regularizer": null, "bias": true, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "W_constraint": null, "trainable": true, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}