{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "input_dtype": "int32", "W_regularizer": null, "output_dim": 52, "input_dim": 1576890, "batch_input_shape": [null, 140], "dropout": 0.2, "W_constraint": null, "mask_zero": false, "input_length": 140, "trainable": true, "init": "uniform", "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activation": "relu", "border_mode": "valid", "input_dim": null, "input_length": null, "filter_length": 6, "nb_filter": 200, "W_constraint": null, "subsample_length": 1, "bias": true, "trainable": true, "init": "uniform", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1", "pool_length": 4, "border_mode": "valid", "stride": 2, "trainable": true}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activation": "relu", "border_mode": "valid", "input_dim": null, "input_length": null, "filter_length": 6, "nb_filter": 200, "W_constraint": null, "subsample_length": 1, "bias": true, "trainable": true, "init": "uniform", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2", "pool_length": 66, "border_mode": "valid", "stride": 66, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "output_dim": 200, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_dim": null, "b_constraint": null, "W_constraint": null, "bias": true, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "output_dim": 3, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "input_dim": null, "b_constraint": null, "W_constraint": null, "bias": true, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null}}]}