{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"concat_axis": -1, "mode_type": "raw", "output_shape": null, "mode": "concat", "name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "activity_regularizer": null, "input_dtype": "int32", "batch_input_shape": [null, 140], "W_constraint": null, "input_length": 140, "input_dim": 1576890, "W_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "name": "embedding_1_dai_model", "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_constraint": null, "filter_length": 6, "input_dim": null, "input_length": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activation": "relu", "trainable": true, "name": "convolution1d_1_dai_model", "init": "uniform", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dai_model", "stride": 2, "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_constraint": null, "filter_length": 6, "input_dim": null, "input_length": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activation": "relu", "trainable": true, "name": "convolution1d_2_dai_model", "init": "uniform", "bias": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "activity_regularizer": null, "input_dtype": "int32", "batch_input_shape": [null, 140], "W_constraint": null, "input_length": 140, "input_dim": 1062158, "W_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "name": "embedding_1_hul_model", "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_constraint": null, "filter_length": 6, "input_dim": null, "input_length": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activation": "relu", "trainable": true, "name": "convolution1d_1_hul_model", "init": "uniform", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_hul_model", "stride": 2, "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_constraint": null, "filter_length": 6, "input_dim": null, "input_length": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activation": "relu", "trainable": true, "name": "convolution1d_2_hul_model", "init": "uniform", "bias": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "activity_regularizer": null, "input_dtype": "int32", "batch_input_shape": [null, 140], "W_constraint": null, "input_length": 140, "input_dim": 428669, "W_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "name": "embedding_17_mpq_model", "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_constraint": null, "filter_length": 6, "input_dim": null, "input_length": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activation": "relu", "trainable": true, "name": "convolution1d_33_mpq_model", "init": "uniform", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_33_mpq_model", "stride": 2, "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_constraint": null, "filter_length": 6, "input_dim": null, "input_length": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activation": "relu", "trainable": true, "name": "convolution1d_34_mpq_model", "init": "uniform", "bias": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "activity_regularizer": null, "input_dtype": "int32", "batch_input_shape": [null, 140], "W_constraint": null, "input_length": 140, "input_dim": 428669, "W_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "name": "embedding_1_semeval_model", "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_constraint": null, "filter_length": 6, "input_dim": null, "input_length": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activation": "relu", "trainable": true, "name": "convolution1d_1_semeval_model", "init": "uniform", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_semeval_model", "stride": 2, "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_constraint": null, "filter_length": 6, "input_dim": null, "input_length": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activation": "relu", "trainable": true, "name": "convolution1d_2_semeval_model", "init": "uniform", "bias": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "activity_regularizer": null, "input_dtype": "int32", "batch_input_shape": [null, 140], "W_constraint": null, "input_length": 140, "input_dim": 428669, "W_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "name": "embedding_1_tac_model", "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_constraint": null, "filter_length": 6, "input_dim": null, "input_length": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activation": "relu", "trainable": true, "name": "convolution1d_1_tac_model", "init": "uniform", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_tac_model", "stride": 2, "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_constraint": null, "filter_length": 6, "input_dim": null, "input_length": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activation": "relu", "trainable": true, "name": "convolution1d_2_tac_model", "init": "uniform", "bias": true}}]}], "output_shape_type": "raw", "dot_axes": -1}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "trainable": true, "name": "dense_1", "output_dim": 200, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "activation": "softmax", "trainable": true, "name": "dense_2", "output_dim": 3, "bias": true}}]}