{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "input_dim": 1576890, "batch_input_shape": [null, 140], "input_length": 140, "dropout": 0.2, "input_dtype": "int32", "output_dim": 52, "trainable": true, "W_constraint": null, "activity_regularizer": null, "name": "embedding_36", "init": "uniform", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_36", "padding": 5}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "b_constraint": null, "input_dim": null, "nb_filter": 200, "input_length": null, "subsample_length": 1, "bias": true, "init": "uniform", "filter_length": 6, "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "name": "convolution1d_71", "trainable": true, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "maxpooling1d_71", "pool_length": 4, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "b_constraint": null, "input_dim": null, "nb_filter": 200, "input_length": null, "subsample_length": 1, "bias": true, "init": "uniform", "filter_length": 6, "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "name": "convolution1d_72", "trainable": true, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "maxpooling1d_72", "pool_length": 66, "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_36"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": null, "output_dim": 200, "bias": true, "b_constraint": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "dense_71", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_36", "p": 0.2}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_36"}}, {"class_name": "Dense", "config": {"activation": "softmax", "input_dim": null, "output_dim": 3, "bias": true, "b_constraint": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "dense_72", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null}}]}