{"keras_version": "1.1.0", "config": [{"config": {"trainable": true, "output_dim": 52, "input_dim": 1576890, "W_constraint": null, "name": "embedding_11", "mask_zero": false, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140], "input_length": 140, "dropout": 0.2, "input_dtype": "int32"}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_11", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"b_constraint": null, "nb_filter": 200, "W_constraint": null, "input_dim": null, "name": "convolution1d_21", "filter_length": 6, "activity_regularizer": null, "bias": true, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "trainable": true, "activation": "relu", "input_length": null, "border_mode": "valid", "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_21", "trainable": true, "border_mode": "valid", "stride": 2, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"b_constraint": null, "nb_filter": 200, "W_constraint": null, "input_dim": null, "name": "convolution1d_22", "filter_length": 6, "activity_regularizer": null, "bias": true, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "trainable": true, "activation": "relu", "input_length": null, "border_mode": "valid", "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_22", "trainable": true, "border_mode": "valid", "stride": 66, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_11", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "trainable": true, "output_dim": 200, "input_dim": null, "W_constraint": null, "name": "dense_21", "b_constraint": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"p": 0.2, "name": "dropout_11", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "trainable": true, "output_dim": 3, "input_dim": null, "W_constraint": null, "name": "dense_22", "b_constraint": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}