{"keras_version": "1.1.1", "config": [{"config": {"mode_type": "raw", "name": "merge_1", "output_shape_type": "raw", "dot_axes": -1, "layers": [{"config": [{"config": {"batch_input_shape": [null, 140], "input_length": 140, "activity_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "name": "embedding_1_dai_model", "init": "uniform", "W_constraint": null, "input_dim": 1576890, "input_dtype": "int32", "W_regularizer": null, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "name": "convolution1d_1_dai_model", "nb_filter": 200, "activation": "relu", "W_constraint": null, "input_dim": null, "border_mode": "valid", "W_regularizer": null, "subsample_length": 1, "init": "uniform"}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_dai_model", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "name": "convolution1d_2_dai_model", "nb_filter": 200, "activation": "relu", "W_constraint": null, "input_dim": null, "border_mode": "valid", "W_regularizer": null, "subsample_length": 1, "init": "uniform"}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 66, "name": "maxpooling1d_2_dai_model", "stride": 66, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_dai_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "input_length": 140, "activity_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "name": "embedding_17_mpq_model", "init": "uniform", "W_constraint": null, "input_dim": 428669, "input_dtype": "int32", "W_regularizer": null, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "name": "convolution1d_33_mpq_model", "nb_filter": 200, "activation": "relu", "W_constraint": null, "input_dim": null, "border_mode": "valid", "W_regularizer": null, "subsample_length": 1, "init": "uniform"}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_33_mpq_model", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "name": "convolution1d_34_mpq_model", "nb_filter": 200, "activation": "relu", "W_constraint": null, "input_dim": null, "border_mode": "valid", "W_regularizer": null, "subsample_length": 1, "init": "uniform"}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 66, "name": "maxpooling1d_34_mpq_model", "stride": 66, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_17_mpq_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "input_length": 140, "activity_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "name": "embedding_1_hul_model", "init": "uniform", "W_constraint": null, "input_dim": 1062158, "input_dtype": "int32", "W_regularizer": null, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "name": "convolution1d_1_hul_model", "nb_filter": 200, "activation": "relu", "W_constraint": null, "input_dim": null, "border_mode": "valid", "W_regularizer": null, "subsample_length": 1, "init": "uniform"}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_hul_model", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "name": "convolution1d_2_hul_model", "nb_filter": 200, "activation": "relu", "W_constraint": null, "input_dim": null, "border_mode": "valid", "W_regularizer": null, "subsample_length": 1, "init": "uniform"}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 66, "name": "maxpooling1d_2_hul_model", "stride": 66, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_hul_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "input_length": 140, "activity_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "name": "embedding_1_tac_model", "init": "uniform", "W_constraint": null, "input_dim": 428669, "input_dtype": "int32", "W_regularizer": null, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "name": "convolution1d_1_tac_model", "nb_filter": 200, "activation": "relu", "W_constraint": null, "input_dim": null, "border_mode": "valid", "W_regularizer": null, "subsample_length": 1, "init": "uniform"}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_tac_model", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "name": "convolution1d_2_tac_model", "nb_filter": 200, "activation": "relu", "W_constraint": null, "input_dim": null, "border_mode": "valid", "W_regularizer": null, "subsample_length": 1, "init": "uniform"}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 66, "name": "maxpooling1d_2_tac_model", "stride": 66, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_tac_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "input_length": 140, "activity_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "name": "embedding_1_dil_model", "init": "uniform", "W_constraint": null, "input_dim": 1576890, "input_dtype": "int32", "W_regularizer": null, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "name": "convolution1d_1_dil_model", "nb_filter": 200, "activation": "relu", "W_constraint": null, "input_dim": null, "border_mode": "valid", "W_regularizer": null, "subsample_length": 1, "init": "uniform"}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_dil_model", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "name": "convolution1d_2_dil_model", "nb_filter": 200, "activation": "relu", "W_constraint": null, "input_dim": null, "border_mode": "valid", "W_regularizer": null, "subsample_length": 1, "init": "uniform"}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 66, "name": "maxpooling1d_2_dil_model", "stride": 66, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_dil_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "input_length": 140, "activity_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "name": "embedding_1_semeval_model", "init": "uniform", "W_constraint": null, "input_dim": 428669, "input_dtype": "int32", "W_regularizer": null, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "name": "convolution1d_1_semeval_model", "nb_filter": 200, "activation": "relu", "W_constraint": null, "input_dim": null, "border_mode": "valid", "W_regularizer": null, "subsample_length": 1, "init": "uniform"}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_semeval_model", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "name": "convolution1d_2_semeval_model", "nb_filter": 200, "activation": "relu", "W_constraint": null, "input_dim": null, "border_mode": "valid", "W_regularizer": null, "subsample_length": 1, "init": "uniform"}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 66, "name": "maxpooling1d_2_semeval_model", "stride": 66, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_semeval_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}], "concat_axis": -1, "mode": "concat", "output_shape": null}, "class_name": "Merge"}, {"config": {"activation": "linear", "bias": true, "activity_regularizer": null, "output_dim": 1028, "trainable": true, "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "W_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "softmax", "bias": true, "activity_regularizer": null, "output_dim": 3, "trainable": true, "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "W_regularizer": null, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}