{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "batch_input_shape": [null, 140], "input_dim": 1062158, "mask_zero": false, "W_regularizer": null, "name": "embedding_12", "input_dtype": "int32", "activity_regularizer": null, "output_dim": 52, "dropout": 0.2, "input_length": 140, "init": "uniform", "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_12"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 200, "input_dim": null, "activation": "relu", "subsample_length": 1, "W_regularizer": null, "bias": true, "name": "convolution1d_23", "activity_regularizer": null, "filter_length": 6, "border_mode": "valid", "input_length": null, "init": "uniform", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_23", "stride": 2}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 200, "input_dim": null, "activation": "relu", "subsample_length": 1, "W_regularizer": null, "bias": true, "name": "convolution1d_24", "activity_regularizer": null, "filter_length": 6, "border_mode": "valid", "input_length": null, "init": "uniform", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_24", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_12", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "activation": "linear", "bias": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 200, "name": "dense_23", "init": "glorot_uniform", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_12", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_12", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "b_regularizer": null, "input_dim": null, "activation": "softmax", "bias": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 3, "name": "dense_24", "init": "glorot_uniform", "trainable": true}}]}