{"config": [{"config": {"mode_type": "raw", "mode": "concat", "concat_axis": -1, "dot_axes": -1, "output_shape_type": "raw", "layers": [{"config": [{"config": {"input_dim": 428669, "dropout": 0.2, "name": "embedding_1_tac_model", "input_dtype": "int32", "W_constraint": null, "mask_zero": false, "batch_input_shape": [null, 140], "activity_regularizer": null, "trainable": true, "output_dim": 52, "W_regularizer": null, "input_length": 140, "init": "uniform"}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "nb_filter": 200, "name": "convolution1d_1_tac_model", "activation": "relu", "init": "uniform", "bias": true, "border_mode": "valid", "activity_regularizer": null, "filter_length": 6, "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_tac_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "nb_filter": 200, "name": "convolution1d_2_tac_model", "activation": "relu", "init": "uniform", "bias": true, "border_mode": "valid", "activity_regularizer": null, "filter_length": 6, "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_2_tac_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_tac_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dim": 428669, "dropout": 0.2, "name": "embedding_17_mpq_model", "input_dtype": "int32", "W_constraint": null, "mask_zero": false, "batch_input_shape": [null, 140], "activity_regularizer": null, "trainable": true, "output_dim": 52, "W_regularizer": null, "input_length": 140, "init": "uniform"}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_17_mpq_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "nb_filter": 200, "name": "convolution1d_33_mpq_model", "activation": "relu", "init": "uniform", "bias": true, "border_mode": "valid", "activity_regularizer": null, "filter_length": 6, "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "nb_filter": 200, "name": "convolution1d_34_mpq_model", "activation": "relu", "init": "uniform", "bias": true, "border_mode": "valid", "activity_regularizer": null, "filter_length": 6, "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_34_mpq_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_17_mpq_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dim": 1576890, "dropout": 0.2, "name": "embedding_1_dai_model", "input_dtype": "int32", "W_constraint": null, "mask_zero": false, "batch_input_shape": [null, 140], "activity_regularizer": null, "trainable": true, "output_dim": 52, "W_regularizer": null, "input_length": 140, "init": "uniform"}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_dai_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "nb_filter": 200, "name": "convolution1d_1_dai_model", "activation": "relu", "init": "uniform", "bias": true, "border_mode": "valid", "activity_regularizer": null, "filter_length": 6, "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_dai_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "nb_filter": 200, "name": "convolution1d_2_dai_model", "activation": "relu", "init": "uniform", "bias": true, "border_mode": "valid", "activity_regularizer": null, "filter_length": 6, "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_2_dai_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_dai_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dim": 428669, "dropout": 0.2, "name": "embedding_1_semeval_model", "input_dtype": "int32", "W_constraint": null, "mask_zero": false, "batch_input_shape": [null, 140], "activity_regularizer": null, "trainable": true, "output_dim": 52, "W_regularizer": null, "input_length": 140, "init": "uniform"}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "nb_filter": 200, "name": "convolution1d_1_semeval_model", "activation": "relu", "init": "uniform", "bias": true, "border_mode": "valid", "activity_regularizer": null, "filter_length": 6, "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "nb_filter": 200, "name": "convolution1d_2_semeval_model", "activation": "relu", "init": "uniform", "bias": true, "border_mode": "valid", "activity_regularizer": null, "filter_length": 6, "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_2_semeval_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_semeval_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dim": 1062158, "dropout": 0.2, "name": "embedding_1_hul_model", "input_dtype": "int32", "W_constraint": null, "mask_zero": false, "batch_input_shape": [null, 140], "activity_regularizer": null, "trainable": true, "output_dim": 52, "W_regularizer": null, "input_length": 140, "init": "uniform"}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "nb_filter": 200, "name": "convolution1d_1_hul_model", "activation": "relu", "init": "uniform", "bias": true, "border_mode": "valid", "activity_regularizer": null, "filter_length": 6, "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_hul_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "nb_filter": 200, "name": "convolution1d_2_hul_model", "activation": "relu", "init": "uniform", "bias": true, "border_mode": "valid", "activity_regularizer": null, "filter_length": 6, "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_2_hul_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_hul_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dim": 1576890, "dropout": 0.2, "name": "embedding_1_dil_model", "input_dtype": "int32", "W_constraint": null, "mask_zero": false, "batch_input_shape": [null, 140], "activity_regularizer": null, "trainable": true, "output_dim": 52, "W_regularizer": null, "input_length": 140, "init": "uniform"}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_dil_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "nb_filter": 200, "name": "convolution1d_1_dil_model", "activation": "relu", "init": "uniform", "bias": true, "border_mode": "valid", "activity_regularizer": null, "filter_length": 6, "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_dil_model", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "nb_filter": 200, "name": "convolution1d_2_dil_model", "activation": "relu", "init": "uniform", "bias": true, "border_mode": "valid", "activity_regularizer": null, "filter_length": 6, "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "border_mode": "valid", "name": "maxpooling1d_2_dil_model", "trainable": true, "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_dil_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}], "output_shape": null, "name": "merge_1"}, "class_name": "Merge"}, {"config": {"input_dim": null, "name": "dense_1", "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "trainable": true, "output_dim": 1028, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": null, "name": "dense_2", "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "trainable": true, "output_dim": 3, "activation": "softmax", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}