{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "output_shape_type": "raw", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_dai_model", "mask_zero": false, "trainable": true, "batch_input_shape": [null, 140], "input_length": 140, "W_constraint": null, "init": "uniform", "output_dim": 52, "dropout": 0.2, "input_dim": 1576890, "activity_regularizer": null, "input_dtype": "int32", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_dai_model", "trainable": true, "b_regularizer": null, "input_length": null, "nb_filter": 200, "W_constraint": null, "b_constraint": null, "init": "uniform", "activation": "relu", "activity_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "W_regularizer": null, "border_mode": "valid", "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_dai_model", "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_dai_model", "trainable": true, "b_regularizer": null, "input_length": null, "nb_filter": 200, "W_constraint": null, "b_constraint": null, "init": "uniform", "activation": "relu", "activity_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "W_regularizer": null, "border_mode": "valid", "subsample_length": 1}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_dil_model", "mask_zero": false, "trainable": true, "batch_input_shape": [null, 140], "input_length": 140, "W_constraint": null, "init": "uniform", "output_dim": 52, "dropout": 0.2, "input_dim": 1576890, "activity_regularizer": null, "input_dtype": "int32", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_dil_model", "trainable": true, "b_regularizer": null, "input_length": null, "nb_filter": 200, "W_constraint": null, "b_constraint": null, "init": "uniform", "activation": "relu", "activity_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "W_regularizer": null, "border_mode": "valid", "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_dil_model", "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_dil_model", "trainable": true, "b_regularizer": null, "input_length": null, "nb_filter": 200, "W_constraint": null, "b_constraint": null, "init": "uniform", "activation": "relu", "activity_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "W_regularizer": null, "border_mode": "valid", "subsample_length": 1}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_hul_model", "mask_zero": false, "trainable": true, "batch_input_shape": [null, 140], "input_length": 140, "W_constraint": null, "init": "uniform", "output_dim": 52, "dropout": 0.2, "input_dim": 1062158, "activity_regularizer": null, "input_dtype": "int32", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_hul_model", "trainable": true, "b_regularizer": null, "input_length": null, "nb_filter": 200, "W_constraint": null, "b_constraint": null, "init": "uniform", "activation": "relu", "activity_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "W_regularizer": null, "border_mode": "valid", "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_hul_model", "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_hul_model", "trainable": true, "b_regularizer": null, "input_length": null, "nb_filter": 200, "W_constraint": null, "b_constraint": null, "init": "uniform", "activation": "relu", "activity_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "W_regularizer": null, "border_mode": "valid", "subsample_length": 1}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_semeval_model", "mask_zero": false, "trainable": true, "batch_input_shape": [null, 140], "input_length": 140, "W_constraint": null, "init": "uniform", "output_dim": 52, "dropout": 0.2, "input_dim": 428669, "activity_regularizer": null, "input_dtype": "int32", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_semeval_model", "trainable": true, "b_regularizer": null, "input_length": null, "nb_filter": 200, "W_constraint": null, "b_constraint": null, "init": "uniform", "activation": "relu", "activity_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "W_regularizer": null, "border_mode": "valid", "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_semeval_model", "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_semeval_model", "trainable": true, "b_regularizer": null, "input_length": null, "nb_filter": 200, "W_constraint": null, "b_constraint": null, "init": "uniform", "activation": "relu", "activity_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "W_regularizer": null, "border_mode": "valid", "subsample_length": 1}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_tac_model", "mask_zero": false, "trainable": true, "batch_input_shape": [null, 140], "input_length": 140, "W_constraint": null, "init": "uniform", "output_dim": 52, "dropout": 0.2, "input_dim": 428669, "activity_regularizer": null, "input_dtype": "int32", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_tac_model", "trainable": true, "b_regularizer": null, "input_length": null, "nb_filter": 200, "W_constraint": null, "b_constraint": null, "init": "uniform", "activation": "relu", "activity_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "W_regularizer": null, "border_mode": "valid", "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_tac_model", "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_tac_model", "trainable": true, "b_regularizer": null, "input_length": null, "nb_filter": 200, "W_constraint": null, "b_constraint": null, "init": "uniform", "activation": "relu", "activity_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "W_regularizer": null, "border_mode": "valid", "subsample_length": 1}}]}], "dot_axes": -1, "concat_axis": -1, "mode": "concat", "mode_type": "raw", "output_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "b_regularizer": null, "output_dim": 200, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "bias": true, "input_dim": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "b_regularizer": null, "output_dim": 3, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "activation": "softmax", "bias": true, "input_dim": null, "activity_regularizer": null, "W_regularizer": null}}]}