{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "input_length": 140, "W_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 140], "activity_regularizer": null, "input_dim": 428669, "init": "uniform", "name": "embedding_1", "output_dim": 52, "input_dtype": "int32", "mask_zero": false, "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"bias": true, "subsample_length": 1, "input_length": null, "W_constraint": null, "activation": "relu", "trainable": true, "nb_filter": 200, "activity_regularizer": null, "input_dim": null, "filter_length": 6, "init": "uniform", "name": "convolution1d_1", "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1", "border_mode": "valid", "stride": 2, "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"bias": true, "subsample_length": 1, "input_length": null, "W_constraint": null, "activation": "relu", "trainable": true, "nb_filter": 200, "activity_regularizer": null, "input_dim": null, "filter_length": 6, "init": "uniform", "name": "convolution1d_2", "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2", "border_mode": "valid", "stride": 66, "trainable": true, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "input_dim": null, "b_constraint": null, "init": "glorot_uniform", "name": "dense_1", "output_dim": 200, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "activation": "softmax", "trainable": true, "activity_regularizer": null, "input_dim": null, "b_constraint": null, "init": "glorot_uniform", "name": "dense_2", "output_dim": 3, "W_regularizer": null, "b_regularizer": null}}], "keras_version": "1.1.1"}