{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"dot_axes": -1, "mode_type": "raw", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "init": "uniform", "batch_input_shape": [null, 140], "W_regularizer": null, "dropout": 0.2, "activity_regularizer": null, "input_dim": 1062158, "name": "embedding_1_hul_model", "mask_zero": false, "trainable": true, "W_constraint": null, "input_length": 140, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_hul_model"}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "W_regularizer": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null, "name": "convolution1d_1_hul_model", "nb_filter": 200, "bias": true, "trainable": true, "activation": "relu", "W_constraint": null, "input_length": null, "b_constraint": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_hul_model"}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "W_regularizer": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null, "name": "convolution1d_2_hul_model", "nb_filter": 200, "bias": true, "trainable": true, "activation": "relu", "W_constraint": null, "input_length": null, "b_constraint": null, "input_dim": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "init": "uniform", "batch_input_shape": [null, 140], "W_regularizer": null, "dropout": 0.2, "activity_regularizer": null, "input_dim": 1576890, "name": "embedding_1_semeval_model", "mask_zero": false, "trainable": true, "W_constraint": null, "input_length": 140, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "W_regularizer": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null, "name": "convolution1d_1_semeval_model", "nb_filter": 200, "bias": true, "trainable": true, "activation": "relu", "W_constraint": null, "input_length": null, "b_constraint": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "W_regularizer": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null, "name": "convolution1d_2_semeval_model", "nb_filter": 200, "bias": true, "trainable": true, "activation": "relu", "W_constraint": null, "input_length": null, "b_constraint": null, "input_dim": null}}]}], "concat_axis": -1, "name": "merge_1", "mode": "concat", "output_shape": null, "output_shape_type": "raw"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1"}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "W_regularizer": null, "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null, "name": "convolution1d_1", "nb_filter": 200, "bias": true, "trainable": true, "activation": "relu", "W_constraint": null, "input_length": null, "b_constraint": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 200, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "dense_1", "bias": true, "trainable": true, "activation": "linear", "W_constraint": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"output_dim": 3, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "dense_2", "bias": true, "trainable": true, "activation": "softmax", "W_constraint": null, "b_constraint": null}}]}