{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode": "concat", "output_shape": null, "dot_axes": -1, "output_shape_type": "raw", "mode_type": "raw", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_dai_model", "mask_zero": false, "input_dtype": "int32", "dropout": 0.2, "input_dim": 1576890, "init": "uniform", "activity_regularizer": null, "W_constraint": null, "output_dim": 52, "trainable": true, "W_regularizer": null, "input_length": 140, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_dai_model", "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "bias": true, "init": "uniform", "subsample_length": 1, "b_regularizer": null, "trainable": true, "filter_length": 6, "b_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activation": "relu", "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dai_model", "trainable": true, "pool_length": 4, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_dai_model", "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "bias": true, "init": "uniform", "subsample_length": 1, "b_regularizer": null, "trainable": true, "filter_length": 6, "b_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activation": "relu", "nb_filter": 200}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_dil_model", "mask_zero": false, "input_dtype": "int32", "dropout": 0.2, "input_dim": 1576890, "init": "uniform", "activity_regularizer": null, "W_constraint": null, "output_dim": 52, "trainable": true, "W_regularizer": null, "input_length": 140, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_dil_model", "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "bias": true, "init": "uniform", "subsample_length": 1, "b_regularizer": null, "trainable": true, "filter_length": 6, "b_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activation": "relu", "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dil_model", "trainable": true, "pool_length": 4, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_dil_model", "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "bias": true, "init": "uniform", "subsample_length": 1, "b_regularizer": null, "trainable": true, "filter_length": 6, "b_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activation": "relu", "nb_filter": 200}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_hul_model", "mask_zero": false, "input_dtype": "int32", "dropout": 0.2, "input_dim": 1062158, "init": "uniform", "activity_regularizer": null, "W_constraint": null, "output_dim": 52, "trainable": true, "W_regularizer": null, "input_length": 140, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_hul_model", "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "bias": true, "init": "uniform", "subsample_length": 1, "b_regularizer": null, "trainable": true, "filter_length": 6, "b_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activation": "relu", "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_hul_model", "trainable": true, "pool_length": 4, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_hul_model", "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "bias": true, "init": "uniform", "subsample_length": 1, "b_regularizer": null, "trainable": true, "filter_length": 6, "b_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activation": "relu", "nb_filter": 200}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_17_mpq_model", "mask_zero": false, "input_dtype": "int32", "dropout": 0.2, "input_dim": 428669, "init": "uniform", "activity_regularizer": null, "W_constraint": null, "output_dim": 52, "trainable": true, "W_regularizer": null, "input_length": 140, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_33_mpq_model", "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "bias": true, "init": "uniform", "subsample_length": 1, "b_regularizer": null, "trainable": true, "filter_length": 6, "b_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activation": "relu", "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_33_mpq_model", "trainable": true, "pool_length": 4, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_34_mpq_model", "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "bias": true, "init": "uniform", "subsample_length": 1, "b_regularizer": null, "trainable": true, "filter_length": 6, "b_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activation": "relu", "nb_filter": 200}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_semeval_model", "mask_zero": false, "input_dtype": "int32", "dropout": 0.2, "input_dim": 428669, "init": "uniform", "activity_regularizer": null, "W_constraint": null, "output_dim": 52, "trainable": true, "W_regularizer": null, "input_length": 140, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_semeval_model", "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "bias": true, "init": "uniform", "subsample_length": 1, "b_regularizer": null, "trainable": true, "filter_length": 6, "b_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activation": "relu", "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_semeval_model", "trainable": true, "pool_length": 4, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_semeval_model", "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "bias": true, "init": "uniform", "subsample_length": 1, "b_regularizer": null, "trainable": true, "filter_length": 6, "b_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activation": "relu", "nb_filter": 200}}]}]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "W_constraint": null, "input_dim": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "output_dim": 200, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "W_constraint": null, "input_dim": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "output_dim": 3, "activation": "softmax"}}], "keras_version": "1.1.1"}