{"config": [{"config": {"layers": [{"config": [{"config": {"input_dim": 1576890, "W_constraint": null, "trainable": true, "mask_zero": false, "dropout": 0.2, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "input_dtype": "int32", "output_dim": 52, "input_length": 140, "name": "embedding_1_dai_model"}, "class_name": "Embedding"}, {"config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_dai_model"}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "subsample_length": 1, "W_constraint": null, "filter_length": 6, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "nb_filter": 200, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "border_mode": "valid", "name": "convolution1d_1_dai_model"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_1_dai_model"}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "subsample_length": 1, "W_constraint": null, "filter_length": 6, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "nb_filter": 200, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "border_mode": "valid", "name": "convolution1d_2_dai_model"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dim": 1576890, "W_constraint": null, "trainable": true, "mask_zero": false, "dropout": 0.2, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "input_dtype": "int32", "output_dim": 52, "input_length": 140, "name": "embedding_1_dil_model"}, "class_name": "Embedding"}, {"config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_dil_model"}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "subsample_length": 1, "W_constraint": null, "filter_length": 6, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "nb_filter": 200, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "border_mode": "valid", "name": "convolution1d_1_dil_model"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_1_dil_model"}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "subsample_length": 1, "W_constraint": null, "filter_length": 6, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "nb_filter": 200, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "border_mode": "valid", "name": "convolution1d_2_dil_model"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dim": 1062158, "W_constraint": null, "trainable": true, "mask_zero": false, "dropout": 0.2, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "input_dtype": "int32", "output_dim": 52, "input_length": 140, "name": "embedding_1_hul_model"}, "class_name": "Embedding"}, {"config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_hul_model"}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "subsample_length": 1, "W_constraint": null, "filter_length": 6, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "nb_filter": 200, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "border_mode": "valid", "name": "convolution1d_1_hul_model"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_1_hul_model"}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "subsample_length": 1, "W_constraint": null, "filter_length": 6, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "nb_filter": 200, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "border_mode": "valid", "name": "convolution1d_2_hul_model"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dim": 428669, "W_constraint": null, "trainable": true, "mask_zero": false, "dropout": 0.2, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "input_dtype": "int32", "output_dim": 52, "input_length": 140, "name": "embedding_17_mpq_model"}, "class_name": "Embedding"}, {"config": {"padding": 5, "trainable": true, "name": "zeropadding1d_17_mpq_model"}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "subsample_length": 1, "W_constraint": null, "filter_length": 6, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "nb_filter": 200, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "border_mode": "valid", "name": "convolution1d_33_mpq_model"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_33_mpq_model"}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "subsample_length": 1, "W_constraint": null, "filter_length": 6, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "nb_filter": 200, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "border_mode": "valid", "name": "convolution1d_34_mpq_model"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dim": 428669, "W_constraint": null, "trainable": true, "mask_zero": false, "dropout": 0.2, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "input_dtype": "int32", "output_dim": 52, "input_length": 140, "name": "embedding_1_tac_model"}, "class_name": "Embedding"}, {"config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_tac_model"}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "subsample_length": 1, "W_constraint": null, "filter_length": 6, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "nb_filter": 200, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "border_mode": "valid", "name": "convolution1d_1_tac_model"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_1_tac_model"}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "subsample_length": 1, "W_constraint": null, "filter_length": 6, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "nb_filter": 200, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "border_mode": "valid", "name": "convolution1d_2_tac_model"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dim": 428669, "W_constraint": null, "trainable": true, "mask_zero": false, "dropout": 0.2, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "input_dtype": "int32", "output_dim": 52, "input_length": 140, "name": "embedding_1_semeval_model"}, "class_name": "Embedding"}, {"config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_semeval_model"}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "subsample_length": 1, "W_constraint": null, "filter_length": 6, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "nb_filter": 200, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "border_mode": "valid", "name": "convolution1d_1_semeval_model"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model"}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "subsample_length": 1, "W_constraint": null, "filter_length": 6, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "nb_filter": 200, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null, "border_mode": "valid", "name": "convolution1d_2_semeval_model"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}], "mode": "concat", "concat_axis": -1, "mode_type": "raw", "output_shape_type": "raw", "output_shape": null, "dot_axes": -1, "name": "merge_1"}, "class_name": "Merge"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dim": null, "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 200, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"input_dim": null, "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 3, "name": "dense_2"}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}