{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.2, "activity_regularizer": null, "output_dim": 52, "name": "embedding_1", "input_dtype": "int32", "init": "uniform", "W_regularizer": null, "W_constraint": null, "trainable": true, "batch_input_shape": [null, 140], "input_length": 140, "mask_zero": false, "input_dim": 1576890}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "input_length": null, "name": "convolution1d_1", "subsample_length": 1, "init": "uniform", "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "filter_length": 6, "W_constraint": null, "activation": "relu", "trainable": true, "nb_filter": 200, "bias": true, "input_dim": null, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "input_length": null, "name": "convolution1d_2", "subsample_length": 1, "init": "uniform", "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "filter_length": 6, "W_constraint": null, "activation": "relu", "trainable": true, "nb_filter": 200, "bias": true, "input_dim": null, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "name": "maxpooling1d_2", "pool_length": 66, "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "output_dim": 200, "activation": "linear", "trainable": true, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_1", "bias": true, "input_dim": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "output_dim": 3, "activation": "softmax", "trainable": true, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_2", "bias": true, "input_dim": null, "b_regularizer": null}}], "keras_version": "1.1.0"}