{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "concat", "dot_axes": -1, "concat_axis": -1, "mode_type": "raw", "output_shape": null, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "mask_zero": false, "input_length": 140, "input_dtype": "int32", "trainable": true, "dropout": 0.2, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "init": "uniform", "input_dim": 1576890, "name": "embedding_1_dai_model", "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_dai_model"}}, {"class_name": "Convolution1D", "config": {"input_length": null, "trainable": true, "filter_length": 6, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "W_constraint": null, "nb_filter": 200, "init": "uniform", "input_dim": null, "bias": true, "subsample_length": 1, "b_regularizer": null, "name": "convolution1d_1_dai_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "pool_length": 4, "trainable": true, "name": "maxpooling1d_1_dai_model"}}, {"class_name": "Convolution1D", "config": {"input_length": null, "trainable": true, "filter_length": 6, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "W_constraint": null, "nb_filter": 200, "init": "uniform", "input_dim": null, "bias": true, "subsample_length": 1, "b_regularizer": null, "name": "convolution1d_2_dai_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "pool_length": 66, "trainable": true, "name": "maxpooling1d_2_dai_model"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_dai_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "mask_zero": false, "input_length": 140, "input_dtype": "int32", "trainable": true, "dropout": 0.2, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "init": "uniform", "input_dim": 1576890, "name": "embedding_1_dil_model", "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_dil_model"}}, {"class_name": "Convolution1D", "config": {"input_length": null, "trainable": true, "filter_length": 6, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "W_constraint": null, "nb_filter": 200, "init": "uniform", "input_dim": null, "bias": true, "subsample_length": 1, "b_regularizer": null, "name": "convolution1d_1_dil_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "pool_length": 4, "trainable": true, "name": "maxpooling1d_1_dil_model"}}, {"class_name": "Convolution1D", "config": {"input_length": null, "trainable": true, "filter_length": 6, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "W_constraint": null, "nb_filter": 200, "init": "uniform", "input_dim": null, "bias": true, "subsample_length": 1, "b_regularizer": null, "name": "convolution1d_2_dil_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "pool_length": 66, "trainable": true, "name": "maxpooling1d_2_dil_model"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_dil_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "mask_zero": false, "input_length": 140, "input_dtype": "int32", "trainable": true, "dropout": 0.2, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "init": "uniform", "input_dim": 428669, "name": "embedding_17_mpq_model", "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_17_mpq_model"}}, {"class_name": "Convolution1D", "config": {"input_length": null, "trainable": true, "filter_length": 6, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "W_constraint": null, "nb_filter": 200, "init": "uniform", "input_dim": null, "bias": true, "subsample_length": 1, "b_regularizer": null, "name": "convolution1d_33_mpq_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "pool_length": 4, "trainable": true, "name": "maxpooling1d_33_mpq_model"}}, {"class_name": "Convolution1D", "config": {"input_length": null, "trainable": true, "filter_length": 6, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "W_constraint": null, "nb_filter": 200, "init": "uniform", "input_dim": null, "bias": true, "subsample_length": 1, "b_regularizer": null, "name": "convolution1d_34_mpq_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "pool_length": 66, "trainable": true, "name": "maxpooling1d_34_mpq_model"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_17_mpq_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "mask_zero": false, "input_length": 140, "input_dtype": "int32", "trainable": true, "dropout": 0.2, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "init": "uniform", "input_dim": 1062158, "name": "embedding_1_hul_model", "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_hul_model"}}, {"class_name": "Convolution1D", "config": {"input_length": null, "trainable": true, "filter_length": 6, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "W_constraint": null, "nb_filter": 200, "init": "uniform", "input_dim": null, "bias": true, "subsample_length": 1, "b_regularizer": null, "name": "convolution1d_1_hul_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "pool_length": 4, "trainable": true, "name": "maxpooling1d_1_hul_model"}}, {"class_name": "Convolution1D", "config": {"input_length": null, "trainable": true, "filter_length": 6, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "W_constraint": null, "nb_filter": 200, "init": "uniform", "input_dim": null, "bias": true, "subsample_length": 1, "b_regularizer": null, "name": "convolution1d_2_hul_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "pool_length": 66, "trainable": true, "name": "maxpooling1d_2_hul_model"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_hul_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "mask_zero": false, "input_length": 140, "input_dtype": "int32", "trainable": true, "dropout": 0.2, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "init": "uniform", "input_dim": 428669, "name": "embedding_1_semeval_model", "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"input_length": null, "trainable": true, "filter_length": 6, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "W_constraint": null, "nb_filter": 200, "init": "uniform", "input_dim": null, "bias": true, "subsample_length": 1, "b_regularizer": null, "name": "convolution1d_1_semeval_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "pool_length": 4, "trainable": true, "name": "maxpooling1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"input_length": null, "trainable": true, "filter_length": 6, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "W_constraint": null, "nb_filter": 200, "init": "uniform", "input_dim": null, "bias": true, "subsample_length": 1, "b_regularizer": null, "name": "convolution1d_2_semeval_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "pool_length": 66, "trainable": true, "name": "maxpooling1d_2_semeval_model"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_semeval_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "mask_zero": false, "input_length": 140, "input_dtype": "int32", "trainable": true, "dropout": 0.2, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "init": "uniform", "input_dim": 428669, "name": "embedding_1_tac_model", "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_tac_model"}}, {"class_name": "Convolution1D", "config": {"input_length": null, "trainable": true, "filter_length": 6, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "W_constraint": null, "nb_filter": 200, "init": "uniform", "input_dim": null, "bias": true, "subsample_length": 1, "b_regularizer": null, "name": "convolution1d_1_tac_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "pool_length": 4, "trainable": true, "name": "maxpooling1d_1_tac_model"}}, {"class_name": "Convolution1D", "config": {"input_length": null, "trainable": true, "filter_length": 6, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "W_constraint": null, "nb_filter": 200, "init": "uniform", "input_dim": null, "bias": true, "subsample_length": 1, "b_regularizer": null, "name": "convolution1d_2_tac_model"}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "pool_length": 66, "trainable": true, "name": "maxpooling1d_2_tac_model"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_tac_model"}}]}], "name": "merge_1"}}, {"class_name": "Dense", "config": {"output_dim": 1028, "trainable": true, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "input_dim": null, "bias": true, "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 3, "trainable": true, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "input_dim": null, "bias": true, "activity_regularizer": null, "name": "dense_2"}}], "keras_version": "1.1.1"}