{"config": [{"class_name": "Embedding", "config": {"name": "embedding_11", "W_regularizer": null, "input_length": 140, "trainable": true, "W_constraint": null, "input_dim": 1576890, "init": "uniform", "mask_zero": false, "batch_input_shape": [null, 140], "input_dtype": "int32", "activity_regularizer": null, "output_dim": 52, "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_11", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "name": "convolution1d_21", "W_regularizer": null, "b_constraint": null, "input_length": null, "trainable": true, "bias": true, "W_constraint": null, "b_regularizer": null, "input_dim": null, "subsample_length": 1, "filter_length": 6, "init": "uniform", "activation": "relu", "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_21", "trainable": true, "stride": 2, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "name": "convolution1d_22", "W_regularizer": null, "b_constraint": null, "input_length": null, "trainable": true, "bias": true, "W_constraint": null, "b_regularizer": null, "input_dim": null, "subsample_length": 1, "filter_length": 6, "init": "uniform", "activation": "relu", "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_22", "trainable": true, "stride": 66, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_11", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_21", "W_regularizer": null, "trainable": true, "b_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "output_dim": 200}}, {"class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_11", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_22", "W_regularizer": null, "trainable": true, "b_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "init": "glorot_uniform", "activation": "softmax", "activity_regularizer": null, "output_dim": 3}}], "keras_version": "1.1.0", "class_name": "Sequential"}