{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "input_length": 140, "W_regularizer": null, "init": "uniform", "name": "embedding_71", "mask_zero": false, "input_dtype": "int32", "output_dim": 52, "activity_regularizer": null, "dropout": 0.2, "trainable": true, "W_constraint": null, "input_dim": 1576890}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_71", "padding": 5}}, {"class_name": "Convolution1D", "config": {"bias": true, "subsample_length": 1, "input_dim": null, "input_length": null, "trainable": true, "name": "convolution1d_141", "activation": "relu", "b_constraint": null, "W_regularizer": null, "filter_length": 6, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "init": "uniform", "W_constraint": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_141", "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"bias": true, "subsample_length": 1, "input_dim": null, "input_length": null, "trainable": true, "name": "convolution1d_142", "activation": "relu", "b_constraint": null, "W_regularizer": null, "filter_length": 6, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "init": "uniform", "W_constraint": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "name": "maxpooling1d_142", "trainable": true, "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_71", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "W_regularizer": null, "trainable": true, "name": "dense_141", "activation": "linear", "b_constraint": null, "b_regularizer": null, "output_dim": 200, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_71", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_71", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "W_regularizer": null, "trainable": true, "name": "dense_142", "activation": "softmax", "b_constraint": null, "b_regularizer": null, "output_dim": 3, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}], "keras_version": "1.1.0"}