{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "output_shape": null, "dot_axes": -1, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"init": "uniform", "dropout": 0.2, "activity_regularizer": null, "output_dim": 52, "batch_input_shape": [null, 140], "W_constraint": null, "trainable": true, "W_regularizer": null, "input_dim": 428669, "input_dtype": "int32", "mask_zero": false, "name": "embedding_17_mpq_model", "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_17_mpq_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "activation": "relu", "border_mode": "valid", "activity_regularizer": null, "trainable": true, "filter_length": 6, "input_dim": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 200, "name": "convolution1d_33_mpq_model", "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_33_mpq_model"}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "activation": "relu", "border_mode": "valid", "activity_regularizer": null, "trainable": true, "filter_length": 6, "input_dim": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 200, "name": "convolution1d_34_mpq_model", "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"init": "uniform", "dropout": 0.2, "activity_regularizer": null, "output_dim": 52, "batch_input_shape": [null, 140], "W_constraint": null, "trainable": true, "W_regularizer": null, "input_dim": 1576890, "input_dtype": "int32", "mask_zero": false, "name": "embedding_1_semeval_model", "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_semeval_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "activation": "relu", "border_mode": "valid", "activity_regularizer": null, "trainable": true, "filter_length": 6, "input_dim": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 200, "name": "convolution1d_1_semeval_model", "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "activation": "relu", "border_mode": "valid", "activity_regularizer": null, "trainable": true, "filter_length": 6, "input_dim": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 200, "name": "convolution1d_2_semeval_model", "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"init": "uniform", "dropout": 0.2, "activity_regularizer": null, "output_dim": 52, "batch_input_shape": [null, 140], "W_constraint": null, "trainable": true, "W_regularizer": null, "input_dim": 428669, "input_dtype": "int32", "mask_zero": false, "name": "embedding_1_tac_model", "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_tac_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "activation": "relu", "border_mode": "valid", "activity_regularizer": null, "trainable": true, "filter_length": 6, "input_dim": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 200, "name": "convolution1d_1_tac_model", "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_tac_model"}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "activation": "relu", "border_mode": "valid", "activity_regularizer": null, "trainable": true, "filter_length": 6, "input_dim": null, "subsample_length": 1, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 200, "name": "convolution1d_2_tac_model", "input_length": null}}]}], "mode": "concat", "output_shape_type": "raw", "mode_type": "raw", "concat_axis": -1}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1"}}, {"class_name": "Convolution1D", "config": {"init": "uniform", "activation": "relu", "border_mode": "valid", "activity_regularizer": null, "trainable": true, "filter_length": 6, "subsample_length": 1, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 200, "input_length": null, "name": "convolution1d_1", "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "output_dim": 200, "trainable": true, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_1", "input_dim": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activation": "softmax", "activity_regularizer": null, "output_dim": 3, "trainable": true, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_2", "input_dim": null}}]}