{"keras_version": "1.1.1", "config": [{"config": {"output_dim": 52, "W_constraint": null, "mask_zero": false, "W_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dim": 1576890, "name": "embedding_1", "trainable": true, "dropout": 0.2, "input_dtype": "int32", "input_length": 140, "init": "uniform"}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "subsample_length": 1, "input_dim": null, "name": "convolution1d_1", "trainable": true, "nb_filter": 200, "input_length": null, "border_mode": "valid", "init": "uniform", "filter_length": 6, "bias": true, "activation": "relu"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "subsample_length": 1, "input_dim": null, "name": "convolution1d_2", "trainable": true, "nb_filter": 200, "input_length": null, "border_mode": "valid", "init": "uniform", "filter_length": 6, "bias": true, "activation": "relu"}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "pool_length": 66, "border_mode": "valid", "name": "maxpooling1d_2", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 200, "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "bias": true, "input_dim": null, "name": "dense_1", "trainable": true, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Dense"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 3, "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "bias": true, "input_dim": null, "name": "dense_2", "trainable": true, "init": "glorot_uniform", "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}