{"config": [{"config": {"mode": "concat", "mode_type": "raw", "name": "merge_1", "concat_axis": -1, "dot_axes": -1, "output_shape_type": "raw", "output_shape": null, "layers": [{"config": [{"config": {"dropout": 0.2, "name": "embedding_1_dai_model", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dtype": "int32", "mask_zero": false, "W_regularizer": null, "init": "uniform", "input_dim": 1576890, "input_length": 140, "output_dim": 52, "W_constraint": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "subsample_length": 1, "name": "convolution1d_1_dai_model", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "init": "uniform", "input_dim": null, "filter_length": 6, "input_length": null, "W_constraint": null, "trainable": true}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "name": "maxpooling1d_1_dai_model", "border_mode": "valid", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "subsample_length": 1, "name": "convolution1d_2_dai_model", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "init": "uniform", "input_dim": null, "filter_length": 6, "input_length": null, "W_constraint": null, "trainable": true}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"dropout": 0.2, "name": "embedding_1_dil_model", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dtype": "int32", "mask_zero": false, "W_regularizer": null, "init": "uniform", "input_dim": 1576890, "input_length": 140, "output_dim": 52, "W_constraint": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "subsample_length": 1, "name": "convolution1d_1_dil_model", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "init": "uniform", "input_dim": null, "filter_length": 6, "input_length": null, "W_constraint": null, "trainable": true}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "name": "maxpooling1d_1_dil_model", "border_mode": "valid", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "subsample_length": 1, "name": "convolution1d_2_dil_model", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "init": "uniform", "input_dim": null, "filter_length": 6, "input_length": null, "W_constraint": null, "trainable": true}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"dropout": 0.2, "name": "embedding_1_hul_model", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dtype": "int32", "mask_zero": false, "W_regularizer": null, "init": "uniform", "input_dim": 1062158, "input_length": 140, "output_dim": 52, "W_constraint": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "subsample_length": 1, "name": "convolution1d_1_hul_model", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "init": "uniform", "input_dim": null, "filter_length": 6, "input_length": null, "W_constraint": null, "trainable": true}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "name": "maxpooling1d_1_hul_model", "border_mode": "valid", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "subsample_length": 1, "name": "convolution1d_2_hul_model", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "init": "uniform", "input_dim": null, "filter_length": 6, "input_length": null, "W_constraint": null, "trainable": true}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"dropout": 0.2, "name": "embedding_17_mpq_model", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dtype": "int32", "mask_zero": false, "W_regularizer": null, "init": "uniform", "input_dim": 428669, "input_length": 140, "output_dim": 52, "W_constraint": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "subsample_length": 1, "name": "convolution1d_33_mpq_model", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "init": "uniform", "input_dim": null, "filter_length": 6, "input_length": null, "W_constraint": null, "trainable": true}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "name": "maxpooling1d_33_mpq_model", "border_mode": "valid", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "subsample_length": 1, "name": "convolution1d_34_mpq_model", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "init": "uniform", "input_dim": null, "filter_length": 6, "input_length": null, "W_constraint": null, "trainable": true}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"dropout": 0.2, "name": "embedding_1_semeval_model", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dtype": "int32", "mask_zero": false, "W_regularizer": null, "init": "uniform", "input_dim": 428669, "input_length": 140, "output_dim": 52, "W_constraint": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "subsample_length": 1, "name": "convolution1d_1_semeval_model", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "init": "uniform", "input_dim": null, "filter_length": 6, "input_length": null, "W_constraint": null, "trainable": true}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "name": "maxpooling1d_1_semeval_model", "border_mode": "valid", "trainable": true, "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "subsample_length": 1, "name": "convolution1d_2_semeval_model", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200, "bias": true, "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "init": "uniform", "input_dim": null, "filter_length": 6, "input_length": null, "W_constraint": null, "trainable": true}, "class_name": "Convolution1D"}], "class_name": "Sequential"}]}, "class_name": "Merge"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "name": "dense_1", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "output_dim": 200, "W_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "softmax", "name": "dense_2", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "output_dim": 3, "W_constraint": null, "trainable": true}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}