{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"dot_axes": -1, "concat_axis": -1, "mode": "concat", "mode_type": "raw", "output_shape_type": "raw", "name": "merge_1", "output_shape": null, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "init": "uniform", "input_dim": 1576890, "input_dtype": "int32", "input_length": 140, "trainable": true, "name": "embedding_1_dai_model", "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 140], "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dai_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "input_dim": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "border_mode": "valid", "trainable": true, "name": "convolution1d_1_dai_model", "init": "uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "filter_length": 6, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_dai_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "input_dim": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "border_mode": "valid", "trainable": true, "name": "convolution1d_2_dai_model", "init": "uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "filter_length": 6, "b_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "init": "uniform", "input_dim": 1576890, "input_dtype": "int32", "input_length": 140, "trainable": true, "name": "embedding_1_dil_model", "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 140], "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dil_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "input_dim": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "border_mode": "valid", "trainable": true, "name": "convolution1d_1_dil_model", "init": "uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "filter_length": 6, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_dil_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "input_dim": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "border_mode": "valid", "trainable": true, "name": "convolution1d_2_dil_model", "init": "uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "filter_length": 6, "b_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "init": "uniform", "input_dim": 428669, "input_dtype": "int32", "input_length": 140, "trainable": true, "name": "embedding_1_semeval_model", "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 140], "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "input_dim": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "border_mode": "valid", "trainable": true, "name": "convolution1d_1_semeval_model", "init": "uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "filter_length": 6, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_semeval_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "input_dim": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "border_mode": "valid", "trainable": true, "name": "convolution1d_2_semeval_model", "init": "uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "filter_length": 6, "b_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "init": "uniform", "input_dim": 428669, "input_dtype": "int32", "input_length": 140, "trainable": true, "name": "embedding_17_mpq_model", "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 140], "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_17_mpq_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "input_dim": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "border_mode": "valid", "trainable": true, "name": "convolution1d_33_mpq_model", "init": "uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "filter_length": 6, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_33_mpq_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "input_dim": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "border_mode": "valid", "trainable": true, "name": "convolution1d_34_mpq_model", "init": "uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "filter_length": 6, "b_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "init": "uniform", "input_dim": 428669, "input_dtype": "int32", "input_length": 140, "trainable": true, "name": "embedding_1_tac_model", "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 140], "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "input_dim": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "border_mode": "valid", "trainable": true, "name": "convolution1d_1_tac_model", "init": "uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "filter_length": 6, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_tac_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "input_dim": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "border_mode": "valid", "trainable": true, "name": "convolution1d_2_tac_model", "init": "uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "filter_length": 6, "b_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "init": "uniform", "input_dim": 1062158, "input_dtype": "int32", "input_length": 140, "trainable": true, "name": "embedding_1_hul_model", "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 140], "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "input_dim": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "border_mode": "valid", "trainable": true, "name": "convolution1d_1_hul_model", "init": "uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "filter_length": 6, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_hul_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "input_dim": null, "b_regularizer": null, "input_length": null, "subsample_length": 1, "border_mode": "valid", "trainable": true, "name": "convolution1d_2_hul_model", "init": "uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "filter_length": 6, "b_constraint": null}}]}]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "trainable": true, "name": "dense_1", "bias": true, "output_dim": 200, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "trainable": true, "name": "dense_2", "bias": true, "output_dim": 3, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "softmax", "b_constraint": null}}], "keras_version": "1.1.1"}