{"config": [{"config": {"output_shape_type": "raw", "layers": [{"config": [{"config": {"trainable": true, "input_dim": 428669, "W_constraint": null, "init": "uniform", "input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_1_semeval_model", "input_dtype": "int32", "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "output_dim": 52, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_semeval_model"}, "class_name": "ZeroPadding1D"}, {"config": {"filter_length": 6, "trainable": true, "input_dim": null, "nb_filter": 200, "b_regularizer": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "subsample_length": 1, "input_length": null, "W_regularizer": null, "W_constraint": null, "name": "convolution1d_1_semeval_model", "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "trainable": true, "name": "maxpooling1d_1_semeval_model", "border_mode": "valid", "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"filter_length": 6, "trainable": true, "input_dim": null, "nb_filter": 200, "b_regularizer": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "subsample_length": 1, "input_length": null, "W_regularizer": null, "W_constraint": null, "name": "convolution1d_2_semeval_model", "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "trainable": true, "name": "maxpooling1d_2_semeval_model", "border_mode": "valid", "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_semeval_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"trainable": true, "input_dim": 428669, "W_constraint": null, "init": "uniform", "input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_1_tac_model", "input_dtype": "int32", "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "output_dim": 52, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_tac_model"}, "class_name": "ZeroPadding1D"}, {"config": {"filter_length": 6, "trainable": true, "input_dim": null, "nb_filter": 200, "b_regularizer": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "subsample_length": 1, "input_length": null, "W_regularizer": null, "W_constraint": null, "name": "convolution1d_1_tac_model", "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "trainable": true, "name": "maxpooling1d_1_tac_model", "border_mode": "valid", "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"filter_length": 6, "trainable": true, "input_dim": null, "nb_filter": 200, "b_regularizer": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "subsample_length": 1, "input_length": null, "W_regularizer": null, "W_constraint": null, "name": "convolution1d_2_tac_model", "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "trainable": true, "name": "maxpooling1d_2_tac_model", "border_mode": "valid", "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_tac_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"trainable": true, "input_dim": 1576890, "W_constraint": null, "init": "uniform", "input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_1_dil_model", "input_dtype": "int32", "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "output_dim": 52, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_dil_model"}, "class_name": "ZeroPadding1D"}, {"config": {"filter_length": 6, "trainable": true, "input_dim": null, "nb_filter": 200, "b_regularizer": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "subsample_length": 1, "input_length": null, "W_regularizer": null, "W_constraint": null, "name": "convolution1d_1_dil_model", "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "trainable": true, "name": "maxpooling1d_1_dil_model", "border_mode": "valid", "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"filter_length": 6, "trainable": true, "input_dim": null, "nb_filter": 200, "b_regularizer": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "subsample_length": 1, "input_length": null, "W_regularizer": null, "W_constraint": null, "name": "convolution1d_2_dil_model", "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "trainable": true, "name": "maxpooling1d_2_dil_model", "border_mode": "valid", "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_dil_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"trainable": true, "input_dim": 1576890, "W_constraint": null, "init": "uniform", "input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_1_dai_model", "input_dtype": "int32", "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "output_dim": 52, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_dai_model"}, "class_name": "ZeroPadding1D"}, {"config": {"filter_length": 6, "trainable": true, "input_dim": null, "nb_filter": 200, "b_regularizer": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "subsample_length": 1, "input_length": null, "W_regularizer": null, "W_constraint": null, "name": "convolution1d_1_dai_model", "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "trainable": true, "name": "maxpooling1d_1_dai_model", "border_mode": "valid", "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"filter_length": 6, "trainable": true, "input_dim": null, "nb_filter": 200, "b_regularizer": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "subsample_length": 1, "input_length": null, "W_regularizer": null, "W_constraint": null, "name": "convolution1d_2_dai_model", "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "trainable": true, "name": "maxpooling1d_2_dai_model", "border_mode": "valid", "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_dai_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"trainable": true, "input_dim": 428669, "W_constraint": null, "init": "uniform", "input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_17_mpq_model", "input_dtype": "int32", "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "output_dim": 52, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_17_mpq_model"}, "class_name": "ZeroPadding1D"}, {"config": {"filter_length": 6, "trainable": true, "input_dim": null, "nb_filter": 200, "b_regularizer": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "subsample_length": 1, "input_length": null, "W_regularizer": null, "W_constraint": null, "name": "convolution1d_33_mpq_model", "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "trainable": true, "name": "maxpooling1d_33_mpq_model", "border_mode": "valid", "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"filter_length": 6, "trainable": true, "input_dim": null, "nb_filter": 200, "b_regularizer": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "subsample_length": 1, "input_length": null, "W_regularizer": null, "W_constraint": null, "name": "convolution1d_34_mpq_model", "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "trainable": true, "name": "maxpooling1d_34_mpq_model", "border_mode": "valid", "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_17_mpq_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"trainable": true, "input_dim": 1062158, "W_constraint": null, "init": "uniform", "input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_1_hul_model", "input_dtype": "int32", "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "output_dim": 52, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_hul_model"}, "class_name": "ZeroPadding1D"}, {"config": {"filter_length": 6, "trainable": true, "input_dim": null, "nb_filter": 200, "b_regularizer": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "subsample_length": 1, "input_length": null, "W_regularizer": null, "W_constraint": null, "name": "convolution1d_1_hul_model", "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "trainable": true, "name": "maxpooling1d_1_hul_model", "border_mode": "valid", "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"filter_length": 6, "trainable": true, "input_dim": null, "nb_filter": 200, "b_regularizer": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "subsample_length": 1, "input_length": null, "W_regularizer": null, "W_constraint": null, "name": "convolution1d_2_hul_model", "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "trainable": true, "name": "maxpooling1d_2_hul_model", "border_mode": "valid", "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1_hul_model"}, "class_name": "Flatten"}], "class_name": "Sequential"}], "output_shape": null, "concat_axis": -1, "dot_axes": -1, "mode_type": "raw", "mode": "concat", "name": "merge_1"}, "class_name": "Merge"}, {"config": {"trainable": true, "input_dim": null, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "bias": true, "W_regularizer": null, "name": "dense_1", "output_dim": 1028}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "input_dim": null, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "softmax", "bias": true, "W_regularizer": null, "name": "dense_2", "output_dim": 3}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}