{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"dot_axes": -1, "name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "init": "uniform", "W_regularizer": null, "input_dim": 1576890, "input_length": 140, "mask_zero": false, "dropout": 0.2, "input_dtype": "int32", "trainable": true, "name": "embedding_1_dai_model", "activity_regularizer": null, "output_dim": 52, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "activity_regularizer": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "input_length": null, "activation": "relu", "name": "convolution1d_1_dai_model", "nb_filter": 200, "filter_length": 6, "trainable": true, "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_dai_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "activity_regularizer": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "input_length": null, "activation": "relu", "name": "convolution1d_2_dai_model", "nb_filter": 200, "filter_length": 6, "trainable": true, "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "name": "maxpooling1d_2_dai_model", "pool_length": 66, "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dai_model", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "linear", "name": "dense_1_dai_model", "trainable": true, "output_dim": 200, "activity_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1_dai_model", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1_dai_model", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "softmax", "name": "dense_2_dai_model", "trainable": true, "output_dim": 3, "activity_regularizer": null, "bias": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "init": "uniform", "W_regularizer": null, "input_dim": 428669, "input_length": 140, "mask_zero": false, "dropout": 0.2, "input_dtype": "int32", "trainable": true, "name": "embedding_17_mpq_model", "activity_regularizer": null, "output_dim": 52, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "activity_regularizer": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "input_length": null, "activation": "relu", "name": "convolution1d_33_mpq_model", "nb_filter": 200, "filter_length": 6, "trainable": true, "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_33_mpq_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "activity_regularizer": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "input_length": null, "activation": "relu", "name": "convolution1d_34_mpq_model", "nb_filter": 200, "filter_length": 6, "trainable": true, "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "name": "maxpooling1d_34_mpq_model", "pool_length": 66, "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_17_mpq_model", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "linear", "name": "dense_33_mpq_model", "trainable": true, "output_dim": 200, "activity_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_17_mpq_model", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_17_mpq_model", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "softmax", "name": "dense_34_mpq_model", "trainable": true, "output_dim": 3, "activity_regularizer": null, "bias": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "init": "uniform", "W_regularizer": null, "input_dim": 1062158, "input_length": 140, "mask_zero": false, "dropout": 0.2, "input_dtype": "int32", "trainable": true, "name": "embedding_1_hul_model", "activity_regularizer": null, "output_dim": 52, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "activity_regularizer": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "input_length": null, "activation": "relu", "name": "convolution1d_1_hul_model", "nb_filter": 200, "filter_length": 6, "trainable": true, "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_hul_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "activity_regularizer": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "input_length": null, "activation": "relu", "name": "convolution1d_2_hul_model", "nb_filter": 200, "filter_length": 6, "trainable": true, "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "name": "maxpooling1d_2_hul_model", "pool_length": 66, "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1_hul_model", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "linear", "name": "dense_1_hul_model", "trainable": true, "output_dim": 200, "activity_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1_hul_model", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1_hul_model", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "softmax", "name": "dense_2_hul_model", "trainable": true, "output_dim": 3, "activity_regularizer": null, "bias": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "init": "uniform", "W_regularizer": null, "input_dim": 428669, "input_length": 140, "mask_zero": false, "dropout": 0.2, "input_dtype": "int32", "trainable": true, "name": "embedding_1_semeval_model", "activity_regularizer": null, "output_dim": 52, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "activity_regularizer": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "input_length": null, "activation": "relu", "name": "convolution1d_1_semeval_model", "nb_filter": 200, "filter_length": 6, "trainable": true, "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_semeval_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "activity_regularizer": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "input_length": null, "activation": "relu", "name": "convolution1d_2_semeval_model", "nb_filter": 200, "filter_length": 6, "trainable": true, "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "name": "maxpooling1d_2_semeval_model", "pool_length": 66, "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1_semeval_model", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "linear", "name": "dense_1_semeval_model", "trainable": true, "output_dim": 200, "activity_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1_semeval_model", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1_semeval_model", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "softmax", "name": "dense_2_semeval_model", "trainable": true, "output_dim": 3, "activity_regularizer": null, "bias": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "init": "uniform", "W_regularizer": null, "input_dim": 1576890, "input_length": 140, "mask_zero": false, "dropout": 0.2, "input_dtype": "int32", "trainable": true, "name": "embedding_1_dil_model", "activity_regularizer": null, "output_dim": 52, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "activity_regularizer": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "input_length": null, "activation": "relu", "name": "convolution1d_1_dil_model", "nb_filter": 200, "filter_length": 6, "trainable": true, "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_dil_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "activity_regularizer": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "input_length": null, "activation": "relu", "name": "convolution1d_2_dil_model", "nb_filter": 200, "filter_length": 6, "trainable": true, "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "name": "maxpooling1d_2_dil_model", "pool_length": 66, "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dil_model", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "linear", "name": "dense_1_dil_model", "trainable": true, "output_dim": 200, "activity_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1_dil_model", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1_dil_model", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "softmax", "name": "dense_2_dil_model", "trainable": true, "output_dim": 3, "activity_regularizer": null, "bias": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "init": "uniform", "W_regularizer": null, "input_dim": 428669, "input_length": 140, "mask_zero": false, "dropout": 0.2, "input_dtype": "int32", "trainable": true, "name": "embedding_1_tac_model", "activity_regularizer": null, "output_dim": 52, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "activity_regularizer": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "input_length": null, "activation": "relu", "name": "convolution1d_1_tac_model", "nb_filter": 200, "filter_length": 6, "trainable": true, "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_tac_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "activity_regularizer": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "input_length": null, "activation": "relu", "name": "convolution1d_2_tac_model", "nb_filter": 200, "filter_length": 6, "trainable": true, "border_mode": "valid", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "name": "maxpooling1d_2_tac_model", "pool_length": 66, "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1_tac_model", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "linear", "name": "dense_1_tac_model", "trainable": true, "output_dim": 200, "activity_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1_tac_model", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1_tac_model", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "softmax", "name": "dense_2_tac_model", "trainable": true, "output_dim": 3, "activity_regularizer": null, "bias": true}}]}], "mode": "concat", "output_shape": null, "mode_type": "raw", "output_shape_type": "raw", "concat_axis": -1}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "linear", "name": "dense_1", "trainable": true, "output_dim": 256, "activity_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "softmax", "name": "dense_2", "trainable": true, "output_dim": 3, "activity_regularizer": null, "bias": true}}]}