{"keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"mode": "concat", "dot_axes": -1, "mode_type": "raw", "concat_axis": -1, "name": "merge_1", "output_shape_type": "raw", "output_shape": null, "layers": [{"class_name": "Sequential", "config": [{"config": {"W_regularizer": null, "trainable": true, "output_dim": 52, "init": "uniform", "dropout": 0.2, "input_dim": 1576890, "activity_regularizer": null, "batch_input_shape": [null, 140], "W_constraint": null, "input_dtype": "int32", "name": "embedding_1_dai_model", "input_length": 140, "mask_zero": false}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"W_regularizer": null, "trainable": true, "bias": true, "init": "uniform", "input_dim": null, "nb_filter": 200, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "subsample_length": 1, "filter_length": 6, "activation": "relu", "name": "convolution1d_1_dai_model", "b_constraint": null, "border_mode": "valid", "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_dai_model", "trainable": true, "stride": 2, "pool_length": 4, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"W_regularizer": null, "trainable": true, "bias": true, "init": "uniform", "input_dim": null, "nb_filter": 200, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "subsample_length": 1, "filter_length": 6, "activation": "relu", "name": "convolution1d_2_dai_model", "b_constraint": null, "border_mode": "valid", "input_length": null}, "class_name": "Convolution1D"}]}, {"class_name": "Sequential", "config": [{"config": {"W_regularizer": null, "trainable": true, "output_dim": 52, "init": "uniform", "dropout": 0.2, "input_dim": 428669, "activity_regularizer": null, "batch_input_shape": [null, 140], "W_constraint": null, "input_dtype": "int32", "name": "embedding_17_mpq_model", "input_length": 140, "mask_zero": false}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"W_regularizer": null, "trainable": true, "bias": true, "init": "uniform", "input_dim": null, "nb_filter": 200, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "subsample_length": 1, "filter_length": 6, "activation": "relu", "name": "convolution1d_33_mpq_model", "b_constraint": null, "border_mode": "valid", "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_33_mpq_model", "trainable": true, "stride": 2, "pool_length": 4, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"W_regularizer": null, "trainable": true, "bias": true, "init": "uniform", "input_dim": null, "nb_filter": 200, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "subsample_length": 1, "filter_length": 6, "activation": "relu", "name": "convolution1d_34_mpq_model", "b_constraint": null, "border_mode": "valid", "input_length": null}, "class_name": "Convolution1D"}]}, {"class_name": "Sequential", "config": [{"config": {"W_regularizer": null, "trainable": true, "output_dim": 52, "init": "uniform", "dropout": 0.2, "input_dim": 1576890, "activity_regularizer": null, "batch_input_shape": [null, 140], "W_constraint": null, "input_dtype": "int32", "name": "embedding_1_semeval_model", "input_length": 140, "mask_zero": false}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"W_regularizer": null, "trainable": true, "bias": true, "init": "uniform", "input_dim": null, "nb_filter": 200, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "subsample_length": 1, "filter_length": 6, "activation": "relu", "name": "convolution1d_1_semeval_model", "b_constraint": null, "border_mode": "valid", "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_semeval_model", "trainable": true, "stride": 2, "pool_length": 4, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"W_regularizer": null, "trainable": true, "bias": true, "init": "uniform", "input_dim": null, "nb_filter": 200, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "subsample_length": 1, "filter_length": 6, "activation": "relu", "name": "convolution1d_2_semeval_model", "b_constraint": null, "border_mode": "valid", "input_length": null}, "class_name": "Convolution1D"}]}, {"class_name": "Sequential", "config": [{"config": {"W_regularizer": null, "trainable": true, "output_dim": 52, "init": "uniform", "dropout": 0.2, "input_dim": 428669, "activity_regularizer": null, "batch_input_shape": [null, 140], "W_constraint": null, "input_dtype": "int32", "name": "embedding_1_tac_model", "input_length": 140, "mask_zero": false}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"W_regularizer": null, "trainable": true, "bias": true, "init": "uniform", "input_dim": null, "nb_filter": 200, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "subsample_length": 1, "filter_length": 6, "activation": "relu", "name": "convolution1d_1_tac_model", "b_constraint": null, "border_mode": "valid", "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_tac_model", "trainable": true, "stride": 2, "pool_length": 4, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"W_regularizer": null, "trainable": true, "bias": true, "init": "uniform", "input_dim": null, "nb_filter": 200, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "subsample_length": 1, "filter_length": 6, "activation": "relu", "name": "convolution1d_2_tac_model", "b_constraint": null, "border_mode": "valid", "input_length": null}, "class_name": "Convolution1D"}]}]}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"W_regularizer": null, "trainable": true, "bias": true, "init": "uniform", "input_dim": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "nb_filter": 200, "subsample_length": 1, "filter_length": 6, "activation": "relu", "name": "convolution1d_1", "b_constraint": null, "border_mode": "valid", "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "output_dim": 200, "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "name": "dense_1", "b_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "output_dim": 3, "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "activation": "softmax", "name": "dense_2", "b_constraint": null, "bias": true}}], "class_name": "Sequential"}