{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"mode": "concat", "mode_type": "raw", "name": "merge_1", "dot_axes": -1, "output_shape_type": "raw", "output_shape": null, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "W_constraint": null, "input_dim": 1062158, "W_regularizer": null, "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "output_dim": 52, "mask_zero": false, "name": "embedding_1_hul_model", "trainable": true, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "input_length": null, "nb_filter": 200, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "filter_length": 6, "border_mode": "valid", "name": "convolution1d_1_hul_model", "W_constraint": null, "bias": true, "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_hul_model", "stride": 2, "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "input_length": null, "nb_filter": 200, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "filter_length": 6, "border_mode": "valid", "name": "convolution1d_2_hul_model", "W_constraint": null, "bias": true, "activation": "relu", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "W_constraint": null, "input_dim": 428669, "W_regularizer": null, "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "output_dim": 52, "mask_zero": false, "name": "embedding_17_mpq_model", "trainable": true, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "input_length": null, "nb_filter": 200, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "filter_length": 6, "border_mode": "valid", "name": "convolution1d_33_mpq_model", "W_constraint": null, "bias": true, "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "stride": 2, "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "input_length": null, "nb_filter": 200, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "filter_length": 6, "border_mode": "valid", "name": "convolution1d_34_mpq_model", "W_constraint": null, "bias": true, "activation": "relu", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "W_constraint": null, "input_dim": 1576890, "W_regularizer": null, "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "output_dim": 52, "mask_zero": false, "name": "embedding_1_semeval_model", "trainable": true, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "input_length": null, "nb_filter": 200, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "filter_length": 6, "border_mode": "valid", "name": "convolution1d_1_semeval_model", "W_constraint": null, "bias": true, "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "stride": 2, "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "input_length": null, "nb_filter": 200, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "filter_length": 6, "border_mode": "valid", "name": "convolution1d_2_semeval_model", "W_constraint": null, "bias": true, "activation": "relu", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "W_constraint": null, "input_dim": 428669, "W_regularizer": null, "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "output_dim": 52, "mask_zero": false, "name": "embedding_1_tac_model", "trainable": true, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "input_length": null, "nb_filter": 200, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "filter_length": 6, "border_mode": "valid", "name": "convolution1d_1_tac_model", "W_constraint": null, "bias": true, "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_tac_model", "stride": 2, "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "input_length": null, "nb_filter": 200, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "filter_length": 6, "border_mode": "valid", "name": "convolution1d_2_tac_model", "W_constraint": null, "bias": true, "activation": "relu", "trainable": true}}]}], "concat_axis": -1}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1", "stride": 2, "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "input_length": null, "nb_filter": 200, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "filter_length": 6, "border_mode": "valid", "name": "convolution1d_1", "W_constraint": null, "bias": true, "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_2", "stride": 2, "trainable": true, "pool_length": 4}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 200, "W_constraint": null, "name": "dense_1", "bias": true, "activation": "linear", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 3, "W_constraint": null, "name": "dense_2", "bias": true, "activation": "softmax", "trainable": true}}], "keras_version": "1.1.1"}