{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"mode": "concat", "dot_axes": -1, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "dropout": 0.2, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140], "mask_zero": false, "name": "embedding_1_dai_model", "input_dtype": "int32", "input_length": 140, "trainable": true, "output_dim": 52, "input_dim": 1576890}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "bias": true, "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "name": "convolution1d_1_dai_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "activation": "relu", "trainable": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_dai_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "bias": true, "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "name": "convolution1d_2_dai_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "activation": "relu", "trainable": true, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "dropout": 0.2, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140], "mask_zero": false, "name": "embedding_1_dil_model", "input_dtype": "int32", "input_length": 140, "trainable": true, "output_dim": 52, "input_dim": 1576890}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "bias": true, "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "name": "convolution1d_1_dil_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "activation": "relu", "trainable": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_dil_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "bias": true, "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "name": "convolution1d_2_dil_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "activation": "relu", "trainable": true, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "dropout": 0.2, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140], "mask_zero": false, "name": "embedding_17_mpq_model", "input_dtype": "int32", "input_length": 140, "trainable": true, "output_dim": 52, "input_dim": 428669}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "bias": true, "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "name": "convolution1d_33_mpq_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "activation": "relu", "trainable": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "bias": true, "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "name": "convolution1d_34_mpq_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "activation": "relu", "trainable": true, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "dropout": 0.2, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140], "mask_zero": false, "name": "embedding_1_semeval_model", "input_dtype": "int32", "input_length": 140, "trainable": true, "output_dim": 52, "input_dim": 428669}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "bias": true, "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "name": "convolution1d_1_semeval_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "activation": "relu", "trainable": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "bias": true, "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "name": "convolution1d_2_semeval_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "activation": "relu", "trainable": true, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "dropout": 0.2, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140], "mask_zero": false, "name": "embedding_1_hul_model", "input_dtype": "int32", "input_length": 140, "trainable": true, "output_dim": 52, "input_dim": 1062158}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "bias": true, "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "name": "convolution1d_1_hul_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "activation": "relu", "trainable": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_hul_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "bias": true, "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "name": "convolution1d_2_hul_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "activation": "relu", "trainable": true, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "dropout": 0.2, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140], "mask_zero": false, "name": "embedding_1_tac_model", "input_dtype": "int32", "input_length": 140, "trainable": true, "output_dim": 52, "input_dim": 428669}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "bias": true, "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "name": "convolution1d_1_tac_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "activation": "relu", "trainable": true, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_tac_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "bias": true, "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "init": "uniform", "b_regularizer": null, "name": "convolution1d_2_tac_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "activation": "relu", "trainable": true, "input_length": null}}]}], "concat_axis": -1, "mode_type": "raw", "output_shape_type": "raw", "name": "merge_1", "output_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_1", "input_dim": null, "b_constraint": null, "activation": "linear", "trainable": true, "output_dim": 200}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_2", "input_dim": null, "b_constraint": null, "activation": "softmax", "trainable": true, "output_dim": 3}}]}