{"config": [{"config": {"dot_axes": -1, "mode": "concat", "name": "merge_1", "output_shape": null, "mode_type": "raw", "layers": [{"config": [{"config": {"init": "uniform", "W_constraint": null, "name": "embedding_1_semeval_model", "dropout": 0.2, "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 140], "output_dim": 52, "input_length": 140, "input_dim": 428669, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_semeval_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "name": "convolution1d_1_semeval_model", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "nb_filter": 200, "b_regularizer": null, "input_length": null, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "trainable": true, "name": "maxpooling1d_1_semeval_model", "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "name": "convolution1d_2_semeval_model", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "nb_filter": 200, "b_regularizer": null, "input_length": null, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "input_dim": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "W_constraint": null, "name": "embedding_1_tac_model", "dropout": 0.2, "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 140], "output_dim": 52, "input_length": 140, "input_dim": 428669, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_tac_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "name": "convolution1d_1_tac_model", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "nb_filter": 200, "b_regularizer": null, "input_length": null, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "trainable": true, "name": "maxpooling1d_1_tac_model", "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "name": "convolution1d_2_tac_model", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "nb_filter": 200, "b_regularizer": null, "input_length": null, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "input_dim": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "W_constraint": null, "name": "embedding_17_mpq_model", "dropout": 0.2, "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 140], "output_dim": 52, "input_length": 140, "input_dim": 428669, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_17_mpq_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "name": "convolution1d_33_mpq_model", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "nb_filter": 200, "b_regularizer": null, "input_length": null, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "trainable": true, "name": "maxpooling1d_33_mpq_model", "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "name": "convolution1d_34_mpq_model", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "nb_filter": 200, "b_regularizer": null, "input_length": null, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "input_dim": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "W_constraint": null, "name": "embedding_1_hul_model", "dropout": 0.2, "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 140], "output_dim": 52, "input_length": 140, "input_dim": 1062158, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_hul_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "name": "convolution1d_1_hul_model", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "nb_filter": 200, "b_regularizer": null, "input_length": null, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "trainable": true, "name": "maxpooling1d_1_hul_model", "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "name": "convolution1d_2_hul_model", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "nb_filter": 200, "b_regularizer": null, "input_length": null, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "input_dim": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "W_constraint": null, "name": "embedding_1_dai_model", "dropout": 0.2, "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 140], "output_dim": 52, "input_length": 140, "input_dim": 1576890, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_dai_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "name": "convolution1d_1_dai_model", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "nb_filter": 200, "b_regularizer": null, "input_length": null, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "trainable": true, "name": "maxpooling1d_1_dai_model", "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "name": "convolution1d_2_dai_model", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "nb_filter": 200, "b_regularizer": null, "input_length": null, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "input_dim": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "W_constraint": null, "name": "embedding_1_dil_model", "dropout": 0.2, "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 140], "output_dim": 52, "input_length": 140, "input_dim": 1576890, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_dil_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "name": "convolution1d_1_dil_model", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "nb_filter": 200, "b_regularizer": null, "input_length": null, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "input_dim": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "trainable": true, "name": "maxpooling1d_1_dil_model", "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "name": "convolution1d_2_dil_model", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "nb_filter": 200, "b_regularizer": null, "input_length": null, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "input_dim": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}], "concat_axis": -1, "output_shape_type": "raw"}, "class_name": "Merge"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "name": "dense_1", "activation": "linear", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "output_dim": 200, "b_regularizer": null, "input_dim": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "name": "dense_2", "activation": "softmax", "b_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "output_dim": 3, "b_regularizer": null, "input_dim": null, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}