{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 1062158, "batch_input_shape": [null, 140], "mask_zero": false, "input_dtype": "int32", "init": "uniform", "name": "embedding_1", "input_length": 140, "W_constraint": null, "activity_regularizer": null, "dropout": 0.2, "output_dim": 52, "W_regularizer": null, "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "filter_length": 6, "init": "uniform", "activity_regularizer": null, "input_length": null, "b_constraint": null, "W_constraint": null, "subsample_length": 1, "name": "convolution1d_1", "activation": "relu", "b_regularizer": null, "nb_filter": 200, "W_regularizer": null, "border_mode": "valid", "trainable": true, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1", "pool_length": 4, "border_mode": "valid", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "filter_length": 6, "init": "uniform", "activity_regularizer": null, "input_length": null, "b_constraint": null, "W_constraint": null, "subsample_length": 1, "name": "convolution1d_2", "activation": "relu", "b_regularizer": null, "nb_filter": 200, "W_regularizer": null, "border_mode": "valid", "trainable": true, "bias": true}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2", "pool_length": 66, "border_mode": "valid", "trainable": true, "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "name": "dense_1", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "output_dim": 200, "b_regularizer": null, "W_regularizer": null, "trainable": true, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "name": "dense_2", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "activation": "softmax", "output_dim": 3, "b_regularizer": null, "W_regularizer": null, "trainable": true, "bias": true}}], "keras_version": "1.1.1"}