{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "W_regularizer": null, "init": "uniform", "mask_zero": false, "input_dim": 1576890, "batch_input_shape": [null, 140], "trainable": true, "input_dtype": "int32", "input_length": 140, "W_constraint": null, "activity_regularizer": null, "dropout": 0.2, "name": "embedding_1_semeval_model"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "activation": "relu", "input_length": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 200, "name": "convolution1d_1_semeval_model"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "activation": "relu", "input_length": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 200, "name": "convolution1d_2_semeval_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "W_regularizer": null, "init": "uniform", "mask_zero": false, "input_dim": 428669, "batch_input_shape": [null, 140], "trainable": true, "input_dtype": "int32", "input_length": 140, "W_constraint": null, "activity_regularizer": null, "dropout": 0.2, "name": "embedding_1_tac_model"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_tac_model"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "activation": "relu", "input_length": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 200, "name": "convolution1d_1_tac_model"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_tac_model"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "activation": "relu", "input_length": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 200, "name": "convolution1d_2_tac_model"}}]}], "mode": "concat", "output_shape": null, "mode_type": "raw", "output_shape_type": "raw", "concat_axis": -1, "dot_axes": -1}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "W_regularizer": null, "init": "uniform", "W_constraint": null, "filter_length": 6, "input_dim": null, "b_constraint": null, "trainable": true, "activation": "relu", "input_length": null, "activity_regularizer": null, "bias": true, "b_regularizer": null, "border_mode": "valid", "nb_filter": 200, "name": "convolution1d_1"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 200, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "bias": true, "b_regularizer": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"output_dim": 3, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "b_constraint": null, "trainable": true, "activation": "softmax", "activity_regularizer": null, "bias": true, "b_regularizer": null, "name": "dense_2"}}]}