{"config": [{"class_name": "Merge", "config": {"mode_type": "raw", "name": "merge_1", "mode": "concat", "output_shape": null, "concat_axis": -1, "layers": [{"class_name": "Sequential", "config": [{"config": {"dropout": 0.2, "batch_input_shape": [null, 140], "input_length": 140, "input_dtype": "int32", "activity_regularizer": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "input_dim": 1576890, "output_dim": 52, "name": "embedding_1_dai_model", "mask_zero": false}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "activation": "relu", "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "b_regularizer": null, "input_length": null, "name": "convolution1d_1_dai_model", "b_constraint": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_dai_model", "stride": 2, "trainable": true, "pool_length": 4, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "activation": "relu", "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "b_regularizer": null, "input_length": null, "name": "convolution1d_2_dai_model", "b_constraint": null}, "class_name": "Convolution1D"}]}, {"class_name": "Sequential", "config": [{"config": {"dropout": 0.2, "batch_input_shape": [null, 140], "input_length": 140, "input_dtype": "int32", "activity_regularizer": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "input_dim": 1576890, "output_dim": 52, "name": "embedding_1_dil_model", "mask_zero": false}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "activation": "relu", "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "b_regularizer": null, "input_length": null, "name": "convolution1d_1_dil_model", "b_constraint": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_dil_model", "stride": 2, "trainable": true, "pool_length": 4, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "activation": "relu", "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "b_regularizer": null, "input_length": null, "name": "convolution1d_2_dil_model", "b_constraint": null}, "class_name": "Convolution1D"}]}, {"class_name": "Sequential", "config": [{"config": {"dropout": 0.2, "batch_input_shape": [null, 140], "input_length": 140, "input_dtype": "int32", "activity_regularizer": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "input_dim": 1062158, "output_dim": 52, "name": "embedding_1_hul_model", "mask_zero": false}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "activation": "relu", "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "b_regularizer": null, "input_length": null, "name": "convolution1d_1_hul_model", "b_constraint": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_hul_model", "stride": 2, "trainable": true, "pool_length": 4, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "activation": "relu", "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "b_regularizer": null, "input_length": null, "name": "convolution1d_2_hul_model", "b_constraint": null}, "class_name": "Convolution1D"}]}, {"class_name": "Sequential", "config": [{"config": {"dropout": 0.2, "batch_input_shape": [null, 140], "input_length": 140, "input_dtype": "int32", "activity_regularizer": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "input_dim": 428669, "output_dim": 52, "name": "embedding_17_mpq_model", "mask_zero": false}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "activation": "relu", "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "b_regularizer": null, "input_length": null, "name": "convolution1d_33_mpq_model", "b_constraint": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_33_mpq_model", "stride": 2, "trainable": true, "pool_length": 4, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "activation": "relu", "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "b_regularizer": null, "input_length": null, "name": "convolution1d_34_mpq_model", "b_constraint": null}, "class_name": "Convolution1D"}]}, {"class_name": "Sequential", "config": [{"config": {"dropout": 0.2, "batch_input_shape": [null, 140], "input_length": 140, "input_dtype": "int32", "activity_regularizer": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "input_dim": 428669, "output_dim": 52, "name": "embedding_1_semeval_model", "mask_zero": false}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "activation": "relu", "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "b_regularizer": null, "input_length": null, "name": "convolution1d_1_semeval_model", "b_constraint": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_semeval_model", "stride": 2, "trainable": true, "pool_length": 4, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "activation": "relu", "filter_length": 6, "subsample_length": 1, "activity_regularizer": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "b_regularizer": null, "input_length": null, "name": "convolution1d_2_semeval_model", "b_constraint": null}, "class_name": "Convolution1D"}]}], "dot_axes": -1, "output_shape_type": "raw"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "output_dim": 200, "name": "dense_1", "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "softmax", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "output_dim": 3, "name": "dense_2", "b_constraint": null}}], "class_name": "Sequential", "keras_version": "1.1.1"}