{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "name": "embedding_13", "input_dtype": "int32", "mask_zero": false, "output_dim": 52, "batch_input_shape": [null, 140], "dropout": 0.2, "activity_regularizer": null, "input_dim": 428669, "W_regularizer": null, "W_constraint": null, "init": "uniform", "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_13"}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "input_length": null, "activation": "relu", "nb_filter": 200, "filter_length": 6, "name": "convolution1d_25", "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "bias": true, "W_constraint": null, "init": "uniform", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "stride": 2, "trainable": true, "name": "maxpooling1d_25", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "input_length": null, "activation": "relu", "nb_filter": 200, "filter_length": 6, "name": "convolution1d_26", "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "bias": true, "W_constraint": null, "init": "uniform", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "stride": 66, "trainable": true, "name": "maxpooling1d_26", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_13", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "linear", "name": "dense_25", "output_dim": 200, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_13", "p": 0.2}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "softmax", "name": "dense_26", "output_dim": 3, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "trainable": true}}]}