{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "output_dim": 52, "batch_input_shape": [null, 140], "name": "embedding_17_mpq_model", "input_length": 140, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dtype": "int32", "dropout": 0.2, "mask_zero": false, "input_dim": 428669, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_17_mpq_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "filter_length": 6, "W_regularizer": null, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample_length": 1, "activation": "relu", "nb_filter": 200, "name": "convolution1d_33_mpq_model", "input_dim": null, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_33_mpq_model", "pool_length": 4, "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "filter_length": 6, "W_regularizer": null, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample_length": 1, "activation": "relu", "nb_filter": 200, "name": "convolution1d_34_mpq_model", "input_dim": null, "b_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "output_dim": 52, "batch_input_shape": [null, 140], "name": "embedding_1_hul_model", "input_length": 140, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dtype": "int32", "dropout": 0.2, "mask_zero": false, "input_dim": 1062158, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "filter_length": 6, "W_regularizer": null, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample_length": 1, "activation": "relu", "nb_filter": 200, "name": "convolution1d_1_hul_model", "input_dim": null, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_hul_model", "pool_length": 4, "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "filter_length": 6, "W_regularizer": null, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample_length": 1, "activation": "relu", "nb_filter": 200, "name": "convolution1d_2_hul_model", "input_dim": null, "b_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "output_dim": 52, "batch_input_shape": [null, 140], "name": "embedding_1_dai_model", "input_length": 140, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dtype": "int32", "dropout": 0.2, "mask_zero": false, "input_dim": 1576890, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dai_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "filter_length": 6, "W_regularizer": null, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample_length": 1, "activation": "relu", "nb_filter": 200, "name": "convolution1d_1_dai_model", "input_dim": null, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dai_model", "pool_length": 4, "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "filter_length": 6, "W_regularizer": null, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample_length": 1, "activation": "relu", "nb_filter": 200, "name": "convolution1d_2_dai_model", "input_dim": null, "b_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "output_dim": 52, "batch_input_shape": [null, 140], "name": "embedding_1_semeval_model", "input_length": 140, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dtype": "int32", "dropout": 0.2, "mask_zero": false, "input_dim": 428669, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "filter_length": 6, "W_regularizer": null, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample_length": 1, "activation": "relu", "nb_filter": 200, "name": "convolution1d_1_semeval_model", "input_dim": null, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_semeval_model", "pool_length": 4, "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "filter_length": 6, "W_regularizer": null, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample_length": 1, "activation": "relu", "nb_filter": 200, "name": "convolution1d_2_semeval_model", "input_dim": null, "b_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "output_dim": 52, "batch_input_shape": [null, 140], "name": "embedding_1_dil_model", "input_length": 140, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dtype": "int32", "dropout": 0.2, "mask_zero": false, "input_dim": 1576890, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dil_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "filter_length": 6, "W_regularizer": null, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample_length": 1, "activation": "relu", "nb_filter": 200, "name": "convolution1d_1_dil_model", "input_dim": null, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dil_model", "pool_length": 4, "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "filter_length": 6, "W_regularizer": null, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample_length": 1, "activation": "relu", "nb_filter": 200, "name": "convolution1d_2_dil_model", "input_dim": null, "b_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "output_dim": 52, "batch_input_shape": [null, 140], "name": "embedding_1_tac_model", "input_length": 140, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dtype": "int32", "dropout": 0.2, "mask_zero": false, "input_dim": 428669, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "filter_length": 6, "W_regularizer": null, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample_length": 1, "activation": "relu", "nb_filter": 200, "name": "convolution1d_1_tac_model", "input_dim": null, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_tac_model", "pool_length": 4, "trainable": true, "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "init": "uniform", "filter_length": 6, "W_regularizer": null, "b_constraint": null, "input_length": null, "bias": true, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample_length": 1, "activation": "relu", "nb_filter": 200, "name": "convolution1d_2_tac_model", "input_dim": null, "b_regularizer": null}}]}], "mode": "concat", "dot_axes": -1, "output_shape": null, "concat_axis": -1, "name": "merge_1", "output_shape_type": "raw", "mode_type": "raw"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_1", "bias": true, "activity_regularizer": null, "trainable": true, "activation": "linear", "output_dim": 200, "b_constraint": null, "input_dim": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_2", "bias": true, "activity_regularizer": null, "trainable": true, "activation": "softmax", "output_dim": 3, "b_constraint": null, "input_dim": null, "b_regularizer": null}}]}