{"config": [{"config": {"name": "merge_10", "mode": "concat", "mode_type": "raw", "output_shape": null, "dot_axes": -1, "concat_axis": -1, "layers": [{"config": [{"config": {"name": "embedding_1_dai_model", "output_dim": 52, "trainable": true, "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "batch_input_shape": [null, 140], "activity_regularizer": null, "mask_zero": false, "input_dim": 1576890, "input_length": 140, "W_constraint": null, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"name": "convolution1d_1_dai_model", "W_constraint": null, "trainable": true, "filter_length": 6, "bias": true, "subsample_length": 1, "nb_filter": 200, "border_mode": "valid", "b_constraint": null, "init": "uniform", "input_dim": null, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_dai_model", "border_mode": "valid", "trainable": true, "pool_length": 4, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"name": "convolution1d_2_dai_model", "W_constraint": null, "trainable": true, "filter_length": 6, "bias": true, "subsample_length": 1, "nb_filter": 200, "border_mode": "valid", "b_constraint": null, "init": "uniform", "input_dim": null, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_2_dai_model", "border_mode": "valid", "trainable": true, "pool_length": 66, "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_dai_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"name": "embedding_1_semeval_model", "output_dim": 52, "trainable": true, "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "batch_input_shape": [null, 140], "activity_regularizer": null, "mask_zero": false, "input_dim": 428669, "input_length": 140, "W_constraint": null, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"name": "convolution1d_1_semeval_model", "W_constraint": null, "trainable": true, "filter_length": 6, "bias": true, "subsample_length": 1, "nb_filter": 200, "border_mode": "valid", "b_constraint": null, "init": "uniform", "input_dim": null, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_semeval_model", "border_mode": "valid", "trainable": true, "pool_length": 4, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"name": "convolution1d_2_semeval_model", "W_constraint": null, "trainable": true, "filter_length": 6, "bias": true, "subsample_length": 1, "nb_filter": 200, "border_mode": "valid", "b_constraint": null, "init": "uniform", "input_dim": null, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_2_semeval_model", "border_mode": "valid", "trainable": true, "pool_length": 66, "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_semeval_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}, {"config": [{"config": {"name": "embedding_1_tac_model", "output_dim": 52, "trainable": true, "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "batch_input_shape": [null, 140], "activity_regularizer": null, "mask_zero": false, "input_dim": 428669, "input_length": 140, "W_constraint": null, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"name": "convolution1d_1_tac_model", "W_constraint": null, "trainable": true, "filter_length": 6, "bias": true, "subsample_length": 1, "nb_filter": 200, "border_mode": "valid", "b_constraint": null, "init": "uniform", "input_dim": null, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_tac_model", "border_mode": "valid", "trainable": true, "pool_length": 4, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"name": "convolution1d_2_tac_model", "W_constraint": null, "trainable": true, "filter_length": 6, "bias": true, "subsample_length": 1, "nb_filter": 200, "border_mode": "valid", "b_constraint": null, "init": "uniform", "input_dim": null, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_2_tac_model", "border_mode": "valid", "trainable": true, "pool_length": 66, "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_tac_model", "trainable": true}, "class_name": "Flatten"}], "class_name": "Sequential"}], "output_shape_type": "raw"}, "class_name": "Merge"}, {"config": {"name": "dense_19", "W_constraint": null, "trainable": true, "bias": true, "output_dim": 1028, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dense_20", "W_constraint": null, "trainable": true, "bias": true, "output_dim": 3, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "activation": "softmax", "b_regularizer": null, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}