{"keras_version": "1.1.1", "config": [{"config": {"batch_input_shape": [null, 140], "name": "embedding_1", "mask_zero": false, "activity_regularizer": null, "input_dim": 428669, "init": "uniform", "W_constraint": null, "output_dim": 52, "W_regularizer": null, "dropout": 0.2, "input_dtype": "int32", "trainable": true, "input_length": 140}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"border_mode": "valid", "b_regularizer": null, "bias": true, "activation": "relu", "subsample_length": 1, "activity_regularizer": null, "input_dim": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "filter_length": 6, "input_length": null, "name": "convolution1d_1", "trainable": true, "b_constraint": null, "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "trainable": true, "name": "maxpooling1d_1", "border_mode": "valid", "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"border_mode": "valid", "b_regularizer": null, "bias": true, "activation": "relu", "subsample_length": 1, "activity_regularizer": null, "input_dim": null, "init": "uniform", "W_constraint": null, "W_regularizer": null, "filter_length": 6, "input_length": null, "name": "convolution1d_2", "trainable": true, "b_constraint": null, "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"stride": 66, "trainable": true, "name": "maxpooling1d_2", "border_mode": "valid", "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dense_1", "bias": true, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "W_constraint": null, "output_dim": 200, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "b_constraint": null}, "class_name": "Dense"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dense_2", "bias": true, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "W_constraint": null, "output_dim": 3, "W_regularizer": null, "b_regularizer": null, "activation": "softmax", "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}