{"config": [{"config": {"W_regularizer": null, "W_constraint": null, "name": "embedding_17", "input_dim": 428669, "batch_input_shape": [null, 140], "input_dtype": "int32", "mask_zero": false, "trainable": true, "dropout": 0.2, "output_dim": 52, "input_length": 140, "init": "uniform", "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_17", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"W_constraint": null, "W_regularizer": null, "filter_length": 6, "bias": true, "input_dim": null, "init": "uniform", "activation": "relu", "border_mode": "valid", "subsample_length": 1, "name": "convolution1d_33", "trainable": true, "b_constraint": null, "input_length": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_33", "pool_length": 4, "trainable": true, "border_mode": "valid", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"W_constraint": null, "W_regularizer": null, "filter_length": 6, "bias": true, "input_dim": null, "init": "uniform", "activation": "relu", "border_mode": "valid", "subsample_length": 1, "name": "convolution1d_34", "trainable": true, "b_constraint": null, "input_length": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_34", "pool_length": 66, "trainable": true, "border_mode": "valid", "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_17", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "W_constraint": null, "name": "dense_33", "bias": true, "input_dim": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "b_constraint": null, "output_dim": 200, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_17", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_17", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "W_constraint": null, "name": "dense_34", "bias": true, "input_dim": null, "init": "glorot_uniform", "activation": "softmax", "trainable": true, "b_constraint": null, "output_dim": 3, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}