{"config": [{"config": {"name": "merge_1", "layers": [{"config": [{"config": {"input_dim": 1576890, "input_length": 140, "trainable": true, "mask_zero": false, "W_regularizer": null, "output_dim": 52, "W_constraint": null, "input_dtype": "int32", "activity_regularizer": null, "name": "embedding_1_dai_model", "batch_input_shape": [null, 140], "init": "uniform", "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "W_regularizer": null, "trainable": true, "activation": "relu", "subsample_length": 1, "filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "W_constraint": null, "name": "convolution1d_1_dai_model", "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "name": "maxpooling1d_1_dai_model", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "W_regularizer": null, "trainable": true, "activation": "relu", "subsample_length": 1, "filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "W_constraint": null, "name": "convolution1d_2_dai_model", "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dim": 1576890, "input_length": 140, "trainable": true, "mask_zero": false, "W_regularizer": null, "output_dim": 52, "W_constraint": null, "input_dtype": "int32", "activity_regularizer": null, "name": "embedding_1_dil_model", "batch_input_shape": [null, 140], "init": "uniform", "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "W_regularizer": null, "trainable": true, "activation": "relu", "subsample_length": 1, "filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "W_constraint": null, "name": "convolution1d_1_dil_model", "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "name": "maxpooling1d_1_dil_model", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "W_regularizer": null, "trainable": true, "activation": "relu", "subsample_length": 1, "filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "W_constraint": null, "name": "convolution1d_2_dil_model", "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dim": 1062158, "input_length": 140, "trainable": true, "mask_zero": false, "W_regularizer": null, "output_dim": 52, "W_constraint": null, "input_dtype": "int32", "activity_regularizer": null, "name": "embedding_1_hul_model", "batch_input_shape": [null, 140], "init": "uniform", "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "W_regularizer": null, "trainable": true, "activation": "relu", "subsample_length": 1, "filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "W_constraint": null, "name": "convolution1d_1_hul_model", "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "name": "maxpooling1d_1_hul_model", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "W_regularizer": null, "trainable": true, "activation": "relu", "subsample_length": 1, "filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "W_constraint": null, "name": "convolution1d_2_hul_model", "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dim": 428669, "input_length": 140, "trainable": true, "mask_zero": false, "W_regularizer": null, "output_dim": 52, "W_constraint": null, "input_dtype": "int32", "activity_regularizer": null, "name": "embedding_17_mpq_model", "batch_input_shape": [null, 140], "init": "uniform", "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "W_regularizer": null, "trainable": true, "activation": "relu", "subsample_length": 1, "filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "W_constraint": null, "name": "convolution1d_33_mpq_model", "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "name": "maxpooling1d_33_mpq_model", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "W_regularizer": null, "trainable": true, "activation": "relu", "subsample_length": 1, "filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "W_constraint": null, "name": "convolution1d_34_mpq_model", "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dim": 428669, "input_length": 140, "trainable": true, "mask_zero": false, "W_regularizer": null, "output_dim": 52, "W_constraint": null, "input_dtype": "int32", "activity_regularizer": null, "name": "embedding_1_semeval_model", "batch_input_shape": [null, 140], "init": "uniform", "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "W_regularizer": null, "trainable": true, "activation": "relu", "subsample_length": 1, "filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "W_constraint": null, "name": "convolution1d_1_semeval_model", "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "name": "maxpooling1d_1_semeval_model", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "W_regularizer": null, "trainable": true, "activation": "relu", "subsample_length": 1, "filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "W_constraint": null, "name": "convolution1d_2_semeval_model", "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dim": 428669, "input_length": 140, "trainable": true, "mask_zero": false, "W_regularizer": null, "output_dim": 52, "W_constraint": null, "input_dtype": "int32", "activity_regularizer": null, "name": "embedding_1_tac_model", "batch_input_shape": [null, 140], "init": "uniform", "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "W_regularizer": null, "trainable": true, "activation": "relu", "subsample_length": 1, "filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "W_constraint": null, "name": "convolution1d_1_tac_model", "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "pool_length": 4, "name": "maxpooling1d_1_tac_model", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "W_regularizer": null, "trainable": true, "activation": "relu", "subsample_length": 1, "filter_length": 6, "b_constraint": null, "input_length": null, "bias": true, "W_constraint": null, "name": "convolution1d_2_tac_model", "activity_regularizer": null, "init": "uniform", "nb_filter": 200, "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}], "output_shape": null, "mode": "concat", "output_shape_type": "raw", "mode_type": "raw", "dot_axes": -1, "concat_axis": -1}, "class_name": "Merge"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "bias": true, "output_dim": 200, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "bias": true, "output_dim": 3, "activation": "softmax", "name": "dense_2", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}