{"config": [{"config": {"concat_axis": -1, "mode": "concat", "name": "merge_1", "layers": [{"config": [{"config": {"dropout": 0.2, "input_dtype": "int32", "mask_zero": false, "input_dim": 428669, "W_constraint": null, "input_length": 140, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "name": "embedding_1_semeval_model", "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "input_dim": null, "trainable": true, "W_constraint": null, "subsample_length": 1, "filter_length": 6, "input_length": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "name": "convolution1d_1_semeval_model", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_semeval_model", "pool_length": 4, "border_mode": "valid", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "input_dim": null, "trainable": true, "W_constraint": null, "subsample_length": 1, "filter_length": 6, "input_length": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "name": "convolution1d_2_semeval_model", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"dropout": 0.2, "input_dtype": "int32", "mask_zero": false, "input_dim": 1576890, "W_constraint": null, "input_length": 140, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "name": "embedding_1_dil_model", "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "input_dim": null, "trainable": true, "W_constraint": null, "subsample_length": 1, "filter_length": 6, "input_length": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "name": "convolution1d_1_dil_model", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_dil_model", "pool_length": 4, "border_mode": "valid", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "input_dim": null, "trainable": true, "W_constraint": null, "subsample_length": 1, "filter_length": 6, "input_length": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "name": "convolution1d_2_dil_model", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"dropout": 0.2, "input_dtype": "int32", "mask_zero": false, "input_dim": 428669, "W_constraint": null, "input_length": 140, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "name": "embedding_17_mpq_model", "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "input_dim": null, "trainable": true, "W_constraint": null, "subsample_length": 1, "filter_length": 6, "input_length": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "name": "convolution1d_33_mpq_model", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_33_mpq_model", "pool_length": 4, "border_mode": "valid", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "input_dim": null, "trainable": true, "W_constraint": null, "subsample_length": 1, "filter_length": 6, "input_length": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "name": "convolution1d_34_mpq_model", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"dropout": 0.2, "input_dtype": "int32", "mask_zero": false, "input_dim": 1062158, "W_constraint": null, "input_length": 140, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "name": "embedding_1_hul_model", "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "input_dim": null, "trainable": true, "W_constraint": null, "subsample_length": 1, "filter_length": 6, "input_length": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "name": "convolution1d_1_hul_model", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_hul_model", "pool_length": 4, "border_mode": "valid", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "input_dim": null, "trainable": true, "W_constraint": null, "subsample_length": 1, "filter_length": 6, "input_length": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "name": "convolution1d_2_hul_model", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"dropout": 0.2, "input_dtype": "int32", "mask_zero": false, "input_dim": 1576890, "W_constraint": null, "input_length": 140, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "name": "embedding_1_dai_model", "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "input_dim": null, "trainable": true, "W_constraint": null, "subsample_length": 1, "filter_length": 6, "input_length": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "name": "convolution1d_1_dai_model", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_dai_model", "pool_length": 4, "border_mode": "valid", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "input_dim": null, "trainable": true, "W_constraint": null, "subsample_length": 1, "filter_length": 6, "input_length": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "name": "convolution1d_2_dai_model", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"dropout": 0.2, "input_dtype": "int32", "mask_zero": false, "input_dim": 428669, "W_constraint": null, "input_length": 140, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "name": "embedding_1_tac_model", "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "input_dim": null, "trainable": true, "W_constraint": null, "subsample_length": 1, "filter_length": 6, "input_length": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "name": "convolution1d_1_tac_model", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_tac_model", "pool_length": 4, "border_mode": "valid", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "input_dim": null, "trainable": true, "W_constraint": null, "subsample_length": 1, "filter_length": 6, "input_length": null, "init": "uniform", "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "name": "convolution1d_2_tac_model", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}], "output_shape": null, "dot_axes": -1, "mode_type": "raw", "output_shape_type": "raw"}, "class_name": "Merge"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "b_constraint": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "bias": true, "name": "dense_1", "output_dim": 200, "b_regularizer": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": null, "b_constraint": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "softmax", "bias": true, "name": "dense_2", "output_dim": 3, "b_regularizer": null, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}