{"config": [{"config": {"dot_axes": -1, "output_shape": null, "mode": "concat", "concat_axis": -1, "name": "merge_1", "output_shape_type": "raw", "layers": [{"config": [{"config": {"mask_zero": false, "W_constraint": null, "input_dtype": "int32", "dropout": 0.2, "batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "name": "embedding_1_tac_model", "input_dim": 428669, "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "filter_length": 6, "bias": true, "W_regularizer": null, "b_constraint": null, "input_length": null, "init": "uniform", "trainable": true, "activation": "relu", "activity_regularizer": null, "input_dim": null, "name": "convolution1d_1_tac_model", "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_tac_model", "stride": 2, "pool_length": 4, "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "filter_length": 6, "bias": true, "W_regularizer": null, "b_constraint": null, "input_length": null, "init": "uniform", "trainable": true, "activation": "relu", "activity_regularizer": null, "input_dim": null, "name": "convolution1d_2_tac_model", "subsample_length": 1}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"mask_zero": false, "W_constraint": null, "input_dtype": "int32", "dropout": 0.2, "batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "name": "embedding_1_dil_model", "input_dim": 1576890, "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "filter_length": 6, "bias": true, "W_regularizer": null, "b_constraint": null, "input_length": null, "init": "uniform", "trainable": true, "activation": "relu", "activity_regularizer": null, "input_dim": null, "name": "convolution1d_1_dil_model", "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_dil_model", "stride": 2, "pool_length": 4, "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "filter_length": 6, "bias": true, "W_regularizer": null, "b_constraint": null, "input_length": null, "init": "uniform", "trainable": true, "activation": "relu", "activity_regularizer": null, "input_dim": null, "name": "convolution1d_2_dil_model", "subsample_length": 1}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"mask_zero": false, "W_constraint": null, "input_dtype": "int32", "dropout": 0.2, "batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "name": "embedding_1_dai_model", "input_dim": 1576890, "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "filter_length": 6, "bias": true, "W_regularizer": null, "b_constraint": null, "input_length": null, "init": "uniform", "trainable": true, "activation": "relu", "activity_regularizer": null, "input_dim": null, "name": "convolution1d_1_dai_model", "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_dai_model", "stride": 2, "pool_length": 4, "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "filter_length": 6, "bias": true, "W_regularizer": null, "b_constraint": null, "input_length": null, "init": "uniform", "trainable": true, "activation": "relu", "activity_regularizer": null, "input_dim": null, "name": "convolution1d_2_dai_model", "subsample_length": 1}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"mask_zero": false, "W_constraint": null, "input_dtype": "int32", "dropout": 0.2, "batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "name": "embedding_17_mpq_model", "input_dim": 428669, "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "filter_length": 6, "bias": true, "W_regularizer": null, "b_constraint": null, "input_length": null, "init": "uniform", "trainable": true, "activation": "relu", "activity_regularizer": null, "input_dim": null, "name": "convolution1d_33_mpq_model", "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_33_mpq_model", "stride": 2, "pool_length": 4, "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "filter_length": 6, "bias": true, "W_regularizer": null, "b_constraint": null, "input_length": null, "init": "uniform", "trainable": true, "activation": "relu", "activity_regularizer": null, "input_dim": null, "name": "convolution1d_34_mpq_model", "subsample_length": 1}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"mask_zero": false, "W_constraint": null, "input_dtype": "int32", "dropout": 0.2, "batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "name": "embedding_1_hul_model", "input_dim": 1062158, "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "filter_length": 6, "bias": true, "W_regularizer": null, "b_constraint": null, "input_length": null, "init": "uniform", "trainable": true, "activation": "relu", "activity_regularizer": null, "input_dim": null, "name": "convolution1d_1_hul_model", "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_hul_model", "stride": 2, "pool_length": 4, "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "filter_length": 6, "bias": true, "W_regularizer": null, "b_constraint": null, "input_length": null, "init": "uniform", "trainable": true, "activation": "relu", "activity_regularizer": null, "input_dim": null, "name": "convolution1d_2_hul_model", "subsample_length": 1}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"mask_zero": false, "W_constraint": null, "input_dtype": "int32", "dropout": 0.2, "batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "name": "embedding_1_semeval_model", "input_dim": 428669, "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "filter_length": 6, "bias": true, "W_regularizer": null, "b_constraint": null, "input_length": null, "init": "uniform", "trainable": true, "activation": "relu", "activity_regularizer": null, "input_dim": null, "name": "convolution1d_1_semeval_model", "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_semeval_model", "stride": 2, "pool_length": 4, "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "border_mode": "valid", "W_constraint": null, "b_regularizer": null, "filter_length": 6, "bias": true, "W_regularizer": null, "b_constraint": null, "input_length": null, "init": "uniform", "trainable": true, "activation": "relu", "activity_regularizer": null, "input_dim": null, "name": "convolution1d_2_semeval_model", "subsample_length": 1}, "class_name": "Convolution1D"}], "class_name": "Sequential"}], "mode_type": "raw"}, "class_name": "Merge"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "name": "dense_1", "input_dim": null, "bias": true, "output_dim": 200, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activation": "softmax", "name": "dense_2", "input_dim": null, "bias": true, "output_dim": 3, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}