{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"mode_type": "raw", "output_shape": null, "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "concat_axis": -1, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "input_dtype": "int32", "mask_zero": false, "dropout": 0.2, "activity_regularizer": null, "W_constraint": null, "input_dim": 1576890, "input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_1_dil_model", "output_dim": 52, "init": "uniform", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dil_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "nb_filter": 200, "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "name": "convolution1d_1_dil_model", "filter_length": 6, "init": "uniform", "W_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_dil_model", "stride": 2, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "nb_filter": 200, "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "name": "convolution1d_2_dil_model", "filter_length": 6, "init": "uniform", "W_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "input_dtype": "int32", "mask_zero": false, "dropout": 0.2, "activity_regularizer": null, "W_constraint": null, "input_dim": 1062158, "input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_1_hul_model", "output_dim": 52, "init": "uniform", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "nb_filter": 200, "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "name": "convolution1d_1_hul_model", "filter_length": 6, "init": "uniform", "W_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_hul_model", "stride": 2, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "nb_filter": 200, "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "name": "convolution1d_2_hul_model", "filter_length": 6, "init": "uniform", "W_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "input_dtype": "int32", "mask_zero": false, "dropout": 0.2, "activity_regularizer": null, "W_constraint": null, "input_dim": 428669, "input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_17_mpq_model", "output_dim": 52, "init": "uniform", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_17_mpq_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "nb_filter": 200, "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "name": "convolution1d_33_mpq_model", "filter_length": 6, "init": "uniform", "W_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "stride": 2, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "nb_filter": 200, "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "name": "convolution1d_34_mpq_model", "filter_length": 6, "init": "uniform", "W_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "input_dtype": "int32", "mask_zero": false, "dropout": 0.2, "activity_regularizer": null, "W_constraint": null, "input_dim": 428669, "input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_1_semeval_model", "output_dim": 52, "init": "uniform", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "nb_filter": 200, "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "name": "convolution1d_1_semeval_model", "filter_length": 6, "init": "uniform", "W_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "stride": 2, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "nb_filter": 200, "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "name": "convolution1d_2_semeval_model", "filter_length": 6, "init": "uniform", "W_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "input_dtype": "int32", "mask_zero": false, "dropout": 0.2, "activity_regularizer": null, "W_constraint": null, "input_dim": 428669, "input_length": 140, "batch_input_shape": [null, 140], "name": "embedding_1_tac_model", "output_dim": 52, "init": "uniform", "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "nb_filter": 200, "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "name": "convolution1d_1_tac_model", "filter_length": 6, "init": "uniform", "W_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_tac_model", "stride": 2, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "nb_filter": 200, "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "name": "convolution1d_2_tac_model", "filter_length": 6, "init": "uniform", "W_regularizer": null}}]}], "name": "merge_1"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "name": "dense_1", "activity_regularizer": null, "output_dim": 200, "activation": "linear", "input_dim": null, "b_constraint": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "name": "dense_2", "activity_regularizer": null, "output_dim": 3, "activation": "softmax", "input_dim": null, "b_constraint": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null}}], "keras_version": "1.1.1"}