{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"init": "uniform", "input_dim": 1353244, "input_dtype": "int32", "batch_input_shape": [null, 140], "trainable": true, "W_regularizer": null, "output_dim": 52, "W_constraint": null, "input_length": 140, "name": "embedding_1", "activity_regularizer": null, "mask_zero": false, "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1", "padding": 5}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "init": "uniform", "input_dim": null, "input_length": null, "activation": "relu", "W_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "name": "convolution1d_1", "activity_regularizer": null, "b_constraint": null, "filter_length": 6, "border_mode": "valid", "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "name": "maxpooling1d_1", "stride": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "init": "uniform", "input_dim": null, "input_length": null, "activation": "relu", "W_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "name": "convolution1d_2", "activity_regularizer": null, "b_constraint": null, "filter_length": 6, "border_mode": "valid", "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 66, "name": "maxpooling1d_2", "stride": 66, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "glorot_uniform", "input_dim": null, "trainable": true, "output_dim": 200, "W_regularizer": null, "bias": true, "W_constraint": null, "name": "dense_1", "b_constraint": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "glorot_uniform", "input_dim": null, "trainable": true, "output_dim": 3, "W_regularizer": null, "bias": true, "W_constraint": null, "name": "dense_2", "b_constraint": null, "activity_regularizer": null, "activation": "softmax"}}]}