{"config": [{"config": {"output_shape_type": "raw", "output_shape": null, "name": "merge_1", "concat_axis": -1, "dot_axes": -1, "mode_type": "raw", "layers": [{"config": [{"config": {"output_dim": 52, "batch_input_shape": [null, 140], "name": "embedding_1_dai_model", "input_length": 140, "dropout": 0.2, "mask_zero": false, "input_dtype": "int32", "W_regularizer": null, "W_constraint": null, "input_dim": 1576890, "activity_regularizer": null, "init": "uniform", "trainable": true}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_dai_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"bias": true, "activation": "relu", "name": "convolution1d_1_dai_model", "b_constraint": null, "subsample_length": 1, "input_length": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "stride": 2, "name": "maxpooling1d_1_dai_model", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"bias": true, "activation": "relu", "name": "convolution1d_2_dai_model", "b_constraint": null, "subsample_length": 1, "input_length": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "filter_length": 6}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"output_dim": 52, "batch_input_shape": [null, 140], "name": "embedding_1_hul_model", "input_length": 140, "dropout": 0.2, "mask_zero": false, "input_dtype": "int32", "W_regularizer": null, "W_constraint": null, "input_dim": 1062158, "activity_regularizer": null, "init": "uniform", "trainable": true}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"bias": true, "activation": "relu", "name": "convolution1d_1_hul_model", "b_constraint": null, "subsample_length": 1, "input_length": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "stride": 2, "name": "maxpooling1d_1_hul_model", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"bias": true, "activation": "relu", "name": "convolution1d_2_hul_model", "b_constraint": null, "subsample_length": 1, "input_length": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "filter_length": 6}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"output_dim": 52, "batch_input_shape": [null, 140], "name": "embedding_17_mpq_model", "input_length": 140, "dropout": 0.2, "mask_zero": false, "input_dtype": "int32", "W_regularizer": null, "W_constraint": null, "input_dim": 428669, "activity_regularizer": null, "init": "uniform", "trainable": true}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_17_mpq_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"bias": true, "activation": "relu", "name": "convolution1d_33_mpq_model", "b_constraint": null, "subsample_length": 1, "input_length": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "stride": 2, "name": "maxpooling1d_33_mpq_model", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"bias": true, "activation": "relu", "name": "convolution1d_34_mpq_model", "b_constraint": null, "subsample_length": 1, "input_length": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "filter_length": 6}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"output_dim": 52, "batch_input_shape": [null, 140], "name": "embedding_1_semeval_model", "input_length": 140, "dropout": 0.2, "mask_zero": false, "input_dtype": "int32", "W_regularizer": null, "W_constraint": null, "input_dim": 428669, "activity_regularizer": null, "init": "uniform", "trainable": true}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"bias": true, "activation": "relu", "name": "convolution1d_1_semeval_model", "b_constraint": null, "subsample_length": 1, "input_length": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "stride": 2, "name": "maxpooling1d_1_semeval_model", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"bias": true, "activation": "relu", "name": "convolution1d_2_semeval_model", "b_constraint": null, "subsample_length": 1, "input_length": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "filter_length": 6}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"output_dim": 52, "batch_input_shape": [null, 140], "name": "embedding_1_tac_model", "input_length": 140, "dropout": 0.2, "mask_zero": false, "input_dtype": "int32", "W_regularizer": null, "W_constraint": null, "input_dim": 428669, "activity_regularizer": null, "init": "uniform", "trainable": true}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"bias": true, "activation": "relu", "name": "convolution1d_1_tac_model", "b_constraint": null, "subsample_length": 1, "input_length": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "stride": 2, "name": "maxpooling1d_1_tac_model", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"bias": true, "activation": "relu", "name": "convolution1d_2_tac_model", "b_constraint": null, "subsample_length": 1, "input_length": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 200, "W_regularizer": null, "W_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "filter_length": 6}, "class_name": "Convolution1D"}], "class_name": "Sequential"}], "mode": "concat"}, "class_name": "Merge"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 200, "activation": "linear", "name": "dense_1", "b_constraint": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "trainable": true}, "class_name": "Dense"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"output_dim": 3, "activation": "softmax", "name": "dense_2", "b_constraint": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "trainable": true}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}