{"config": [{"config": {"concat_axis": -1, "output_shape": null, "dot_axes": -1, "name": "merge_1", "mode_type": "raw", "layers": [{"config": [{"config": {"input_dtype": "int32", "name": "embedding_1_dai_model", "output_dim": 52, "W_constraint": null, "W_regularizer": null, "trainable": true, "input_dim": 1576890, "batch_input_shape": [null, 140], "mask_zero": false, "init": "uniform", "dropout": 0.2, "input_length": 140, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_dai_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activity_regularizer": null, "bias": true, "name": "convolution1d_1_dai_model", "nb_filter": 200, "input_dim": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "activation": "relu", "init": "uniform", "input_length": null, "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_dai_model", "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "bias": true, "name": "convolution1d_2_dai_model", "nb_filter": 200, "input_dim": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "activation": "relu", "init": "uniform", "input_length": null, "border_mode": "valid"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dtype": "int32", "name": "embedding_1_dil_model", "output_dim": 52, "W_constraint": null, "W_regularizer": null, "trainable": true, "input_dim": 1576890, "batch_input_shape": [null, 140], "mask_zero": false, "init": "uniform", "dropout": 0.2, "input_length": 140, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_dil_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activity_regularizer": null, "bias": true, "name": "convolution1d_1_dil_model", "nb_filter": 200, "input_dim": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "activation": "relu", "init": "uniform", "input_length": null, "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_dil_model", "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "bias": true, "name": "convolution1d_2_dil_model", "nb_filter": 200, "input_dim": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "activation": "relu", "init": "uniform", "input_length": null, "border_mode": "valid"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dtype": "int32", "name": "embedding_1_hul_model", "output_dim": 52, "W_constraint": null, "W_regularizer": null, "trainable": true, "input_dim": 1062158, "batch_input_shape": [null, 140], "mask_zero": false, "init": "uniform", "dropout": 0.2, "input_length": 140, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_hul_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activity_regularizer": null, "bias": true, "name": "convolution1d_1_hul_model", "nb_filter": 200, "input_dim": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "activation": "relu", "init": "uniform", "input_length": null, "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_hul_model", "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "bias": true, "name": "convolution1d_2_hul_model", "nb_filter": 200, "input_dim": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "activation": "relu", "init": "uniform", "input_length": null, "border_mode": "valid"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dtype": "int32", "name": "embedding_17_mpq_model", "output_dim": 52, "W_constraint": null, "W_regularizer": null, "trainable": true, "input_dim": 428669, "batch_input_shape": [null, 140], "mask_zero": false, "init": "uniform", "dropout": 0.2, "input_length": 140, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_17_mpq_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activity_regularizer": null, "bias": true, "name": "convolution1d_33_mpq_model", "nb_filter": 200, "input_dim": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "activation": "relu", "init": "uniform", "input_length": null, "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_33_mpq_model", "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "bias": true, "name": "convolution1d_34_mpq_model", "nb_filter": 200, "input_dim": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "activation": "relu", "init": "uniform", "input_length": null, "border_mode": "valid"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dtype": "int32", "name": "embedding_1_semeval_model", "output_dim": 52, "W_constraint": null, "W_regularizer": null, "trainable": true, "input_dim": 428669, "batch_input_shape": [null, 140], "mask_zero": false, "init": "uniform", "dropout": 0.2, "input_length": 140, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_semeval_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activity_regularizer": null, "bias": true, "name": "convolution1d_1_semeval_model", "nb_filter": 200, "input_dim": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "activation": "relu", "init": "uniform", "input_length": null, "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_semeval_model", "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "bias": true, "name": "convolution1d_2_semeval_model", "nb_filter": 200, "input_dim": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "activation": "relu", "init": "uniform", "input_length": null, "border_mode": "valid"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dtype": "int32", "name": "embedding_1_tac_model", "output_dim": 52, "W_constraint": null, "W_regularizer": null, "trainable": true, "input_dim": 428669, "batch_input_shape": [null, 140], "mask_zero": false, "init": "uniform", "dropout": 0.2, "input_length": 140, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_tac_model"}, "class_name": "ZeroPadding1D"}, {"config": {"activity_regularizer": null, "bias": true, "name": "convolution1d_1_tac_model", "nb_filter": 200, "input_dim": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "activation": "relu", "init": "uniform", "input_length": null, "border_mode": "valid"}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_tac_model", "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "bias": true, "name": "convolution1d_2_tac_model", "nb_filter": 200, "input_dim": null, "trainable": true, "filter_length": 6, "b_regularizer": null, "W_constraint": null, "subsample_length": 1, "W_regularizer": null, "b_constraint": null, "activation": "relu", "init": "uniform", "input_length": null, "border_mode": "valid"}, "class_name": "Convolution1D"}], "class_name": "Sequential"}], "output_shape_type": "raw", "mode": "concat"}, "class_name": "Merge"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"output_dim": 200, "bias": true, "name": "dense_1", "W_constraint": null, "W_regularizer": null, "trainable": true, "input_dim": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"output_dim": 3, "bias": true, "name": "dense_2", "W_constraint": null, "W_regularizer": null, "trainable": true, "input_dim": null, "activation": "softmax", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}