{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "name": "embedding_1_dil_model", "init": "uniform", "batch_input_shape": [null, 140], "input_dtype": "int32", "activity_regularizer": null, "mask_zero": false, "W_constraint": null, "dropout": 0.2, "input_dim": 1576890, "trainable": true, "W_regularizer": null, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "activation": "relu", "b_constraint": null, "name": "convolution1d_1_dil_model", "init": "uniform", "bias": true, "filter_length": 6, "activity_regularizer": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dil_model", "trainable": true, "stride": 2, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "activation": "relu", "b_constraint": null, "name": "convolution1d_2_dil_model", "init": "uniform", "bias": true, "filter_length": 6, "activity_regularizer": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "name": "embedding_1_hul_model", "init": "uniform", "batch_input_shape": [null, 140], "input_dtype": "int32", "activity_regularizer": null, "mask_zero": false, "W_constraint": null, "dropout": 0.2, "input_dim": 1062158, "trainable": true, "W_regularizer": null, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "activation": "relu", "b_constraint": null, "name": "convolution1d_1_hul_model", "init": "uniform", "bias": true, "filter_length": 6, "activity_regularizer": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_hul_model", "trainable": true, "stride": 2, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "activation": "relu", "b_constraint": null, "name": "convolution1d_2_hul_model", "init": "uniform", "bias": true, "filter_length": 6, "activity_regularizer": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "name": "embedding_17_mpq_model", "init": "uniform", "batch_input_shape": [null, 140], "input_dtype": "int32", "activity_regularizer": null, "mask_zero": false, "W_constraint": null, "dropout": 0.2, "input_dim": 428669, "trainable": true, "W_regularizer": null, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "activation": "relu", "b_constraint": null, "name": "convolution1d_33_mpq_model", "init": "uniform", "bias": true, "filter_length": 6, "activity_regularizer": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_33_mpq_model", "trainable": true, "stride": 2, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "activation": "relu", "b_constraint": null, "name": "convolution1d_34_mpq_model", "init": "uniform", "bias": true, "filter_length": 6, "activity_regularizer": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "name": "embedding_1_tac_model", "init": "uniform", "batch_input_shape": [null, 140], "input_dtype": "int32", "activity_regularizer": null, "mask_zero": false, "W_constraint": null, "dropout": 0.2, "input_dim": 428669, "trainable": true, "W_regularizer": null, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "activation": "relu", "b_constraint": null, "name": "convolution1d_1_tac_model", "init": "uniform", "bias": true, "filter_length": 6, "activity_regularizer": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_tac_model", "trainable": true, "stride": 2, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "activation": "relu", "b_constraint": null, "name": "convolution1d_2_tac_model", "init": "uniform", "bias": true, "filter_length": 6, "activity_regularizer": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "name": "embedding_1_dai_model", "init": "uniform", "batch_input_shape": [null, 140], "input_dtype": "int32", "activity_regularizer": null, "mask_zero": false, "W_constraint": null, "dropout": 0.2, "input_dim": 1576890, "trainable": true, "W_regularizer": null, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "activation": "relu", "b_constraint": null, "name": "convolution1d_1_dai_model", "init": "uniform", "bias": true, "filter_length": 6, "activity_regularizer": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dai_model", "trainable": true, "stride": 2, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "activation": "relu", "b_constraint": null, "name": "convolution1d_2_dai_model", "init": "uniform", "bias": true, "filter_length": 6, "activity_regularizer": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "name": "embedding_1_semeval_model", "init": "uniform", "batch_input_shape": [null, 140], "input_dtype": "int32", "activity_regularizer": null, "mask_zero": false, "W_constraint": null, "dropout": 0.2, "input_dim": 428669, "trainable": true, "W_regularizer": null, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "activation": "relu", "b_constraint": null, "name": "convolution1d_1_semeval_model", "init": "uniform", "bias": true, "filter_length": 6, "activity_regularizer": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_semeval_model", "trainable": true, "stride": 2, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "activation": "relu", "b_constraint": null, "name": "convolution1d_2_semeval_model", "init": "uniform", "bias": true, "filter_length": 6, "activity_regularizer": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_length": null}}]}], "name": "merge_1", "output_shape": null, "concat_axis": -1, "mode_type": "raw", "mode": "concat", "dot_axes": -1, "output_shape_type": "raw"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "output_dim": 200, "name": "dense_1", "init": "glorot_uniform", "bias": true, "activation": "linear", "activity_regularizer": null, "trainable": true, "input_dim": null, "b_constraint": null, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "output_dim": 3, "name": "dense_2", "init": "glorot_uniform", "bias": true, "activation": "softmax", "activity_regularizer": null, "trainable": true, "input_dim": null, "b_constraint": null, "W_regularizer": null, "b_regularizer": null}}]}