{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"output_shape": null, "mode": "concat", "mode_type": "raw", "output_shape_type": "raw", "name": "merge_1", "dot_axes": -1, "concat_axis": -1, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "input_dtype": "int32", "mask_zero": false, "W_constraint": null, "W_regularizer": null, "dropout": 0.2, "input_length": 140, "output_dim": 52, "activity_regularizer": null, "trainable": true, "name": "embedding_1_dil_model", "input_dim": 1576890, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "trainable": true, "input_length": null, "name": "convolution1d_1_dil_model", "activation": "relu", "nb_filter": 200, "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_dil_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "trainable": true, "input_length": null, "name": "convolution1d_2_dil_model", "activation": "relu", "nb_filter": 200, "input_dim": null, "init": "uniform"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "input_dtype": "int32", "mask_zero": false, "W_constraint": null, "W_regularizer": null, "dropout": 0.2, "input_length": 140, "output_dim": 52, "activity_regularizer": null, "trainable": true, "name": "embedding_17_mpq_model", "input_dim": 428669, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "trainable": true, "input_length": null, "name": "convolution1d_33_mpq_model", "activation": "relu", "nb_filter": 200, "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_33_mpq_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "trainable": true, "input_length": null, "name": "convolution1d_34_mpq_model", "activation": "relu", "nb_filter": 200, "input_dim": null, "init": "uniform"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "input_dtype": "int32", "mask_zero": false, "W_constraint": null, "W_regularizer": null, "dropout": 0.2, "input_length": 140, "output_dim": 52, "activity_regularizer": null, "trainable": true, "name": "embedding_1_semeval_model", "input_dim": 1576890, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "trainable": true, "input_length": null, "name": "convolution1d_1_semeval_model", "activation": "relu", "nb_filter": 200, "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_semeval_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "trainable": true, "input_length": null, "name": "convolution1d_2_semeval_model", "activation": "relu", "nb_filter": 200, "input_dim": null, "init": "uniform"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "input_dtype": "int32", "mask_zero": false, "W_constraint": null, "W_regularizer": null, "dropout": 0.2, "input_length": 140, "output_dim": 52, "activity_regularizer": null, "trainable": true, "name": "embedding_1_tac_model", "input_dim": 428669, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "trainable": true, "input_length": null, "name": "convolution1d_1_tac_model", "activation": "relu", "nb_filter": 200, "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_tac_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "filter_length": 6, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "trainable": true, "input_length": null, "name": "convolution1d_2_tac_model", "activation": "relu", "nb_filter": 200, "input_dim": null, "init": "uniform"}}]}]}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "activation": "relu", "W_regularizer": null, "bias": true, "W_constraint": null, "filter_length": 6, "input_length": null, "b_constraint": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "name": "convolution1d_1", "b_regularizer": null, "nb_filter": 200, "input_dim": null, "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_2", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "output_dim": 200, "activity_regularizer": null, "name": "dense_1", "activation": "linear", "input_dim": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "output_dim": 3, "activity_regularizer": null, "name": "dense_2", "activation": "softmax", "input_dim": null, "init": "glorot_uniform"}}]}