{"keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "input_dim": 1576890, "trainable": true, "output_dim": 52, "dropout": 0.2, "activity_regularizer": null, "name": "embedding_6", "input_dtype": "int32", "W_constraint": null, "input_length": 140, "init": "uniform", "W_regularizer": null, "mask_zero": false}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_6", "padding": 5}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "input_dim": null, "subsample_length": 1, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "name": "convolution1d_11", "W_constraint": null, "nb_filter": 200, "input_length": null, "activation": "relu", "border_mode": "valid", "init": "uniform", "bias": true, "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_11", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "input_dim": null, "subsample_length": 1, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "name": "convolution1d_12", "W_constraint": null, "nb_filter": 200, "input_length": null, "activation": "relu", "border_mode": "valid", "init": "uniform", "bias": true, "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "pool_length": 66, "border_mode": "valid", "name": "maxpooling1d_12", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "input_dim": null, "W_constraint": null, "output_dim": 200, "activity_regularizer": null, "b_regularizer": null, "name": "dense_11", "trainable": true, "activation": "linear", "init": "glorot_uniform", "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_6", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "input_dim": null, "W_constraint": null, "output_dim": 3, "activity_regularizer": null, "b_regularizer": null, "name": "dense_12", "trainable": true, "activation": "softmax", "init": "glorot_uniform", "bias": true}}], "class_name": "Sequential"}