{"config": [{"config": {"trainable": true, "activity_regularizer": null, "batch_input_shape": [null, 140], "input_length": 140, "W_constraint": null, "output_dim": 52, "name": "embedding_13", "dropout": 0.2, "init": "uniform", "W_regularizer": null, "input_dtype": "int32", "mask_zero": false, "input_dim": 1576890}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_13", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"input_dim": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "border_mode": "valid", "b_constraint": null, "W_constraint": null, "input_length": null, "name": "convolution1d_25", "init": "uniform", "nb_filter": 200, "W_regularizer": null, "filter_length": 6, "subsample_length": 1, "bias": true}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "trainable": true, "stride": 2, "name": "maxpooling1d_25", "pool_length": 4}, "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "border_mode": "valid", "b_constraint": null, "W_constraint": null, "input_length": null, "name": "convolution1d_26", "init": "uniform", "nb_filter": 200, "W_regularizer": null, "filter_length": 6, "subsample_length": 1, "bias": true}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "trainable": true, "stride": 66, "name": "maxpooling1d_26", "pool_length": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_13"}, "class_name": "Flatten"}, {"config": {"trainable": true, "b_constraint": null, "b_regularizer": null, "activation": "linear", "W_constraint": null, "output_dim": 200, "name": "dense_25", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_13"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_constraint": null, "b_regularizer": null, "activation": "softmax", "W_constraint": null, "output_dim": 3, "name": "dense_26", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "bias": true}, "class_name": "Dense"}], "keras_version": "1.1.0", "class_name": "Sequential"}