{"config": [{"class_name": "Merge", "config": {"name": "merge_1", "output_shape": null, "mode_type": "raw", "output_shape_type": "raw", "concat_axis": -1, "mode": "concat", "dot_axes": -1, "layers": [{"class_name": "Sequential", "config": [{"config": {"dropout": 0.2, "name": "embedding_1_dai_model", "mask_zero": false, "trainable": true, "output_dim": 52, "W_constraint": null, "W_regularizer": null, "input_length": 140, "input_dim": 1576890, "input_dtype": "int32", "activity_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "name": "convolution1d_1_dai_model", "nb_filter": 200, "trainable": true, "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activity_regularizer": null, "subsample_length": 1, "bias": true, "b_constraint": null, "init": "uniform", "b_regularizer": null, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_dai_model", "stride": 2, "pool_length": 4, "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "name": "convolution1d_2_dai_model", "nb_filter": 200, "trainable": true, "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activity_regularizer": null, "subsample_length": 1, "bias": true, "b_constraint": null, "init": "uniform", "b_regularizer": null, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_2_dai_model", "stride": 66, "pool_length": 66, "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_dai_model", "trainable": true}, "class_name": "Flatten"}]}, {"class_name": "Sequential", "config": [{"config": {"dropout": 0.2, "name": "embedding_17_mpq_model", "mask_zero": false, "trainable": true, "output_dim": 52, "W_constraint": null, "W_regularizer": null, "input_length": 140, "input_dim": 428669, "input_dtype": "int32", "activity_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "name": "convolution1d_33_mpq_model", "nb_filter": 200, "trainable": true, "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activity_regularizer": null, "subsample_length": 1, "bias": true, "b_constraint": null, "init": "uniform", "b_regularizer": null, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_33_mpq_model", "stride": 2, "pool_length": 4, "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "name": "convolution1d_34_mpq_model", "nb_filter": 200, "trainable": true, "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activity_regularizer": null, "subsample_length": 1, "bias": true, "b_constraint": null, "init": "uniform", "b_regularizer": null, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_34_mpq_model", "stride": 66, "pool_length": 66, "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_17_mpq_model", "trainable": true}, "class_name": "Flatten"}]}, {"class_name": "Sequential", "config": [{"config": {"dropout": 0.2, "name": "embedding_1_dil_model", "mask_zero": false, "trainable": true, "output_dim": 52, "W_constraint": null, "W_regularizer": null, "input_length": 140, "input_dim": 1576890, "input_dtype": "int32", "activity_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "name": "convolution1d_1_dil_model", "nb_filter": 200, "trainable": true, "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activity_regularizer": null, "subsample_length": 1, "bias": true, "b_constraint": null, "init": "uniform", "b_regularizer": null, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_dil_model", "stride": 2, "pool_length": 4, "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "name": "convolution1d_2_dil_model", "nb_filter": 200, "trainable": true, "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activity_regularizer": null, "subsample_length": 1, "bias": true, "b_constraint": null, "init": "uniform", "b_regularizer": null, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_2_dil_model", "stride": 66, "pool_length": 66, "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_dil_model", "trainable": true}, "class_name": "Flatten"}]}, {"class_name": "Sequential", "config": [{"config": {"dropout": 0.2, "name": "embedding_1_hul_model", "mask_zero": false, "trainable": true, "output_dim": 52, "W_constraint": null, "W_regularizer": null, "input_length": 140, "input_dim": 1062158, "input_dtype": "int32", "activity_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "name": "convolution1d_1_hul_model", "nb_filter": 200, "trainable": true, "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activity_regularizer": null, "subsample_length": 1, "bias": true, "b_constraint": null, "init": "uniform", "b_regularizer": null, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_hul_model", "stride": 2, "pool_length": 4, "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "name": "convolution1d_2_hul_model", "nb_filter": 200, "trainable": true, "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activity_regularizer": null, "subsample_length": 1, "bias": true, "b_constraint": null, "init": "uniform", "b_regularizer": null, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_2_hul_model", "stride": 66, "pool_length": 66, "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_hul_model", "trainable": true}, "class_name": "Flatten"}]}, {"class_name": "Sequential", "config": [{"config": {"dropout": 0.2, "name": "embedding_1_semeval_model", "mask_zero": false, "trainable": true, "output_dim": 52, "W_constraint": null, "W_regularizer": null, "input_length": 140, "input_dim": 428669, "input_dtype": "int32", "activity_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "name": "convolution1d_1_semeval_model", "nb_filter": 200, "trainable": true, "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activity_regularizer": null, "subsample_length": 1, "bias": true, "b_constraint": null, "init": "uniform", "b_regularizer": null, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_semeval_model", "stride": 2, "pool_length": 4, "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "name": "convolution1d_2_semeval_model", "nb_filter": 200, "trainable": true, "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activity_regularizer": null, "subsample_length": 1, "bias": true, "b_constraint": null, "init": "uniform", "b_regularizer": null, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_2_semeval_model", "stride": 66, "pool_length": 66, "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_semeval_model", "trainable": true}, "class_name": "Flatten"}]}, {"class_name": "Sequential", "config": [{"config": {"dropout": 0.2, "name": "embedding_1_tac_model", "mask_zero": false, "trainable": true, "output_dim": 52, "W_constraint": null, "W_regularizer": null, "input_length": 140, "input_dim": 428669, "input_dtype": "int32", "activity_regularizer": null, "init": "uniform", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "name": "convolution1d_1_tac_model", "nb_filter": 200, "trainable": true, "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activity_regularizer": null, "subsample_length": 1, "bias": true, "b_constraint": null, "init": "uniform", "b_regularizer": null, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_tac_model", "stride": 2, "pool_length": 4, "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "name": "convolution1d_2_tac_model", "nb_filter": 200, "trainable": true, "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "input_length": null, "input_dim": null, "activity_regularizer": null, "subsample_length": 1, "bias": true, "b_constraint": null, "init": "uniform", "b_regularizer": null, "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_2_tac_model", "stride": 66, "pool_length": 66, "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_tac_model", "trainable": true}, "class_name": "Flatten"}]}]}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_1", "bias": true, "trainable": true, "output_dim": 1028, "W_constraint": null, "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "softmax", "name": "dense_2", "bias": true, "trainable": true, "output_dim": 3, "W_constraint": null, "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null}}], "class_name": "Sequential", "keras_version": "1.1.1"}