{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "output_shape_type": "raw", "mode_type": "raw", "output_shape": null, "concat_axis": -1, "dot_axes": -1, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "activity_regularizer": null, "output_dim": 52, "input_dtype": "int32", "init": "uniform", "mask_zero": false, "trainable": true, "name": "embedding_1_semeval_model", "W_regularizer": null, "W_constraint": null, "input_dim": 428669, "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_length": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "border_mode": "valid", "init": "uniform", "activation": "relu", "trainable": true, "nb_filter": 200, "name": "convolution1d_1_semeval_model", "W_regularizer": null, "filter_length": 6, "b_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_semeval_model", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"input_length": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "border_mode": "valid", "init": "uniform", "activation": "relu", "trainable": true, "nb_filter": 200, "name": "convolution1d_2_semeval_model", "W_regularizer": null, "filter_length": 6, "b_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_semeval_model", "stride": 66, "trainable": true, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_semeval_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "activity_regularizer": null, "output_dim": 52, "input_dtype": "int32", "init": "uniform", "mask_zero": false, "trainable": true, "name": "embedding_1_tac_model", "W_regularizer": null, "W_constraint": null, "input_dim": 428669, "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_length": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "border_mode": "valid", "init": "uniform", "activation": "relu", "trainable": true, "nb_filter": 200, "name": "convolution1d_1_tac_model", "W_regularizer": null, "filter_length": 6, "b_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_tac_model", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"input_length": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "border_mode": "valid", "init": "uniform", "activation": "relu", "trainable": true, "nb_filter": 200, "name": "convolution1d_2_tac_model", "W_regularizer": null, "filter_length": 6, "b_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_tac_model", "stride": 66, "trainable": true, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_tac_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "activity_regularizer": null, "output_dim": 52, "input_dtype": "int32", "init": "uniform", "mask_zero": false, "trainable": true, "name": "embedding_1_hul_model", "W_regularizer": null, "W_constraint": null, "input_dim": 1062158, "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_length": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "border_mode": "valid", "init": "uniform", "activation": "relu", "trainable": true, "nb_filter": 200, "name": "convolution1d_1_hul_model", "W_regularizer": null, "filter_length": 6, "b_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_hul_model", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"input_length": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "border_mode": "valid", "init": "uniform", "activation": "relu", "trainable": true, "nb_filter": 200, "name": "convolution1d_2_hul_model", "W_regularizer": null, "filter_length": 6, "b_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_hul_model", "stride": 66, "trainable": true, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_hul_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "activity_regularizer": null, "output_dim": 52, "input_dtype": "int32", "init": "uniform", "mask_zero": false, "trainable": true, "name": "embedding_17_mpq_model", "W_regularizer": null, "W_constraint": null, "input_dim": 428669, "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_length": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "border_mode": "valid", "init": "uniform", "activation": "relu", "trainable": true, "nb_filter": 200, "name": "convolution1d_33_mpq_model", "W_regularizer": null, "filter_length": 6, "b_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_33_mpq_model", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"input_length": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "border_mode": "valid", "init": "uniform", "activation": "relu", "trainable": true, "nb_filter": 200, "name": "convolution1d_34_mpq_model", "W_regularizer": null, "filter_length": 6, "b_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_34_mpq_model", "stride": 66, "trainable": true, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_17_mpq_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "activity_regularizer": null, "output_dim": 52, "input_dtype": "int32", "init": "uniform", "mask_zero": false, "trainable": true, "name": "embedding_1_dai_model", "W_regularizer": null, "W_constraint": null, "input_dim": 1576890, "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_length": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "border_mode": "valid", "init": "uniform", "activation": "relu", "trainable": true, "nb_filter": 200, "name": "convolution1d_1_dai_model", "W_regularizer": null, "filter_length": 6, "b_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dai_model", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"input_length": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "border_mode": "valid", "init": "uniform", "activation": "relu", "trainable": true, "nb_filter": 200, "name": "convolution1d_2_dai_model", "W_regularizer": null, "filter_length": 6, "b_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dai_model", "stride": 66, "trainable": true, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dai_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "batch_input_shape": [null, 140], "activity_regularizer": null, "output_dim": 52, "input_dtype": "int32", "init": "uniform", "mask_zero": false, "trainable": true, "name": "embedding_1_dil_model", "W_regularizer": null, "W_constraint": null, "input_dim": 1576890, "dropout": 0.2}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_length": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "border_mode": "valid", "init": "uniform", "activation": "relu", "trainable": true, "nb_filter": 200, "name": "convolution1d_1_dil_model", "W_regularizer": null, "filter_length": 6, "b_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dil_model", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"input_length": null, "subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "border_mode": "valid", "init": "uniform", "activation": "relu", "trainable": true, "nb_filter": 200, "name": "convolution1d_2_dil_model", "W_regularizer": null, "filter_length": 6, "b_regularizer": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dil_model", "stride": 66, "trainable": true, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dil_model", "trainable": true}}]}], "mode": "concat"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "output_dim": 1028, "b_constraint": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "name": "dense_1", "trainable": true, "W_constraint": null, "input_dim": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "output_dim": 3, "b_constraint": null, "bias": true, "init": "glorot_uniform", "activation": "softmax", "W_regularizer": null, "name": "dense_2", "trainable": true, "W_constraint": null, "input_dim": null}}]}