{"config": [{"config": {"W_regularizer": null, "input_dtype": "int32", "dropout": 0.2, "W_constraint": null, "input_length": 140, "mask_zero": false, "output_dim": 52, "init": "uniform", "batch_input_shape": [null, 140], "activity_regularizer": null, "trainable": true, "input_dim": 1576890, "name": "embedding_184"}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_184"}, "class_name": "ZeroPadding1D"}, {"config": {"W_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "W_constraint": null, "input_length": null, "init": "uniform", "filter_length": 6, "activity_regularizer": null, "subsample_length": 1, "nb_filter": 200, "trainable": true, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "name": "convolution1d_367"}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "border_mode": "valid", "stride": 2, "pool_length": 4, "name": "maxpooling1d_367"}, "class_name": "MaxPooling1D"}, {"config": {"W_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "W_constraint": null, "input_length": null, "init": "uniform", "filter_length": 6, "activity_regularizer": null, "subsample_length": 1, "nb_filter": 200, "trainable": true, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "name": "convolution1d_368"}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "border_mode": "valid", "stride": 66, "pool_length": 66, "name": "maxpooling1d_368"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_184"}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "activation": "linear", "bias": true, "W_constraint": null, "output_dim": 200, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": null, "b_regularizer": null, "name": "dense_367"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_184", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_184"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "activation": "softmax", "bias": true, "W_constraint": null, "output_dim": 3, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": null, "b_regularizer": null, "name": "dense_368"}, "class_name": "Dense"}], "keras_version": "1.1.0", "class_name": "Sequential"}