{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"dot_axes": -1, "name": "merge_1", "concat_axis": -1, "output_shape": null, "mode": "concat", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "input_length": 140, "trainable": true, "init": "uniform", "output_dim": 52, "name": "embedding_1_dai_model", "W_regularizer": null, "mask_zero": false, "activity_regularizer": null, "dropout": 0.2, "input_dim": 1576890, "batch_input_shape": [null, 140], "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dai_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "input_length": null, "subsample_length": 1, "bias": true, "b_regularizer": null, "nb_filter": 200, "init": "uniform", "b_constraint": null, "name": "convolution1d_1_dai_model", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "filter_length": 6, "input_dim": null, "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_dai_model", "pool_length": 4, "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "input_length": null, "subsample_length": 1, "bias": true, "b_regularizer": null, "nb_filter": 200, "init": "uniform", "b_constraint": null, "name": "convolution1d_2_dai_model", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "filter_length": 6, "input_dim": null, "trainable": true, "activation": "relu"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "input_length": 140, "trainable": true, "init": "uniform", "output_dim": 52, "name": "embedding_1_dil_model", "W_regularizer": null, "mask_zero": false, "activity_regularizer": null, "dropout": 0.2, "input_dim": 1576890, "batch_input_shape": [null, 140], "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dil_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "input_length": null, "subsample_length": 1, "bias": true, "b_regularizer": null, "nb_filter": 200, "init": "uniform", "b_constraint": null, "name": "convolution1d_1_dil_model", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "filter_length": 6, "input_dim": null, "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_dil_model", "pool_length": 4, "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "input_length": null, "subsample_length": 1, "bias": true, "b_regularizer": null, "nb_filter": 200, "init": "uniform", "b_constraint": null, "name": "convolution1d_2_dil_model", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "filter_length": 6, "input_dim": null, "trainable": true, "activation": "relu"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "input_length": 140, "trainable": true, "init": "uniform", "output_dim": 52, "name": "embedding_1_hul_model", "W_regularizer": null, "mask_zero": false, "activity_regularizer": null, "dropout": 0.2, "input_dim": 1062158, "batch_input_shape": [null, 140], "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "input_length": null, "subsample_length": 1, "bias": true, "b_regularizer": null, "nb_filter": 200, "init": "uniform", "b_constraint": null, "name": "convolution1d_1_hul_model", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "filter_length": 6, "input_dim": null, "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_hul_model", "pool_length": 4, "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "input_length": null, "subsample_length": 1, "bias": true, "b_regularizer": null, "nb_filter": 200, "init": "uniform", "b_constraint": null, "name": "convolution1d_2_hul_model", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "filter_length": 6, "input_dim": null, "trainable": true, "activation": "relu"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "input_length": 140, "trainable": true, "init": "uniform", "output_dim": 52, "name": "embedding_17_mpq_model", "W_regularizer": null, "mask_zero": false, "activity_regularizer": null, "dropout": 0.2, "input_dim": 428669, "batch_input_shape": [null, 140], "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_17_mpq_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "input_length": null, "subsample_length": 1, "bias": true, "b_regularizer": null, "nb_filter": 200, "init": "uniform", "b_constraint": null, "name": "convolution1d_33_mpq_model", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "filter_length": 6, "input_dim": null, "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_33_mpq_model", "pool_length": 4, "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "input_length": null, "subsample_length": 1, "bias": true, "b_regularizer": null, "nb_filter": 200, "init": "uniform", "b_constraint": null, "name": "convolution1d_34_mpq_model", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "filter_length": 6, "input_dim": null, "trainable": true, "activation": "relu"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "input_length": 140, "trainable": true, "init": "uniform", "output_dim": 52, "name": "embedding_1_semeval_model", "W_regularizer": null, "mask_zero": false, "activity_regularizer": null, "dropout": 0.2, "input_dim": 428669, "batch_input_shape": [null, 140], "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "input_length": null, "subsample_length": 1, "bias": true, "b_regularizer": null, "nb_filter": 200, "init": "uniform", "b_constraint": null, "name": "convolution1d_1_semeval_model", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "filter_length": 6, "input_dim": null, "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_semeval_model", "pool_length": 4, "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "input_length": null, "subsample_length": 1, "bias": true, "b_regularizer": null, "nb_filter": 200, "init": "uniform", "b_constraint": null, "name": "convolution1d_2_semeval_model", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "filter_length": 6, "input_dim": null, "trainable": true, "activation": "relu"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "input_length": 140, "trainable": true, "init": "uniform", "output_dim": 52, "name": "embedding_1_tac_model", "W_regularizer": null, "mask_zero": false, "activity_regularizer": null, "dropout": 0.2, "input_dim": 428669, "batch_input_shape": [null, 140], "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "input_length": null, "subsample_length": 1, "bias": true, "b_regularizer": null, "nb_filter": 200, "init": "uniform", "b_constraint": null, "name": "convolution1d_1_tac_model", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "filter_length": 6, "input_dim": null, "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_tac_model", "pool_length": 4, "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "input_length": null, "subsample_length": 1, "bias": true, "b_regularizer": null, "nb_filter": 200, "init": "uniform", "b_constraint": null, "name": "convolution1d_2_tac_model", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "filter_length": 6, "input_dim": null, "trainable": true, "activation": "relu"}}]}], "output_shape_type": "raw", "mode_type": "raw"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "output_dim": 200, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "trainable": true, "activation": "linear"}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "output_dim": 3, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "trainable": true, "activation": "softmax"}}]}