{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"input_dim": 1353244, "W_regularizer": null, "batch_input_shape": [null, 140], "mask_zero": false, "init": "uniform", "trainable": true, "name": "embedding_18", "W_constraint": null, "input_length": 140, "dropout": 0.2, "output_dim": 52, "activity_regularizer": null, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_18", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"bias": true, "input_dim": null, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "nb_filter": 200, "b_regularizer": null, "b_constraint": null, "init": "uniform", "trainable": true, "name": "convolution1d_35", "W_constraint": null, "subsample_length": 1, "input_length": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_35", "border_mode": "valid", "stride": 2, "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"bias": true, "input_dim": null, "filter_length": 6, "border_mode": "valid", "W_regularizer": null, "nb_filter": 200, "b_regularizer": null, "b_constraint": null, "init": "uniform", "trainable": true, "name": "convolution1d_36", "W_constraint": null, "subsample_length": 1, "input_length": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_36", "border_mode": "valid", "stride": 66, "trainable": true, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_18", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "W_regularizer": null, "trainable": true, "output_dim": 200, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "name": "dense_35", "W_constraint": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_18", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_18", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "W_regularizer": null, "trainable": true, "output_dim": 3, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "name": "dense_36", "W_constraint": null, "activation": "softmax", "activity_regularizer": null}}]}