{"config": [{"config": {"mode": "concat", "layers": [{"config": [{"config": {"init": "uniform", "dropout": 0.2, "name": "embedding_1_semeval_model", "input_dim": 428669, "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dtype": "int32", "trainable": true, "mask_zero": false, "input_length": 140, "W_constraint": null, "output_dim": 52, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "nb_filter": 200, "name": "convolution1d_1_semeval_model", "init": "uniform", "filter_length": 6, "input_dim": null, "subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "input_length": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_semeval_model", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "nb_filter": 200, "name": "convolution1d_2_semeval_model", "init": "uniform", "filter_length": 6, "input_dim": null, "subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "input_length": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "dropout": 0.2, "name": "embedding_1_hul_model", "input_dim": 1062158, "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dtype": "int32", "trainable": true, "mask_zero": false, "input_length": 140, "W_constraint": null, "output_dim": 52, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "nb_filter": 200, "name": "convolution1d_1_hul_model", "init": "uniform", "filter_length": 6, "input_dim": null, "subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "input_length": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_hul_model", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "nb_filter": 200, "name": "convolution1d_2_hul_model", "init": "uniform", "filter_length": 6, "input_dim": null, "subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "input_length": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "dropout": 0.2, "name": "embedding_17_mpq_model", "input_dim": 428669, "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dtype": "int32", "trainable": true, "mask_zero": false, "input_length": 140, "W_constraint": null, "output_dim": 52, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "nb_filter": 200, "name": "convolution1d_33_mpq_model", "init": "uniform", "filter_length": 6, "input_dim": null, "subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "input_length": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_33_mpq_model", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "nb_filter": 200, "name": "convolution1d_34_mpq_model", "init": "uniform", "filter_length": 6, "input_dim": null, "subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "input_length": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "dropout": 0.2, "name": "embedding_1_dil_model", "input_dim": 1576890, "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dtype": "int32", "trainable": true, "mask_zero": false, "input_length": 140, "W_constraint": null, "output_dim": 52, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "nb_filter": 200, "name": "convolution1d_1_dil_model", "init": "uniform", "filter_length": 6, "input_dim": null, "subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "input_length": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_dil_model", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "nb_filter": 200, "name": "convolution1d_2_dil_model", "init": "uniform", "filter_length": 6, "input_dim": null, "subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "input_length": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "dropout": 0.2, "name": "embedding_1_dai_model", "input_dim": 1576890, "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dtype": "int32", "trainable": true, "mask_zero": false, "input_length": 140, "W_constraint": null, "output_dim": 52, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "nb_filter": 200, "name": "convolution1d_1_dai_model", "init": "uniform", "filter_length": 6, "input_dim": null, "subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "input_length": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_dai_model", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "nb_filter": 200, "name": "convolution1d_2_dai_model", "init": "uniform", "filter_length": 6, "input_dim": null, "subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "input_length": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "dropout": 0.2, "name": "embedding_1_tac_model", "input_dim": 428669, "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dtype": "int32", "trainable": true, "mask_zero": false, "input_length": 140, "W_constraint": null, "output_dim": 52, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "nb_filter": 200, "name": "convolution1d_1_tac_model", "init": "uniform", "filter_length": 6, "input_dim": null, "subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "input_length": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_tac_model", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "nb_filter": 200, "name": "convolution1d_2_tac_model", "init": "uniform", "filter_length": 6, "input_dim": null, "subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "input_length": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}], "output_shape_type": "raw", "dot_axes": -1, "name": "merge_1", "output_shape": null, "concat_axis": -1, "mode_type": "raw"}, "class_name": "Merge"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "init": "glorot_uniform", "name": "dense_1", "input_dim": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "output_dim": 200, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "softmax", "init": "glorot_uniform", "name": "dense_2", "input_dim": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "output_dim": 3, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}