{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_14", "dropout": 0.2, "activity_regularizer": null, "mask_zero": false, "init": "uniform", "batch_input_shape": [null, 140], "input_dim": 428669, "output_dim": 52, "W_regularizer": null, "input_dtype": "int32", "trainable": true, "input_length": 140, "W_constraint": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_14", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_27", "subsample_length": 1, "b_regularizer": null, "activity_regularizer": null, "filter_length": 6, "border_mode": "valid", "init": "uniform", "nb_filter": 200, "bias": true, "input_dim": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "input_length": null, "activation": "relu", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_27", "border_mode": "valid", "stride": 2, "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_28", "subsample_length": 1, "b_regularizer": null, "activity_regularizer": null, "filter_length": 6, "border_mode": "valid", "init": "uniform", "nb_filter": 200, "bias": true, "input_dim": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "input_length": null, "activation": "relu", "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_28", "border_mode": "valid", "stride": 66, "pool_length": 66, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_14", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_27", "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": null, "output_dim": 200, "W_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "linear", "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_14", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_28", "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": null, "output_dim": 3, "W_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "softmax", "W_constraint": null}}]}