{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"mode_type": "raw", "output_shape": null, "dot_axes": -1, "name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "dropout": 0.2, "trainable": true, "input_dim": 1576890, "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32", "name": "embedding_1_dai_model", "batch_input_shape": [null, 140], "output_dim": 52, "input_length": 140, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_dai_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "input_length": null, "subsample_length": 1, "name": "convolution1d_1_dai_model", "activation": "relu", "trainable": true, "init": "uniform", "filter_length": 6, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_dai_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "input_length": null, "subsample_length": 1, "name": "convolution1d_2_dai_model", "activation": "relu", "trainable": true, "init": "uniform", "filter_length": 6, "b_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "dropout": 0.2, "trainable": true, "input_dim": 1576890, "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32", "name": "embedding_1_dil_model", "batch_input_shape": [null, 140], "output_dim": 52, "input_length": 140, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_dil_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "input_length": null, "subsample_length": 1, "name": "convolution1d_1_dil_model", "activation": "relu", "trainable": true, "init": "uniform", "filter_length": 6, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_dil_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "input_length": null, "subsample_length": 1, "name": "convolution1d_2_dil_model", "activation": "relu", "trainable": true, "init": "uniform", "filter_length": 6, "b_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "dropout": 0.2, "trainable": true, "input_dim": 428669, "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32", "name": "embedding_17_mpq_model", "batch_input_shape": [null, 140], "output_dim": 52, "input_length": 140, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_17_mpq_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "input_length": null, "subsample_length": 1, "name": "convolution1d_33_mpq_model", "activation": "relu", "trainable": true, "init": "uniform", "filter_length": 6, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_33_mpq_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "input_length": null, "subsample_length": 1, "name": "convolution1d_34_mpq_model", "activation": "relu", "trainable": true, "init": "uniform", "filter_length": 6, "b_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "dropout": 0.2, "trainable": true, "input_dim": 428669, "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32", "name": "embedding_1_semeval_model", "batch_input_shape": [null, 140], "output_dim": 52, "input_length": 140, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_semeval_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "input_length": null, "subsample_length": 1, "name": "convolution1d_1_semeval_model", "activation": "relu", "trainable": true, "init": "uniform", "filter_length": 6, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_semeval_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "input_length": null, "subsample_length": 1, "name": "convolution1d_2_semeval_model", "activation": "relu", "trainable": true, "init": "uniform", "filter_length": 6, "b_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "dropout": 0.2, "trainable": true, "input_dim": 428669, "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "input_dtype": "int32", "name": "embedding_1_tac_model", "batch_input_shape": [null, 140], "output_dim": 52, "input_length": 140, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_tac_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "input_length": null, "subsample_length": 1, "name": "convolution1d_1_tac_model", "activation": "relu", "trainable": true, "init": "uniform", "filter_length": 6, "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_tac_model", "stride": 2}}, {"class_name": "Convolution1D", "config": {"input_dim": null, "nb_filter": 200, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "input_length": null, "subsample_length": 1, "name": "convolution1d_2_tac_model", "activation": "relu", "trainable": true, "init": "uniform", "filter_length": 6, "b_constraint": null}}]}], "concat_axis": -1, "mode": "concat", "output_shape_type": "raw"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "output_dim": 200, "trainable": true, "input_dim": null, "bias": true, "W_regularizer": null, "name": "dense_1", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "output_dim": 3, "trainable": true, "input_dim": null, "bias": true, "W_regularizer": null, "name": "dense_2", "b_constraint": null, "activation": "softmax", "activity_regularizer": null, "init": "glorot_uniform"}}], "keras_version": "1.1.1"}