{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"output_shape": null, "mode": "concat", "mode_type": "raw", "dot_axes": -1, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "W_regularizer": null, "init": "uniform", "output_dim": 52, "mask_zero": false, "name": "embedding_1_semeval_model", "activity_regularizer": null, "dropout": 0.2, "input_dtype": "int32", "W_constraint": null, "input_dim": 428669, "trainable": true, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_semeval_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "W_regularizer": null, "subsample_length": 1, "init": "uniform", "filter_length": 6, "b_constraint": null, "name": "convolution1d_1_semeval_model", "activity_regularizer": null, "bias": true, "nb_filter": 200, "W_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "W_regularizer": null, "subsample_length": 1, "init": "uniform", "filter_length": 6, "b_constraint": null, "name": "convolution1d_2_semeval_model", "activity_regularizer": null, "bias": true, "nb_filter": 200, "W_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "W_regularizer": null, "init": "uniform", "output_dim": 52, "mask_zero": false, "name": "embedding_1_tac_model", "activity_regularizer": null, "dropout": 0.2, "input_dtype": "int32", "W_constraint": null, "input_dim": 428669, "trainable": true, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_tac_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "W_regularizer": null, "subsample_length": 1, "init": "uniform", "filter_length": 6, "b_constraint": null, "name": "convolution1d_1_tac_model", "activity_regularizer": null, "bias": true, "nb_filter": 200, "W_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_tac_model", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "W_regularizer": null, "subsample_length": 1, "init": "uniform", "filter_length": 6, "b_constraint": null, "name": "convolution1d_2_tac_model", "activity_regularizer": null, "bias": true, "nb_filter": 200, "W_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "W_regularizer": null, "init": "uniform", "output_dim": 52, "mask_zero": false, "name": "embedding_1_hul_model", "activity_regularizer": null, "dropout": 0.2, "input_dtype": "int32", "W_constraint": null, "input_dim": 1062158, "trainable": true, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_hul_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "W_regularizer": null, "subsample_length": 1, "init": "uniform", "filter_length": 6, "b_constraint": null, "name": "convolution1d_1_hul_model", "activity_regularizer": null, "bias": true, "nb_filter": 200, "W_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_hul_model", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "W_regularizer": null, "subsample_length": 1, "init": "uniform", "filter_length": 6, "b_constraint": null, "name": "convolution1d_2_hul_model", "activity_regularizer": null, "bias": true, "nb_filter": 200, "W_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "W_regularizer": null, "init": "uniform", "output_dim": 52, "mask_zero": false, "name": "embedding_1_dil_model", "activity_regularizer": null, "dropout": 0.2, "input_dtype": "int32", "W_constraint": null, "input_dim": 1576890, "trainable": true, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_dil_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "W_regularizer": null, "subsample_length": 1, "init": "uniform", "filter_length": 6, "b_constraint": null, "name": "convolution1d_1_dil_model", "activity_regularizer": null, "bias": true, "nb_filter": 200, "W_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_dil_model", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "W_regularizer": null, "subsample_length": 1, "init": "uniform", "filter_length": 6, "b_constraint": null, "name": "convolution1d_2_dil_model", "activity_regularizer": null, "bias": true, "nb_filter": 200, "W_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "W_regularizer": null, "init": "uniform", "output_dim": 52, "mask_zero": false, "name": "embedding_17_mpq_model", "activity_regularizer": null, "dropout": 0.2, "input_dtype": "int32", "W_constraint": null, "input_dim": 428669, "trainable": true, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_17_mpq_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "W_regularizer": null, "subsample_length": 1, "init": "uniform", "filter_length": 6, "b_constraint": null, "name": "convolution1d_33_mpq_model", "activity_regularizer": null, "bias": true, "nb_filter": 200, "W_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "W_regularizer": null, "subsample_length": 1, "init": "uniform", "filter_length": 6, "b_constraint": null, "name": "convolution1d_34_mpq_model", "activity_regularizer": null, "bias": true, "nb_filter": 200, "W_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "input_length": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "W_regularizer": null, "init": "uniform", "output_dim": 52, "mask_zero": false, "name": "embedding_1_dai_model", "activity_regularizer": null, "dropout": 0.2, "input_dtype": "int32", "W_constraint": null, "input_dim": 1576890, "trainable": true, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_dai_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "W_regularizer": null, "subsample_length": 1, "init": "uniform", "filter_length": 6, "b_constraint": null, "name": "convolution1d_1_dai_model", "activity_regularizer": null, "bias": true, "nb_filter": 200, "W_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_dai_model", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "W_regularizer": null, "subsample_length": 1, "init": "uniform", "filter_length": 6, "b_constraint": null, "name": "convolution1d_2_dai_model", "activity_regularizer": null, "bias": true, "nb_filter": 200, "W_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "input_length": null}}]}], "output_shape_type": "raw", "name": "merge_1", "concat_axis": -1}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 200, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "bias": true, "W_constraint": null, "input_dim": null, "trainable": true, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 3, "activation": "softmax", "name": "dense_2", "activity_regularizer": null, "bias": true, "W_constraint": null, "input_dim": null, "trainable": true, "b_regularizer": null}}]}