{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "name": "embedding_1_dai_model", "input_length": 140, "input_dtype": "int32", "activity_regularizer": null, "dropout": 0.2, "input_dim": 1576890, "batch_input_shape": [null, 140], "W_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "filter_length": 6, "name": "convolution1d_1_dai_model", "input_dim": null, "subsample_length": 1, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "input_length": null, "activation": "relu", "b_constraint": null, "init": "uniform", "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_dai_model", "border_mode": "valid", "stride": 2, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "filter_length": 6, "name": "convolution1d_2_dai_model", "input_dim": null, "subsample_length": 1, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "input_length": null, "activation": "relu", "b_constraint": null, "init": "uniform", "nb_filter": 200}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "name": "embedding_1_semeval_model", "input_length": 140, "input_dtype": "int32", "activity_regularizer": null, "dropout": 0.2, "input_dim": 1576890, "batch_input_shape": [null, 140], "W_regularizer": null, "output_dim": 52, "trainable": true, "mask_zero": false, "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "filter_length": 6, "name": "convolution1d_1_semeval_model", "input_dim": null, "subsample_length": 1, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "input_length": null, "activation": "relu", "b_constraint": null, "init": "uniform", "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1_semeval_model", "border_mode": "valid", "stride": 2, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "filter_length": 6, "name": "convolution1d_2_semeval_model", "input_dim": null, "subsample_length": 1, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "input_length": null, "activation": "relu", "b_constraint": null, "init": "uniform", "nb_filter": 200}}]}], "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_shape": null, "mode": "concat", "output_shape_type": "raw"}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_1", "border_mode": "valid", "stride": 2, "trainable": true}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "filter_length": 6, "name": "convolution1d_1", "input_dim": null, "subsample_length": 1, "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "input_length": null, "activation": "relu", "b_constraint": null, "init": "uniform", "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "name": "maxpooling1d_2", "border_mode": "valid", "stride": 2, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias": true, "input_dim": null, "trainable": true, "W_regularizer": null, "output_dim": 200, "b_regularizer": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_2", "activity_regularizer": null, "bias": true, "input_dim": null, "trainable": true, "W_regularizer": null, "output_dim": 3, "b_regularizer": null, "activation": "softmax", "b_constraint": null, "init": "glorot_uniform"}}]}