{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"concat_axis": -1, "name": "merge_1", "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "mode": "concat", "output_shape": null, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "input_length": 140, "input_dtype": "int32", "trainable": true, "activity_regularizer": null, "mask_zero": false, "output_dim": 52, "dropout": 0.2, "W_regularizer": null, "batch_input_shape": [null, 140], "name": "embedding_1_dai_model", "init": "uniform", "input_dim": 1576890}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "input_length": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution1d_1_dai_model", "init": "uniform", "subsample_length": 1, "b_constraint": null, "activation": "relu", "bias": true, "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_dai_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "input_length": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution1d_2_dai_model", "init": "uniform", "subsample_length": 1, "b_constraint": null, "activation": "relu", "bias": true, "filter_length": 6}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "input_length": 140, "input_dtype": "int32", "trainable": true, "activity_regularizer": null, "mask_zero": false, "output_dim": 52, "dropout": 0.2, "W_regularizer": null, "batch_input_shape": [null, 140], "name": "embedding_1_hul_model", "init": "uniform", "input_dim": 1062158}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "input_length": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution1d_1_hul_model", "init": "uniform", "subsample_length": 1, "b_constraint": null, "activation": "relu", "bias": true, "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_hul_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "input_length": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution1d_2_hul_model", "init": "uniform", "subsample_length": 1, "b_constraint": null, "activation": "relu", "bias": true, "filter_length": 6}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "input_length": 140, "input_dtype": "int32", "trainable": true, "activity_regularizer": null, "mask_zero": false, "output_dim": 52, "dropout": 0.2, "W_regularizer": null, "batch_input_shape": [null, 140], "name": "embedding_17_mpq_model", "init": "uniform", "input_dim": 428669}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "input_length": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution1d_33_mpq_model", "init": "uniform", "subsample_length": 1, "b_constraint": null, "activation": "relu", "bias": true, "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_33_mpq_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "input_length": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution1d_34_mpq_model", "init": "uniform", "subsample_length": 1, "b_constraint": null, "activation": "relu", "bias": true, "filter_length": 6}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "input_length": 140, "input_dtype": "int32", "trainable": true, "activity_regularizer": null, "mask_zero": false, "output_dim": 52, "dropout": 0.2, "W_regularizer": null, "batch_input_shape": [null, 140], "name": "embedding_1_semeval_model", "init": "uniform", "input_dim": 428669}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "input_length": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution1d_1_semeval_model", "init": "uniform", "subsample_length": 1, "b_constraint": null, "activation": "relu", "bias": true, "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_semeval_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "input_length": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution1d_2_semeval_model", "init": "uniform", "subsample_length": 1, "b_constraint": null, "activation": "relu", "bias": true, "filter_length": 6}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "input_length": 140, "input_dtype": "int32", "trainable": true, "activity_regularizer": null, "mask_zero": false, "output_dim": 52, "dropout": 0.2, "W_regularizer": null, "batch_input_shape": [null, 140], "name": "embedding_1_tac_model", "init": "uniform", "input_dim": 428669}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "input_length": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution1d_1_tac_model", "init": "uniform", "subsample_length": 1, "b_constraint": null, "activation": "relu", "bias": true, "filter_length": 6}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_tac_model", "pool_length": 4, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"nb_filter": 200, "W_constraint": null, "input_length": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution1d_2_tac_model", "init": "uniform", "subsample_length": 1, "b_constraint": null, "activation": "relu", "bias": true, "filter_length": 6}}]}]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": null, "trainable": true, "output_dim": 200, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": null, "trainable": true, "output_dim": 3, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "b_constraint": null, "activation": "softmax", "bias": true}}], "keras_version": "1.1.1"}