{"config": [{"config": {"input_dtype": "int32", "output_dim": 52, "trainable": true, "name": "embedding_9", "input_dim": 1353244, "batch_input_shape": [null, 140], "input_length": 140, "init": "uniform", "W_regularizer": null, "mask_zero": false, "W_constraint": null, "dropout": 0.2, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"padding": 5, "trainable": true, "name": "zeropadding1d_9"}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "trainable": true, "name": "convolution1d_17", "input_dim": null, "border_mode": "valid", "b_constraint": null, "input_length": null, "init": "uniform", "W_regularizer": null, "subsample_length": 1, "filter_length": 6, "b_regularizer": null, "activation": "relu", "W_constraint": null, "bias": true, "activity_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_17"}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "trainable": true, "name": "convolution1d_18", "input_dim": null, "border_mode": "valid", "b_constraint": null, "input_length": null, "init": "uniform", "W_regularizer": null, "subsample_length": 1, "filter_length": 6, "b_regularizer": null, "activation": "relu", "W_constraint": null, "bias": true, "activity_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 66, "border_mode": "valid", "stride": 66, "trainable": true, "name": "maxpooling1d_18"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_9"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "output_dim": 200, "trainable": true, "name": "dense_17", "input_dim": null, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_9"}, "class_name": "Dropout"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "class_name": "Activation"}, {"config": {"activation": "softmax", "output_dim": 3, "trainable": true, "name": "dense_18", "input_dim": null, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.0"}