{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "W_constraint": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "input_length": 140, "output_dim": 52, "input_dtype": "int32", "init": "uniform", "dropout": 0.2, "name": "embedding_21", "input_dim": 428669, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_21", "padding": 5}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "trainable": true, "W_regularizer": null, "input_length": null, "b_constraint": null, "init": "uniform", "name": "convolution1d_41", "activation": "relu", "border_mode": "valid", "bias": true, "nb_filter": 200, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_41", "stride": 2}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "trainable": true, "W_regularizer": null, "input_length": null, "b_constraint": null, "init": "uniform", "name": "convolution1d_42", "activation": "relu", "border_mode": "valid", "bias": true, "nb_filter": 200, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_42", "stride": 66}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_21"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "b_constraint": null, "output_dim": 200, "init": "glorot_uniform", "name": "dense_41", "activation": "linear", "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_21"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_21", "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "b_constraint": null, "output_dim": 3, "init": "glorot_uniform", "name": "dense_42", "activation": "softmax", "bias": true}}]}