{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"concat_axis": -1, "output_shape": null, "name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "batch_input_shape": [null, 140], "name": "embedding_1_dil_model", "output_dim": 52, "init": "uniform", "input_dim": 1576890, "input_dtype": "int32", "dropout": 0.2, "W_regularizer": null, "input_length": 140, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dil_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"bias": true, "name": "convolution1d_1_dil_model", "activation": "relu", "init": "uniform", "b_regularizer": null, "input_dim": null, "subsample_length": 1, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "input_length": null, "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_1_dil_model"}}, {"class_name": "Convolution1D", "config": {"bias": true, "name": "convolution1d_2_dil_model", "activation": "relu", "init": "uniform", "b_regularizer": null, "input_dim": null, "subsample_length": 1, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "input_length": null, "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "batch_input_shape": [null, 140], "name": "embedding_1_hul_model", "output_dim": 52, "init": "uniform", "input_dim": 1062158, "input_dtype": "int32", "dropout": 0.2, "W_regularizer": null, "input_length": 140, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"bias": true, "name": "convolution1d_1_hul_model", "activation": "relu", "init": "uniform", "b_regularizer": null, "input_dim": null, "subsample_length": 1, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "input_length": null, "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_1_hul_model"}}, {"class_name": "Convolution1D", "config": {"bias": true, "name": "convolution1d_2_hul_model", "activation": "relu", "init": "uniform", "b_regularizer": null, "input_dim": null, "subsample_length": 1, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "input_length": null, "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "batch_input_shape": [null, 140], "name": "embedding_1_semeval_model", "output_dim": 52, "init": "uniform", "input_dim": 1576890, "input_dtype": "int32", "dropout": 0.2, "W_regularizer": null, "input_length": 140, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"bias": true, "name": "convolution1d_1_semeval_model", "activation": "relu", "init": "uniform", "b_regularizer": null, "input_dim": null, "subsample_length": 1, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "input_length": null, "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"bias": true, "name": "convolution1d_2_semeval_model", "activation": "relu", "init": "uniform", "b_regularizer": null, "input_dim": null, "subsample_length": 1, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "input_length": null, "trainable": true}}]}], "dot_axes": -1, "mode": "concat", "mode_type": "raw", "output_shape_type": "raw"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "pool_length": 4, "name": "maxpooling1d_1", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"bias": true, "name": "convolution1d_1", "trainable": true, "activation": "relu", "init": "uniform", "subsample_length": 1, "input_dim": null, "b_regularizer": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "input_length": null, "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "pool_length": 4, "name": "maxpooling1d_2", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_1", "output_dim": 200, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_2", "output_dim": 3, "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}], "keras_version": "1.1.1"}