{"keras_version": "1.1.0", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"init": "uniform", "dropout": 0.2, "input_dtype": "int32", "output_dim": 52, "mask_zero": false, "W_regularizer": null, "batch_input_shape": [null, 140], "name": "embedding_1", "input_dim": 2950660, "input_length": 140, "trainable": true, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1", "trainable": true}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "name": "convolution1d_1", "b_regularizer": null, "input_dim": null, "subsample_length": 1, "b_constraint": null, "trainable": true, "init": "uniform", "input_length": null, "W_constraint": null, "border_mode": "valid", "bias": true, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling1d_1", "stride": 2, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"filter_length": 6, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "name": "convolution1d_2", "b_regularizer": null, "input_dim": null, "subsample_length": 1, "b_constraint": null, "trainable": true, "init": "uniform", "input_length": null, "W_constraint": null, "border_mode": "valid", "bias": true, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling1d_2", "stride": 66, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "output_dim": 200, "activation": "linear", "W_regularizer": null, "name": "dense_1", "b_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "output_dim": 3, "activation": "softmax", "W_regularizer": null, "name": "dense_2", "b_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "W_constraint": null, "bias": true}}]}