{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "mode": "concat", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "output_dim": 52, "init": "uniform", "mask_zero": false, "input_dim": 1062158, "name": "embedding_1_hul_model", "batch_input_shape": [null, 140], "trainable": true, "W_constraint": null, "input_length": 140, "dropout": 0.2, "W_regularizer": null, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "name": "convolution1d_1_hul_model", "filter_length": 6, "trainable": true, "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_hul_model", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "name": "convolution1d_2_hul_model", "filter_length": 6, "trainable": true, "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_hul_model", "stride": 66, "trainable": true, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_hul_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "output_dim": 52, "init": "uniform", "mask_zero": false, "input_dim": 428669, "name": "embedding_1_semeval_model", "batch_input_shape": [null, 140], "trainable": true, "W_constraint": null, "input_length": 140, "dropout": 0.2, "W_regularizer": null, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "name": "convolution1d_1_semeval_model", "filter_length": 6, "trainable": true, "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_semeval_model", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "name": "convolution1d_2_semeval_model", "filter_length": 6, "trainable": true, "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_semeval_model", "stride": 66, "trainable": true, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_semeval_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "output_dim": 52, "init": "uniform", "mask_zero": false, "input_dim": 428669, "name": "embedding_17_mpq_model", "batch_input_shape": [null, 140], "trainable": true, "W_constraint": null, "input_length": 140, "dropout": 0.2, "W_regularizer": null, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "name": "convolution1d_33_mpq_model", "filter_length": 6, "trainable": true, "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_33_mpq_model", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "name": "convolution1d_34_mpq_model", "filter_length": 6, "trainable": true, "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_34_mpq_model", "stride": 66, "trainable": true, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_17_mpq_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "output_dim": 52, "init": "uniform", "mask_zero": false, "input_dim": 1576890, "name": "embedding_1_dil_model", "batch_input_shape": [null, 140], "trainable": true, "W_constraint": null, "input_length": 140, "dropout": 0.2, "W_regularizer": null, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "name": "convolution1d_1_dil_model", "filter_length": 6, "trainable": true, "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dil_model", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "name": "convolution1d_2_dil_model", "filter_length": 6, "trainable": true, "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dil_model", "stride": 66, "trainable": true, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dil_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "output_dim": 52, "init": "uniform", "mask_zero": false, "input_dim": 428669, "name": "embedding_1_tac_model", "batch_input_shape": [null, 140], "trainable": true, "W_constraint": null, "input_length": 140, "dropout": 0.2, "W_regularizer": null, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "name": "convolution1d_1_tac_model", "filter_length": 6, "trainable": true, "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_tac_model", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "name": "convolution1d_2_tac_model", "filter_length": 6, "trainable": true, "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_tac_model", "stride": 66, "trainable": true, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_tac_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "output_dim": 52, "init": "uniform", "mask_zero": false, "input_dim": 1576890, "name": "embedding_1_dai_model", "batch_input_shape": [null, 140], "trainable": true, "W_constraint": null, "input_length": 140, "dropout": 0.2, "W_regularizer": null, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "name": "convolution1d_1_dai_model", "filter_length": 6, "trainable": true, "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dai_model", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "init": "uniform", "nb_filter": 200, "input_dim": null, "b_constraint": null, "name": "convolution1d_2_dai_model", "filter_length": 6, "trainable": true, "subsample_length": 1, "activation": "relu", "input_length": null, "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dai_model", "stride": 66, "trainable": true, "border_mode": "valid", "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dai_model", "trainable": true}}]}], "dot_axes": -1, "mode_type": "raw", "output_shape_type": "raw", "concat_axis": -1, "output_shape": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "input_dim": null, "b_constraint": null, "name": "dense_1", "output_dim": 1028, "trainable": true, "W_constraint": null, "activation": "linear", "bias": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "input_dim": null, "b_constraint": null, "name": "dense_2", "output_dim": 3, "trainable": true, "W_constraint": null, "activation": "softmax", "bias": true, "W_regularizer": null}}], "keras_version": "1.1.1"}