{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "output_shape_type": "raw", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dtype": "int32", "trainable": true, "W_regularizer": null, "dropout": 0.2, "input_dim": 1576890, "output_dim": 52, "name": "embedding_1_dai_model", "input_length": 140, "mask_zero": false, "W_constraint": null, "init": "uniform", "activity_regularizer": null, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "subsample_length": 1, "b_regularizer": null, "trainable": true, "input_dim": null, "bias": true, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution1d_1_dai_model", "nb_filter": 200, "filter_length": 6, "input_length": null, "W_constraint": null, "init": "uniform", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_dai_model", "stride": 2, "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "subsample_length": 1, "b_regularizer": null, "trainable": true, "input_dim": null, "bias": true, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution1d_2_dai_model", "nb_filter": 200, "filter_length": 6, "input_length": null, "W_constraint": null, "init": "uniform", "activity_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dtype": "int32", "trainable": true, "W_regularizer": null, "dropout": 0.2, "input_dim": 1576890, "output_dim": 52, "name": "embedding_1_dil_model", "input_length": 140, "mask_zero": false, "W_constraint": null, "init": "uniform", "activity_regularizer": null, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "subsample_length": 1, "b_regularizer": null, "trainable": true, "input_dim": null, "bias": true, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution1d_1_dil_model", "nb_filter": 200, "filter_length": 6, "input_length": null, "W_constraint": null, "init": "uniform", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_dil_model", "stride": 2, "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "subsample_length": 1, "b_regularizer": null, "trainable": true, "input_dim": null, "bias": true, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution1d_2_dil_model", "nb_filter": 200, "filter_length": 6, "input_length": null, "W_constraint": null, "init": "uniform", "activity_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dtype": "int32", "trainable": true, "W_regularizer": null, "dropout": 0.2, "input_dim": 1062158, "output_dim": 52, "name": "embedding_1_hul_model", "input_length": 140, "mask_zero": false, "W_constraint": null, "init": "uniform", "activity_regularizer": null, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "subsample_length": 1, "b_regularizer": null, "trainable": true, "input_dim": null, "bias": true, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution1d_1_hul_model", "nb_filter": 200, "filter_length": 6, "input_length": null, "W_constraint": null, "init": "uniform", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_hul_model", "stride": 2, "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "subsample_length": 1, "b_regularizer": null, "trainable": true, "input_dim": null, "bias": true, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution1d_2_hul_model", "nb_filter": 200, "filter_length": 6, "input_length": null, "W_constraint": null, "init": "uniform", "activity_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dtype": "int32", "trainable": true, "W_regularizer": null, "dropout": 0.2, "input_dim": 428669, "output_dim": 52, "name": "embedding_17_mpq_model", "input_length": 140, "mask_zero": false, "W_constraint": null, "init": "uniform", "activity_regularizer": null, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "subsample_length": 1, "b_regularizer": null, "trainable": true, "input_dim": null, "bias": true, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution1d_33_mpq_model", "nb_filter": 200, "filter_length": 6, "input_length": null, "W_constraint": null, "init": "uniform", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "stride": 2, "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "subsample_length": 1, "b_regularizer": null, "trainable": true, "input_dim": null, "bias": true, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution1d_34_mpq_model", "nb_filter": 200, "filter_length": 6, "input_length": null, "W_constraint": null, "init": "uniform", "activity_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dtype": "int32", "trainable": true, "W_regularizer": null, "dropout": 0.2, "input_dim": 428669, "output_dim": 52, "name": "embedding_1_semeval_model", "input_length": 140, "mask_zero": false, "W_constraint": null, "init": "uniform", "activity_regularizer": null, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "subsample_length": 1, "b_regularizer": null, "trainable": true, "input_dim": null, "bias": true, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution1d_1_semeval_model", "nb_filter": 200, "filter_length": 6, "input_length": null, "W_constraint": null, "init": "uniform", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "stride": 2, "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "subsample_length": 1, "b_regularizer": null, "trainable": true, "input_dim": null, "bias": true, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution1d_2_semeval_model", "nb_filter": 200, "filter_length": 6, "input_length": null, "W_constraint": null, "init": "uniform", "activity_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dtype": "int32", "trainable": true, "W_regularizer": null, "dropout": 0.2, "input_dim": 428669, "output_dim": 52, "name": "embedding_1_tac_model", "input_length": 140, "mask_zero": false, "W_constraint": null, "init": "uniform", "activity_regularizer": null, "batch_input_shape": [null, 140]}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "subsample_length": 1, "b_regularizer": null, "trainable": true, "input_dim": null, "bias": true, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution1d_1_tac_model", "nb_filter": 200, "filter_length": 6, "input_length": null, "W_constraint": null, "init": "uniform", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "name": "maxpooling1d_1_tac_model", "stride": 2, "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_constraint": null, "subsample_length": 1, "b_regularizer": null, "trainable": true, "input_dim": null, "bias": true, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution1d_2_tac_model", "nb_filter": 200, "filter_length": 6, "input_length": null, "W_constraint": null, "init": "uniform", "activity_regularizer": null}}]}], "dot_axes": -1, "mode": "concat", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_1", "W_regularizer": null, "bias": true, "input_dim": null, "output_dim": 200, "activation": "linear", "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_2", "W_regularizer": null, "bias": true, "input_dim": null, "output_dim": 3, "activation": "softmax", "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}}]}