{"config": [{"config": {"mode_type": "raw", "concat_axis": -1, "name": "merge_1", "mode": "concat", "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "layers": [{"config": [{"config": {"batch_input_shape": [null, 140], "input_length": 140, "W_constraint": null, "input_dim": 1576890, "activity_regularizer": null, "output_dim": 52, "dropout": 0.2, "name": "embedding_1_dai_model", "input_dtype": "int32", "init": "uniform", "mask_zero": false, "W_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"W_constraint": null, "input_length": null, "border_mode": "valid", "input_dim": null, "activity_regularizer": null, "filter_length": 6, "b_regularizer": null, "name": "convolution1d_1_dai_model", "b_constraint": null, "init": "uniform", "subsample_length": 1, "nb_filter": 200, "bias": true, "activation": "relu", "W_regularizer": null, "trainable": true}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_dai_model", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"W_constraint": null, "input_length": null, "border_mode": "valid", "input_dim": null, "activity_regularizer": null, "filter_length": 6, "b_regularizer": null, "name": "convolution1d_2_dai_model", "b_constraint": null, "init": "uniform", "subsample_length": 1, "nb_filter": 200, "bias": true, "activation": "relu", "W_regularizer": null, "trainable": true}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "input_length": 140, "W_constraint": null, "input_dim": 1576890, "activity_regularizer": null, "output_dim": 52, "dropout": 0.2, "name": "embedding_1_dil_model", "input_dtype": "int32", "init": "uniform", "mask_zero": false, "W_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"W_constraint": null, "input_length": null, "border_mode": "valid", "input_dim": null, "activity_regularizer": null, "filter_length": 6, "b_regularizer": null, "name": "convolution1d_1_dil_model", "b_constraint": null, "init": "uniform", "subsample_length": 1, "nb_filter": 200, "bias": true, "activation": "relu", "W_regularizer": null, "trainable": true}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_dil_model", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"W_constraint": null, "input_length": null, "border_mode": "valid", "input_dim": null, "activity_regularizer": null, "filter_length": 6, "b_regularizer": null, "name": "convolution1d_2_dil_model", "b_constraint": null, "init": "uniform", "subsample_length": 1, "nb_filter": 200, "bias": true, "activation": "relu", "W_regularizer": null, "trainable": true}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "input_length": 140, "W_constraint": null, "input_dim": 1062158, "activity_regularizer": null, "output_dim": 52, "dropout": 0.2, "name": "embedding_1_hul_model", "input_dtype": "int32", "init": "uniform", "mask_zero": false, "W_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"W_constraint": null, "input_length": null, "border_mode": "valid", "input_dim": null, "activity_regularizer": null, "filter_length": 6, "b_regularizer": null, "name": "convolution1d_1_hul_model", "b_constraint": null, "init": "uniform", "subsample_length": 1, "nb_filter": 200, "bias": true, "activation": "relu", "W_regularizer": null, "trainable": true}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_hul_model", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"W_constraint": null, "input_length": null, "border_mode": "valid", "input_dim": null, "activity_regularizer": null, "filter_length": 6, "b_regularizer": null, "name": "convolution1d_2_hul_model", "b_constraint": null, "init": "uniform", "subsample_length": 1, "nb_filter": 200, "bias": true, "activation": "relu", "W_regularizer": null, "trainable": true}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "input_length": 140, "W_constraint": null, "input_dim": 428669, "activity_regularizer": null, "output_dim": 52, "dropout": 0.2, "name": "embedding_17_mpq_model", "input_dtype": "int32", "init": "uniform", "mask_zero": false, "W_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"W_constraint": null, "input_length": null, "border_mode": "valid", "input_dim": null, "activity_regularizer": null, "filter_length": 6, "b_regularizer": null, "name": "convolution1d_33_mpq_model", "b_constraint": null, "init": "uniform", "subsample_length": 1, "nb_filter": 200, "bias": true, "activation": "relu", "W_regularizer": null, "trainable": true}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_33_mpq_model", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"W_constraint": null, "input_length": null, "border_mode": "valid", "input_dim": null, "activity_regularizer": null, "filter_length": 6, "b_regularizer": null, "name": "convolution1d_34_mpq_model", "b_constraint": null, "init": "uniform", "subsample_length": 1, "nb_filter": 200, "bias": true, "activation": "relu", "W_regularizer": null, "trainable": true}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 140], "input_length": 140, "W_constraint": null, "input_dim": 428669, "activity_regularizer": null, "output_dim": 52, "dropout": 0.2, "name": "embedding_1_semeval_model", "input_dtype": "int32", "init": "uniform", "mask_zero": false, "W_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"W_constraint": null, "input_length": null, "border_mode": "valid", "input_dim": null, "activity_regularizer": null, "filter_length": 6, "b_regularizer": null, "name": "convolution1d_1_semeval_model", "b_constraint": null, "init": "uniform", "subsample_length": 1, "nb_filter": 200, "bias": true, "activation": "relu", "W_regularizer": null, "trainable": true}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "pool_length": 4, "name": "maxpooling1d_1_semeval_model", "stride": 2, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"W_constraint": null, "input_length": null, "border_mode": "valid", "input_dim": null, "activity_regularizer": null, "filter_length": 6, "b_regularizer": null, "name": "convolution1d_2_semeval_model", "b_constraint": null, "init": "uniform", "subsample_length": 1, "nb_filter": 200, "bias": true, "activation": "relu", "W_regularizer": null, "trainable": true}, "class_name": "Convolution1D"}], "class_name": "Sequential"}]}, "class_name": "Merge"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "input_dim": null, "activity_regularizer": null, "output_dim": 200, "b_regularizer": null, "name": "dense_1", "b_constraint": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "W_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"W_constraint": null, "input_dim": null, "activity_regularizer": null, "output_dim": 3, "b_regularizer": null, "name": "dense_2", "b_constraint": null, "init": "glorot_uniform", "bias": true, "activation": "softmax", "W_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}