{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"concat_axis": -1, "mode": "concat", "name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "trainable": true, "dropout": 0.2, "name": "embedding_1_tac_model", "input_length": 140, "batch_input_shape": [null, 140], "mask_zero": false, "init": "uniform", "input_dim": 428669, "W_regularizer": null, "activity_regularizer": null, "output_dim": 52, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_tac_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "trainable": true, "name": "convolution1d_1_tac_model", "input_length": null, "b_constraint": null, "init": "uniform", "input_dim": null, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "bias": true, "subsample_length": 1, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_tac_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "trainable": true, "name": "convolution1d_2_tac_model", "input_length": null, "b_constraint": null, "init": "uniform", "input_dim": null, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "bias": true, "subsample_length": 1, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_2_tac_model"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_tac_model"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "name": "dense_1_tac_model", "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "output_dim": 200, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1_tac_model"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1_tac_model"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "name": "dense_2_tac_model", "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias": true, "output_dim": 3, "b_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "trainable": true, "dropout": 0.2, "name": "embedding_1_semeval_model", "input_length": 140, "batch_input_shape": [null, 140], "mask_zero": false, "init": "uniform", "input_dim": 428669, "W_regularizer": null, "activity_regularizer": null, "output_dim": 52, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "trainable": true, "name": "convolution1d_1_semeval_model", "input_length": null, "b_constraint": null, "init": "uniform", "input_dim": null, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "bias": true, "subsample_length": 1, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "trainable": true, "name": "convolution1d_2_semeval_model", "input_length": null, "b_constraint": null, "init": "uniform", "input_dim": null, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "bias": true, "subsample_length": 1, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_2_semeval_model"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_semeval_model"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "name": "dense_1_semeval_model", "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "output_dim": 200, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1_semeval_model"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1_semeval_model"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "name": "dense_2_semeval_model", "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias": true, "output_dim": 3, "b_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "trainable": true, "dropout": 0.2, "name": "embedding_1_dil_model", "input_length": 140, "batch_input_shape": [null, 140], "mask_zero": false, "init": "uniform", "input_dim": 1576890, "W_regularizer": null, "activity_regularizer": null, "output_dim": 52, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_dil_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "trainable": true, "name": "convolution1d_1_dil_model", "input_length": null, "b_constraint": null, "init": "uniform", "input_dim": null, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "bias": true, "subsample_length": 1, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_dil_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "trainable": true, "name": "convolution1d_2_dil_model", "input_length": null, "b_constraint": null, "init": "uniform", "input_dim": null, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "bias": true, "subsample_length": 1, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_2_dil_model"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_dil_model"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "name": "dense_1_dil_model", "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "output_dim": 200, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1_dil_model"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1_dil_model"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "name": "dense_2_dil_model", "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias": true, "output_dim": 3, "b_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "trainable": true, "dropout": 0.2, "name": "embedding_17_mpq_model", "input_length": 140, "batch_input_shape": [null, 140], "mask_zero": false, "init": "uniform", "input_dim": 428669, "W_regularizer": null, "activity_regularizer": null, "output_dim": 52, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_17_mpq_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "trainable": true, "name": "convolution1d_33_mpq_model", "input_length": null, "b_constraint": null, "init": "uniform", "input_dim": null, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "bias": true, "subsample_length": 1, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_33_mpq_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "trainable": true, "name": "convolution1d_34_mpq_model", "input_length": null, "b_constraint": null, "init": "uniform", "input_dim": null, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "bias": true, "subsample_length": 1, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_34_mpq_model"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_17_mpq_model"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "name": "dense_33_mpq_model", "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "output_dim": 200, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_17_mpq_model"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_17_mpq_model"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "name": "dense_34_mpq_model", "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias": true, "output_dim": 3, "b_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "trainable": true, "dropout": 0.2, "name": "embedding_1_hul_model", "input_length": 140, "batch_input_shape": [null, 140], "mask_zero": false, "init": "uniform", "input_dim": 1062158, "W_regularizer": null, "activity_regularizer": null, "output_dim": 52, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_hul_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "trainable": true, "name": "convolution1d_1_hul_model", "input_length": null, "b_constraint": null, "init": "uniform", "input_dim": null, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "bias": true, "subsample_length": 1, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_hul_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "trainable": true, "name": "convolution1d_2_hul_model", "input_length": null, "b_constraint": null, "init": "uniform", "input_dim": null, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "bias": true, "subsample_length": 1, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_2_hul_model"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_hul_model"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "name": "dense_1_hul_model", "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "output_dim": 200, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1_hul_model"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1_hul_model"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "name": "dense_2_hul_model", "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias": true, "output_dim": 3, "b_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "trainable": true, "dropout": 0.2, "name": "embedding_1_dai_model", "input_length": 140, "batch_input_shape": [null, 140], "mask_zero": false, "init": "uniform", "input_dim": 1576890, "W_regularizer": null, "activity_regularizer": null, "output_dim": 52, "input_dtype": "int32"}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1_dai_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "trainable": true, "name": "convolution1d_1_dai_model", "input_length": null, "b_constraint": null, "init": "uniform", "input_dim": null, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "bias": true, "subsample_length": 1, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_dai_model"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "trainable": true, "name": "convolution1d_2_dai_model", "input_length": null, "b_constraint": null, "init": "uniform", "input_dim": null, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "bias": true, "subsample_length": 1, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 66, "trainable": true, "pool_length": 66, "name": "maxpooling1d_2_dai_model"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1_dai_model"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "name": "dense_1_dai_model", "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "output_dim": 200, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1_dai_model"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1_dai_model"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "name": "dense_2_dai_model", "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias": true, "output_dim": 3, "b_regularizer": null}}]}], "mode_type": "raw", "output_shape_type": "raw", "output_shape": null, "dot_axes": -1}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "name": "dense_1", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "bias": true, "output_dim": 256, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "name": "dense_2", "b_constraint": null, "init": "glorot_uniform", "activation": "softmax", "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "bias": true, "output_dim": 3, "b_regularizer": null}}]}