{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"output_shape_type": "raw", "mode_type": "raw", "name": "merge_1", "output_shape": null, "mode": "concat", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_dai_model", "input_dim": 1576890, "init": "uniform", "W_constraint": null, "activity_regularizer": null, "dropout": 0.2, "batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "output_dim": 52, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_dai_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_constraint": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "border_mode": "valid", "activation": "relu", "input_length": null, "W_regularizer": null, "subsample_length": 1, "bias": true, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "name": "maxpooling1d_1_dai_model", "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_dai_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_constraint": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "border_mode": "valid", "activation": "relu", "input_length": null, "W_regularizer": null, "subsample_length": 1, "bias": true, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 66, "name": "maxpooling1d_2_dai_model", "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dai_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_17_mpq_model", "input_dim": 428669, "init": "uniform", "W_constraint": null, "activity_regularizer": null, "dropout": 0.2, "batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "output_dim": 52, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_33_mpq_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_constraint": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "border_mode": "valid", "activation": "relu", "input_length": null, "W_regularizer": null, "subsample_length": 1, "bias": true, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "name": "maxpooling1d_33_mpq_model", "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_34_mpq_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_constraint": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "border_mode": "valid", "activation": "relu", "input_length": null, "W_regularizer": null, "subsample_length": 1, "bias": true, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 66, "name": "maxpooling1d_34_mpq_model", "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_17_mpq_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_tac_model", "input_dim": 428669, "init": "uniform", "W_constraint": null, "activity_regularizer": null, "dropout": 0.2, "batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "output_dim": 52, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_tac_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_constraint": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "border_mode": "valid", "activation": "relu", "input_length": null, "W_regularizer": null, "subsample_length": 1, "bias": true, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "name": "maxpooling1d_1_tac_model", "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_tac_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_constraint": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "border_mode": "valid", "activation": "relu", "input_length": null, "W_regularizer": null, "subsample_length": 1, "bias": true, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 66, "name": "maxpooling1d_2_tac_model", "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_tac_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_dil_model", "input_dim": 1576890, "init": "uniform", "W_constraint": null, "activity_regularizer": null, "dropout": 0.2, "batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "output_dim": 52, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_dil_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_constraint": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "border_mode": "valid", "activation": "relu", "input_length": null, "W_regularizer": null, "subsample_length": 1, "bias": true, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "name": "maxpooling1d_1_dil_model", "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_dil_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_constraint": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "border_mode": "valid", "activation": "relu", "input_length": null, "W_regularizer": null, "subsample_length": 1, "bias": true, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 66, "name": "maxpooling1d_2_dil_model", "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dil_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_hul_model", "input_dim": 1062158, "init": "uniform", "W_constraint": null, "activity_regularizer": null, "dropout": 0.2, "batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "output_dim": 52, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_hul_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_constraint": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "border_mode": "valid", "activation": "relu", "input_length": null, "W_regularizer": null, "subsample_length": 1, "bias": true, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "name": "maxpooling1d_1_hul_model", "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_hul_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_constraint": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "border_mode": "valid", "activation": "relu", "input_length": null, "W_regularizer": null, "subsample_length": 1, "bias": true, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 66, "name": "maxpooling1d_2_hul_model", "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_hul_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_semeval_model", "input_dim": 428669, "init": "uniform", "W_constraint": null, "activity_regularizer": null, "dropout": 0.2, "batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "output_dim": 52, "input_dtype": "int32", "mask_zero": false, "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_semeval_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_constraint": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "border_mode": "valid", "activation": "relu", "input_length": null, "W_regularizer": null, "subsample_length": 1, "bias": true, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 4, "name": "maxpooling1d_1_semeval_model", "border_mode": "valid", "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_semeval_model", "input_dim": null, "filter_length": 6, "b_constraint": null, "nb_filter": 200, "W_constraint": null, "activity_regularizer": null, "init": "uniform", "trainable": true, "border_mode": "valid", "activation": "relu", "input_length": null, "W_regularizer": null, "subsample_length": 1, "bias": true, "b_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 66, "name": "maxpooling1d_2_semeval_model", "border_mode": "valid", "stride": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1_semeval_model", "trainable": true}}]}], "concat_axis": -1, "dot_axes": -1}}, {"class_name": "Dense", "config": {"name": "dense_1", "input_dim": null, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 1028, "activation": "linear", "W_regularizer": null, "bias": true, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "input_dim": null, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 3, "activation": "softmax", "W_regularizer": null, "bias": true, "b_regularizer": null}}]}