{"config": [{"config": {"output_shape_type": "raw", "layers": [{"config": [{"config": {"activity_regularizer": null, "output_dim": 52, "batch_input_shape": [null, 140], "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "W_regularizer": null, "name": "embedding_1_hul_model", "input_dim": 1062158, "mask_zero": false, "input_length": 140, "trainable": true, "W_constraint": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_hul_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "W_constraint": null, "nb_filter": 200, "b_constraint": null, "activity_regularizer": null, "bias": true, "init": "uniform", "W_regularizer": null, "name": "convolution1d_1_hul_model", "filter_length": 6, "input_dim": null, "border_mode": "valid", "activation": "relu", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_1_hul_model", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "W_constraint": null, "nb_filter": 200, "b_constraint": null, "activity_regularizer": null, "bias": true, "init": "uniform", "W_regularizer": null, "name": "convolution1d_2_hul_model", "filter_length": 6, "input_dim": null, "border_mode": "valid", "activation": "relu", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"activity_regularizer": null, "output_dim": 52, "batch_input_shape": [null, 140], "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "W_regularizer": null, "name": "embedding_17_mpq_model", "input_dim": 428669, "mask_zero": false, "input_length": 140, "trainable": true, "W_constraint": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_17_mpq_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "W_constraint": null, "nb_filter": 200, "b_constraint": null, "activity_regularizer": null, "bias": true, "init": "uniform", "W_regularizer": null, "name": "convolution1d_33_mpq_model", "filter_length": 6, "input_dim": null, "border_mode": "valid", "activation": "relu", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_33_mpq_model", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "W_constraint": null, "nb_filter": 200, "b_constraint": null, "activity_regularizer": null, "bias": true, "init": "uniform", "W_regularizer": null, "name": "convolution1d_34_mpq_model", "filter_length": 6, "input_dim": null, "border_mode": "valid", "activation": "relu", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"activity_regularizer": null, "output_dim": 52, "batch_input_shape": [null, 140], "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "W_regularizer": null, "name": "embedding_1_semeval_model", "input_dim": 428669, "mask_zero": false, "input_length": 140, "trainable": true, "W_constraint": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_semeval_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "W_constraint": null, "nb_filter": 200, "b_constraint": null, "activity_regularizer": null, "bias": true, "init": "uniform", "W_regularizer": null, "name": "convolution1d_1_semeval_model", "filter_length": 6, "input_dim": null, "border_mode": "valid", "activation": "relu", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_1_semeval_model", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "W_constraint": null, "nb_filter": 200, "b_constraint": null, "activity_regularizer": null, "bias": true, "init": "uniform", "W_regularizer": null, "name": "convolution1d_2_semeval_model", "filter_length": 6, "input_dim": null, "border_mode": "valid", "activation": "relu", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"activity_regularizer": null, "output_dim": 52, "batch_input_shape": [null, 140], "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "W_regularizer": null, "name": "embedding_1_tac_model", "input_dim": 428669, "mask_zero": false, "input_length": 140, "trainable": true, "W_constraint": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_tac_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "W_constraint": null, "nb_filter": 200, "b_constraint": null, "activity_regularizer": null, "bias": true, "init": "uniform", "W_regularizer": null, "name": "convolution1d_1_tac_model", "filter_length": 6, "input_dim": null, "border_mode": "valid", "activation": "relu", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_1_tac_model", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "W_constraint": null, "nb_filter": 200, "b_constraint": null, "activity_regularizer": null, "bias": true, "init": "uniform", "W_regularizer": null, "name": "convolution1d_2_tac_model", "filter_length": 6, "input_dim": null, "border_mode": "valid", "activation": "relu", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"activity_regularizer": null, "output_dim": 52, "batch_input_shape": [null, 140], "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "W_regularizer": null, "name": "embedding_1_dil_model", "input_dim": 1576890, "mask_zero": false, "input_length": 140, "trainable": true, "W_constraint": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_dil_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "W_constraint": null, "nb_filter": 200, "b_constraint": null, "activity_regularizer": null, "bias": true, "init": "uniform", "W_regularizer": null, "name": "convolution1d_1_dil_model", "filter_length": 6, "input_dim": null, "border_mode": "valid", "activation": "relu", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_1_dil_model", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "W_constraint": null, "nb_filter": 200, "b_constraint": null, "activity_regularizer": null, "bias": true, "init": "uniform", "W_regularizer": null, "name": "convolution1d_2_dil_model", "filter_length": 6, "input_dim": null, "border_mode": "valid", "activation": "relu", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"activity_regularizer": null, "output_dim": 52, "batch_input_shape": [null, 140], "input_dtype": "int32", "dropout": 0.2, "init": "uniform", "W_regularizer": null, "name": "embedding_1_dai_model", "input_dim": 1576890, "mask_zero": false, "input_length": 140, "trainable": true, "W_constraint": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1_dai_model", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "W_constraint": null, "nb_filter": 200, "b_constraint": null, "activity_regularizer": null, "bias": true, "init": "uniform", "W_regularizer": null, "name": "convolution1d_1_dai_model", "filter_length": 6, "input_dim": null, "border_mode": "valid", "activation": "relu", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "border_mode": "valid", "trainable": true, "name": "maxpooling1d_1_dai_model", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"b_regularizer": null, "subsample_length": 1, "W_constraint": null, "nb_filter": 200, "b_constraint": null, "activity_regularizer": null, "bias": true, "init": "uniform", "W_regularizer": null, "name": "convolution1d_2_dai_model", "filter_length": 6, "input_dim": null, "border_mode": "valid", "activation": "relu", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}], "concat_axis": -1, "dot_axes": -1, "name": "merge_1", "mode_type": "raw", "mode": "concat", "output_shape": null}, "class_name": "Merge"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "activity_regularizer": null, "output_dim": 200, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_1", "b_constraint": null, "input_dim": null, "activation": "linear", "trainable": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "activity_regularizer": null, "output_dim": 3, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_2", "b_constraint": null, "input_dim": null, "activation": "softmax", "trainable": true, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}