{"config": [{"config": {"input_length": 140, "input_dtype": "int32", "W_regularizer": null, "batch_input_shape": [null, 140], "init": "uniform", "W_constraint": null, "trainable": true, "name": "embedding_1", "dropout": 0.2, "output_dim": 52, "input_dim": 1576890, "activity_regularizer": null, "mask_zero": false}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_1"}, "class_name": "ZeroPadding1D"}, {"config": {"input_length": null, "activation": "relu", "trainable": true, "filter_length": 6, "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "init": "uniform", "b_regularizer": null, "subsample_length": 1, "input_dim": null, "border_mode": "valid", "name": "convolution1d_1", "W_constraint": null, "activity_regularizer": null, "bias": true}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "trainable": true, "name": "maxpooling1d_1", "border_mode": "valid", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"input_length": null, "activation": "relu", "trainable": true, "filter_length": 6, "b_constraint": null, "W_regularizer": null, "nb_filter": 200, "init": "uniform", "b_regularizer": null, "subsample_length": 1, "input_dim": null, "border_mode": "valid", "name": "convolution1d_2", "W_constraint": null, "activity_regularizer": null, "bias": true}, "class_name": "Convolution1D"}, {"config": {"pool_length": 66, "trainable": true, "name": "maxpooling1d_2", "border_mode": "valid", "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "bias": true, "name": "dense_1", "output_dim": 200, "input_dim": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"activation": "softmax", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "bias": true, "name": "dense_2", "output_dim": 3, "input_dim": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.0"}