{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "dropout": 0.2, "name": "embedding_2", "init": "uniform", "input_dim": 428669, "W_constraint": null, "mask_zero": false, "input_dtype": "int32", "trainable": true, "batch_input_shape": [null, 140], "W_regularizer": null, "output_dim": 52, "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_2", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "bias": true, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "b_constraint": null, "name": "convolution1d_3", "init": "uniform", "input_dim": null, "nb_filter": 200, "activation": "relu", "trainable": true, "border_mode": "valid", "W_regularizer": null, "filter_length": 6, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_3", "pool_length": 4, "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "bias": true, "b_regularizer": null, "subsample_length": 1, "W_constraint": null, "b_constraint": null, "name": "convolution1d_4", "init": "uniform", "input_dim": null, "nb_filter": 200, "activation": "relu", "trainable": true, "border_mode": "valid", "W_regularizer": null, "filter_length": 6, "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 66, "name": "maxpooling1d_4", "pool_length": 66, "trainable": true, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "name": "dense_3", "init": "glorot_uniform", "input_dim": null, "activation": "linear", "trainable": true, "output_dim": 200, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "name": "dense_4", "init": "glorot_uniform", "input_dim": null, "activation": "softmax", "trainable": true, "output_dim": 3, "W_regularizer": null, "W_constraint": null}}]}