{"config": [{"config": {"input_length": 140, "init": "uniform", "input_dim": 1576890, "dropout": 0.2, "output_dim": 52, "trainable": true, "name": "embedding_41", "activity_regularizer": null, "mask_zero": false, "batch_input_shape": [null, 140], "input_dtype": "int32", "W_constraint": null, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "padding": 5, "name": "zeropadding1d_41"}, "class_name": "ZeroPadding1D"}, {"config": {"input_length": null, "init": "uniform", "border_mode": "valid", "input_dim": null, "bias": true, "trainable": true, "activity_regularizer": null, "name": "convolution1d_81", "b_constraint": null, "b_regularizer": null, "subsample_length": 1, "nb_filter": 200, "W_constraint": null, "W_regularizer": null, "filter_length": 6, "activation": "relu"}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_81", "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"input_length": null, "init": "uniform", "border_mode": "valid", "input_dim": null, "bias": true, "trainable": true, "activity_regularizer": null, "name": "convolution1d_82", "b_constraint": null, "b_regularizer": null, "subsample_length": 1, "nb_filter": 200, "W_constraint": null, "W_regularizer": null, "filter_length": 6, "activation": "relu"}, "class_name": "Convolution1D"}, {"config": {"pool_length": 66, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_82", "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_41"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "input_dim": null, "output_dim": 200, "trainable": true, "activity_regularizer": null, "name": "dense_81", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "bias": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_41"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_41", "activation": "relu"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "input_dim": null, "output_dim": 3, "trainable": true, "activity_regularizer": null, "name": "dense_82", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "bias": true, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.0"}