{"config": [{"config": {"mode": "concat", "mode_type": "raw", "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "name": "merge_1", "concat_axis": -1, "layers": [{"config": [{"config": {"mask_zero": false, "input_dim": 1062158, "input_dtype": "int32", "W_regularizer": null, "activity_regularizer": null, "input_length": 140, "dropout": 0.2, "W_constraint": null, "output_dim": 52, "trainable": true, "init": "uniform", "name": "embedding_1_hul_model", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "input_dim": null, "filter_length": 6, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "input_length": null, "border_mode": "valid", "nb_filter": 200, "activation": "relu", "trainable": true, "bias": true, "name": "convolution1d_1_hul_model", "b_constraint": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_hul_model", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "input_dim": null, "filter_length": 6, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "input_length": null, "border_mode": "valid", "nb_filter": 200, "activation": "relu", "trainable": true, "bias": true, "name": "convolution1d_2_hul_model", "b_constraint": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"mask_zero": false, "input_dim": 1576890, "input_dtype": "int32", "W_regularizer": null, "activity_regularizer": null, "input_length": 140, "dropout": 0.2, "W_constraint": null, "output_dim": 52, "trainable": true, "init": "uniform", "name": "embedding_1_semeval_model", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "input_dim": null, "filter_length": 6, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "input_length": null, "border_mode": "valid", "nb_filter": 200, "activation": "relu", "trainable": true, "bias": true, "name": "convolution1d_1_semeval_model", "b_constraint": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "input_dim": null, "filter_length": 6, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "input_length": null, "border_mode": "valid", "nb_filter": 200, "activation": "relu", "trainable": true, "bias": true, "name": "convolution1d_2_semeval_model", "b_constraint": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"mask_zero": false, "input_dim": 428669, "input_dtype": "int32", "W_regularizer": null, "activity_regularizer": null, "input_length": 140, "dropout": 0.2, "W_constraint": null, "output_dim": 52, "trainable": true, "init": "uniform", "name": "embedding_1_tac_model", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "input_dim": null, "filter_length": 6, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "input_length": null, "border_mode": "valid", "nb_filter": 200, "activation": "relu", "trainable": true, "bias": true, "name": "convolution1d_1_tac_model", "b_constraint": null}, "class_name": "Convolution1D"}, {"config": {"pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1_tac_model", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "init": "uniform", "W_constraint": null, "input_dim": null, "filter_length": 6, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "input_length": null, "border_mode": "valid", "nb_filter": 200, "activation": "relu", "trainable": true, "bias": true, "name": "convolution1d_2_tac_model", "b_constraint": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}]}, "class_name": "Merge"}, {"config": {"stride": 2, "name": "maxpooling1d_1", "trainable": true, "pool_length": 4, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "nb_filter": 200, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "input_length": null, "bias": true, "border_mode": "valid", "W_constraint": null, "b_constraint": null, "trainable": true, "init": "uniform", "name": "convolution1d_1", "filter_length": 6}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "name": "maxpooling1d_2", "trainable": true, "pool_length": 4, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "output_dim": 200, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "trainable": true, "bias": true, "name": "dense_1", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": null, "output_dim": 3, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "activation": "softmax", "W_constraint": null, "b_constraint": null, "trainable": true, "bias": true, "name": "dense_2", "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}