{"keras_version": "1.1.1", "config": [{"config": {"name": "merge_1", "mode": "concat", "concat_axis": -1, "layers": [{"config": [{"config": {"name": "embedding_1_hul_model", "input_length": 140, "output_dim": 52, "init": "uniform", "trainable": true, "W_constraint": null, "dropout": 0.2, "mask_zero": false, "W_regularizer": null, "activity_regularizer": null, "input_dim": 1062158, "input_dtype": "int32", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"name": "convolution1d_1_hul_model", "input_length": null, "init": "uniform", "nb_filter": 200, "trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "input_dim": null, "activation": "relu", "W_regularizer": null, "bias": true, "activity_regularizer": null, "filter_length": 6, "border_mode": "valid", "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_hul_model", "border_mode": "valid", "trainable": true, "pool_length": 4, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"name": "convolution1d_2_hul_model", "input_length": null, "init": "uniform", "nb_filter": 200, "trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "input_dim": null, "activation": "relu", "W_regularizer": null, "bias": true, "activity_regularizer": null, "filter_length": 6, "border_mode": "valid", "subsample_length": 1}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"name": "embedding_1_semeval_model", "input_length": 140, "output_dim": 52, "init": "uniform", "trainable": true, "W_constraint": null, "dropout": 0.2, "mask_zero": false, "W_regularizer": null, "activity_regularizer": null, "input_dim": 1576890, "input_dtype": "int32", "batch_input_shape": [null, 140]}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"name": "convolution1d_1_semeval_model", "input_length": null, "init": "uniform", "nb_filter": 200, "trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "input_dim": null, "activation": "relu", "W_regularizer": null, "bias": true, "activity_regularizer": null, "filter_length": 6, "border_mode": "valid", "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_semeval_model", "border_mode": "valid", "trainable": true, "pool_length": 4, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"name": "convolution1d_2_semeval_model", "input_length": null, "init": "uniform", "nb_filter": 200, "trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "input_dim": null, "activation": "relu", "W_regularizer": null, "bias": true, "activity_regularizer": null, "filter_length": 6, "border_mode": "valid", "subsample_length": 1}, "class_name": "Convolution1D"}], "class_name": "Sequential"}], "mode_type": "raw", "dot_axes": -1, "output_shape_type": "raw", "output_shape": null}, "class_name": "Merge"}, {"config": {"name": "maxpooling1d_1", "border_mode": "valid", "trainable": true, "pool_length": 4, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"name": "convolution1d_1", "input_length": null, "init": "uniform", "nb_filter": 200, "trainable": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "border_mode": "valid", "activation": "relu", "W_regularizer": null, "bias": true, "activity_regularizer": null, "filter_length": 6, "input_dim": null, "subsample_length": 1}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_2", "border_mode": "valid", "trainable": true, "pool_length": 4, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "output_dim": 200, "bias": true, "trainable": true, "b_regularizer": null, "W_constraint": null, "input_dim": null, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dense_2", "output_dim": 3, "bias": true, "trainable": true, "b_regularizer": null, "W_constraint": null, "input_dim": null, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}