{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "dot_axes": -1, "concat_axis": -1, "output_shape_type": "raw", "mode_type": "raw", "output_shape": null, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "name": "embedding_17_mpq_model", "input_dim": 428669, "W_constraint": null, "trainable": true, "mask_zero": false, "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "init": "uniform", "dropout": 0.2, "input_dtype": "int32", "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_33_mpq_model", "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "activation": "relu", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_constraint": null, "input_length": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_33_mpq_model", "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_34_mpq_model", "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "activation": "relu", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_constraint": null, "input_length": null, "subsample_length": 1, "nb_filter": 200}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "name": "embedding_1_tac_model", "input_dim": 428669, "W_constraint": null, "trainable": true, "mask_zero": false, "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "init": "uniform", "dropout": 0.2, "input_dtype": "int32", "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_tac_model", "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "activation": "relu", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_constraint": null, "input_length": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_tac_model", "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_tac_model", "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "activation": "relu", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_constraint": null, "input_length": null, "subsample_length": 1, "nb_filter": 200}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "name": "embedding_1_dil_model", "input_dim": 1576890, "W_constraint": null, "trainable": true, "mask_zero": false, "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "init": "uniform", "dropout": 0.2, "input_dtype": "int32", "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_dil_model", "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "activation": "relu", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_constraint": null, "input_length": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_dil_model", "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_dil_model", "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "activation": "relu", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_constraint": null, "input_length": null, "subsample_length": 1, "nb_filter": 200}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "name": "embedding_1_hul_model", "input_dim": 1062158, "W_constraint": null, "trainable": true, "mask_zero": false, "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "init": "uniform", "dropout": 0.2, "input_dtype": "int32", "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_hul_model", "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "activation": "relu", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_constraint": null, "input_length": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_hul_model", "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_hul_model", "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "activation": "relu", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_constraint": null, "input_length": null, "subsample_length": 1, "nb_filter": 200}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "name": "embedding_1_semeval_model", "input_dim": 428669, "W_constraint": null, "trainable": true, "mask_zero": false, "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "init": "uniform", "dropout": 0.2, "input_dtype": "int32", "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_semeval_model", "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "activation": "relu", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_constraint": null, "input_length": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_semeval_model", "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_semeval_model", "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "activation": "relu", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_constraint": null, "input_length": null, "subsample_length": 1, "nb_filter": 200}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "name": "embedding_1_dai_model", "input_dim": 1576890, "W_constraint": null, "trainable": true, "mask_zero": false, "output_dim": 52, "W_regularizer": null, "activity_regularizer": null, "init": "uniform", "dropout": 0.2, "input_dtype": "int32", "input_length": 140}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_dai_model", "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "activation": "relu", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_constraint": null, "input_length": null, "subsample_length": 1, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "name": "maxpooling1d_1_dai_model", "border_mode": "valid", "pool_length": 4, "trainable": true}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_dai_model", "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "activation": "relu", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "init": "uniform", "filter_length": 6, "b_constraint": null, "input_length": null, "subsample_length": 1, "nb_filter": 200}}]}], "mode": "concat"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias": true, "W_constraint": null, "trainable": true, "activation": "linear", "output_dim": 200, "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias": true, "W_constraint": null, "trainable": true, "activation": "softmax", "output_dim": 3, "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null}}]}