{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "output_dim": 52, "W_constraint": null, "W_regularizer": null, "mask_zero": false, "init": "uniform", "trainable": true, "dropout": 0.2, "input_length": 140, "batch_input_shape": [null, 140], "input_dtype": "int32", "input_dim": 2950660, "activity_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1", "border_mode": "valid", "W_constraint": null, "init": "uniform", "W_regularizer": null, "filter_length": 6, "trainable": true, "input_length": null, "b_regularizer": null, "subsample_length": 1, "bias": true, "nb_filter": 200, "b_constraint": null, "input_dim": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1", "stride": 2, "border_mode": "valid", "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2", "border_mode": "valid", "W_constraint": null, "init": "uniform", "W_regularizer": null, "filter_length": 6, "trainable": true, "input_length": null, "b_regularizer": null, "subsample_length": 1, "bias": true, "nb_filter": 200, "b_constraint": null, "input_dim": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2", "stride": 66, "border_mode": "valid", "trainable": true, "pool_length": 66}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "output_dim": 200, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "output_dim": 3, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": null, "activation": "softmax", "activity_regularizer": null}}]}