{"config": [{"class_name": "Merge", "config": {"output_shape_type": "raw", "name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"config": {"W_regularizer": null, "name": "embedding_1_dai_model", "dropout": 0.2, "input_dtype": "int32", "trainable": true, "init": "uniform", "output_dim": 52, "input_length": 140, "input_dim": 1576890, "W_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 140], "mask_zero": false}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_dai_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "name": "convolution1d_1_dai_model", "b_regularizer": null, "filter_length": 6, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_constraint": null, "border_mode": "valid", "bias": true, "input_dim": null, "W_constraint": null, "subsample_length": 1, "input_length": null, "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "name": "maxpooling1d_1_dai_model", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "name": "convolution1d_2_dai_model", "b_regularizer": null, "filter_length": 6, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_constraint": null, "border_mode": "valid", "bias": true, "input_dim": null, "W_constraint": null, "subsample_length": 1, "input_length": null, "nb_filter": 200}, "class_name": "Convolution1D"}]}, {"class_name": "Sequential", "config": [{"config": {"W_regularizer": null, "name": "embedding_1_dil_model", "dropout": 0.2, "input_dtype": "int32", "trainable": true, "init": "uniform", "output_dim": 52, "input_length": 140, "input_dim": 1576890, "W_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 140], "mask_zero": false}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_dil_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "name": "convolution1d_1_dil_model", "b_regularizer": null, "filter_length": 6, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_constraint": null, "border_mode": "valid", "bias": true, "input_dim": null, "W_constraint": null, "subsample_length": 1, "input_length": null, "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "name": "maxpooling1d_1_dil_model", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "name": "convolution1d_2_dil_model", "b_regularizer": null, "filter_length": 6, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_constraint": null, "border_mode": "valid", "bias": true, "input_dim": null, "W_constraint": null, "subsample_length": 1, "input_length": null, "nb_filter": 200}, "class_name": "Convolution1D"}]}, {"class_name": "Sequential", "config": [{"config": {"W_regularizer": null, "name": "embedding_1_hul_model", "dropout": 0.2, "input_dtype": "int32", "trainable": true, "init": "uniform", "output_dim": 52, "input_length": 140, "input_dim": 1062158, "W_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 140], "mask_zero": false}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "name": "convolution1d_1_hul_model", "b_regularizer": null, "filter_length": 6, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_constraint": null, "border_mode": "valid", "bias": true, "input_dim": null, "W_constraint": null, "subsample_length": 1, "input_length": null, "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "name": "maxpooling1d_1_hul_model", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "name": "convolution1d_2_hul_model", "b_regularizer": null, "filter_length": 6, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_constraint": null, "border_mode": "valid", "bias": true, "input_dim": null, "W_constraint": null, "subsample_length": 1, "input_length": null, "nb_filter": 200}, "class_name": "Convolution1D"}]}, {"class_name": "Sequential", "config": [{"config": {"W_regularizer": null, "name": "embedding_17_mpq_model", "dropout": 0.2, "input_dtype": "int32", "trainable": true, "init": "uniform", "output_dim": 52, "input_length": 140, "input_dim": 428669, "W_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 140], "mask_zero": false}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_17_mpq_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "name": "convolution1d_33_mpq_model", "b_regularizer": null, "filter_length": 6, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_constraint": null, "border_mode": "valid", "bias": true, "input_dim": null, "W_constraint": null, "subsample_length": 1, "input_length": null, "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "name": "convolution1d_34_mpq_model", "b_regularizer": null, "filter_length": 6, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_constraint": null, "border_mode": "valid", "bias": true, "input_dim": null, "W_constraint": null, "subsample_length": 1, "input_length": null, "nb_filter": 200}, "class_name": "Convolution1D"}]}, {"class_name": "Sequential", "config": [{"config": {"W_regularizer": null, "name": "embedding_1_semeval_model", "dropout": 0.2, "input_dtype": "int32", "trainable": true, "init": "uniform", "output_dim": 52, "input_length": 140, "input_dim": 428669, "W_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 140], "mask_zero": false}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "name": "convolution1d_1_semeval_model", "b_regularizer": null, "filter_length": 6, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_constraint": null, "border_mode": "valid", "bias": true, "input_dim": null, "W_constraint": null, "subsample_length": 1, "input_length": null, "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "name": "convolution1d_2_semeval_model", "b_regularizer": null, "filter_length": 6, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_constraint": null, "border_mode": "valid", "bias": true, "input_dim": null, "W_constraint": null, "subsample_length": 1, "input_length": null, "nb_filter": 200}, "class_name": "Convolution1D"}]}, {"class_name": "Sequential", "config": [{"config": {"W_regularizer": null, "name": "embedding_1_tac_model", "dropout": 0.2, "input_dtype": "int32", "trainable": true, "init": "uniform", "output_dim": 52, "input_length": 140, "input_dim": 428669, "W_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 140], "mask_zero": false}, "class_name": "Embedding"}, {"config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"activation": "relu", "name": "convolution1d_1_tac_model", "b_regularizer": null, "filter_length": 6, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_constraint": null, "border_mode": "valid", "bias": true, "input_dim": null, "W_constraint": null, "subsample_length": 1, "input_length": null, "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "name": "maxpooling1d_1_tac_model", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "name": "convolution1d_2_tac_model", "b_regularizer": null, "filter_length": 6, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "uniform", "b_constraint": null, "border_mode": "valid", "bias": true, "input_dim": null, "W_constraint": null, "subsample_length": 1, "input_length": null, "nb_filter": 200}, "class_name": "Convolution1D"}]}], "mode_type": "raw", "mode": "concat", "output_shape": null, "concat_axis": -1, "dot_axes": -1}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_1", "b_regularizer": null, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 200, "b_constraint": null, "bias": true, "input_dim": null, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "softmax", "name": "dense_2", "b_regularizer": null, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 3, "b_constraint": null, "bias": true, "input_dim": null, "W_constraint": null, "activity_regularizer": null}}], "class_name": "Sequential", "keras_version": "1.1.1"}