{"config": [{"config": {"name": "merge_1", "concat_axis": -1, "dot_axes": -1, "mode_type": "raw", "mode": "concat", "output_shape": null, "output_shape_type": "raw", "layers": [{"config": [{"config": {"output_dim": 52, "W_regularizer": null, "trainable": true, "input_dtype": "int32", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dim": 428669, "name": "embedding_1_semeval_model", "W_constraint": null, "init": "uniform", "dropout": 0.2, "mask_zero": false, "input_length": 140}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"W_regularizer": null, "subsample_length": 1, "bias": true, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "name": "convolution1d_1_semeval_model", "W_constraint": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_semeval_model", "trainable": true, "border_mode": "valid", "pool_length": 4, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"W_regularizer": null, "subsample_length": 1, "bias": true, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "name": "convolution1d_2_semeval_model", "W_constraint": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_2_semeval_model", "trainable": true, "border_mode": "valid", "pool_length": 66, "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_semeval_model", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 200, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "name": "dense_1_semeval_model", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1_semeval_model", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1_semeval_model", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 3, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "name": "dense_2_semeval_model", "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}, {"config": [{"config": {"output_dim": 52, "W_regularizer": null, "trainable": true, "input_dtype": "int32", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dim": 428669, "name": "embedding_17_mpq_model", "W_constraint": null, "init": "uniform", "dropout": 0.2, "mask_zero": false, "input_length": 140}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"W_regularizer": null, "subsample_length": 1, "bias": true, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "name": "convolution1d_33_mpq_model", "W_constraint": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_33_mpq_model", "trainable": true, "border_mode": "valid", "pool_length": 4, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"W_regularizer": null, "subsample_length": 1, "bias": true, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "name": "convolution1d_34_mpq_model", "W_constraint": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_34_mpq_model", "trainable": true, "border_mode": "valid", "pool_length": 66, "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_17_mpq_model", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 200, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "name": "dense_33_mpq_model", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_17_mpq_model", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_17_mpq_model", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 3, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "name": "dense_34_mpq_model", "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}, {"config": [{"config": {"output_dim": 52, "W_regularizer": null, "trainable": true, "input_dtype": "int32", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dim": 1576890, "name": "embedding_1_dai_model", "W_constraint": null, "init": "uniform", "dropout": 0.2, "mask_zero": false, "input_length": 140}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"W_regularizer": null, "subsample_length": 1, "bias": true, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "name": "convolution1d_1_dai_model", "W_constraint": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_dai_model", "trainable": true, "border_mode": "valid", "pool_length": 4, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"W_regularizer": null, "subsample_length": 1, "bias": true, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "name": "convolution1d_2_dai_model", "W_constraint": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_2_dai_model", "trainable": true, "border_mode": "valid", "pool_length": 66, "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_dai_model", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 200, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "name": "dense_1_dai_model", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1_dai_model", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1_dai_model", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 3, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "name": "dense_2_dai_model", "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}, {"config": [{"config": {"output_dim": 52, "W_regularizer": null, "trainable": true, "input_dtype": "int32", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dim": 1576890, "name": "embedding_1_dil_model", "W_constraint": null, "init": "uniform", "dropout": 0.2, "mask_zero": false, "input_length": 140}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"W_regularizer": null, "subsample_length": 1, "bias": true, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "name": "convolution1d_1_dil_model", "W_constraint": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_dil_model", "trainable": true, "border_mode": "valid", "pool_length": 4, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"W_regularizer": null, "subsample_length": 1, "bias": true, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "name": "convolution1d_2_dil_model", "W_constraint": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_2_dil_model", "trainable": true, "border_mode": "valid", "pool_length": 66, "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_dil_model", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 200, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "name": "dense_1_dil_model", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1_dil_model", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1_dil_model", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 3, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "name": "dense_2_dil_model", "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}, {"config": [{"config": {"output_dim": 52, "W_regularizer": null, "trainable": true, "input_dtype": "int32", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dim": 428669, "name": "embedding_1_tac_model", "W_constraint": null, "init": "uniform", "dropout": 0.2, "mask_zero": false, "input_length": 140}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"W_regularizer": null, "subsample_length": 1, "bias": true, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "name": "convolution1d_1_tac_model", "W_constraint": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_tac_model", "trainable": true, "border_mode": "valid", "pool_length": 4, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"W_regularizer": null, "subsample_length": 1, "bias": true, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "name": "convolution1d_2_tac_model", "W_constraint": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_2_tac_model", "trainable": true, "border_mode": "valid", "pool_length": 66, "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_tac_model", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 200, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "name": "dense_1_tac_model", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1_tac_model", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1_tac_model", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 3, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "name": "dense_2_tac_model", "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}, {"config": [{"config": {"output_dim": 52, "W_regularizer": null, "trainable": true, "input_dtype": "int32", "activity_regularizer": null, "batch_input_shape": [null, 140], "input_dim": 1062158, "name": "embedding_1_hul_model", "W_constraint": null, "init": "uniform", "dropout": 0.2, "mask_zero": false, "input_length": 140}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"W_regularizer": null, "subsample_length": 1, "bias": true, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "name": "convolution1d_1_hul_model", "W_constraint": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_1_hul_model", "trainable": true, "border_mode": "valid", "pool_length": 4, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"W_regularizer": null, "subsample_length": 1, "bias": true, "filter_length": 6, "nb_filter": 200, "activation": "relu", "activity_regularizer": null, "name": "convolution1d_2_hul_model", "W_constraint": null, "init": "uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null, "border_mode": "valid", "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_2_hul_model", "trainable": true, "border_mode": "valid", "pool_length": 66, "stride": 66}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1_hul_model", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 200, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "name": "dense_1_hul_model", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1_hul_model", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1_hul_model", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 3, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "name": "dense_2_hul_model", "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}]}, "class_name": "Merge"}, {"config": {"output_dim": 256, "W_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "name": "dense_1", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 3, "W_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "name": "dense_2", "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}