{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Merge", "config": {"mode_type": "raw", "output_shape": null, "dot_axes": -1, "mode": "concat", "output_shape_type": "raw", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "activity_regularizer": null, "init": "uniform", "mask_zero": false, "input_dtype": "int32", "batch_input_shape": [null, 140], "trainable": true, "dropout": 0.2, "W_regularizer": null, "input_length": 140, "W_constraint": null, "input_dim": 1576890, "name": "embedding_1_dil_model"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_dil_model"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "activation": "relu", "subsample_length": 1, "b_regularizer": null, "b_constraint": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "trainable": true, "bias": true, "nb_filter": 200, "W_regularizer": null, "input_length": null, "W_constraint": null, "input_dim": null, "name": "convolution1d_1_dil_model"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_dil_model", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "activation": "relu", "subsample_length": 1, "b_regularizer": null, "b_constraint": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "trainable": true, "bias": true, "nb_filter": 200, "W_regularizer": null, "input_length": null, "W_constraint": null, "input_dim": null, "name": "convolution1d_2_dil_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "activity_regularizer": null, "init": "uniform", "mask_zero": false, "input_dtype": "int32", "batch_input_shape": [null, 140], "trainable": true, "dropout": 0.2, "W_regularizer": null, "input_length": 140, "W_constraint": null, "input_dim": 428669, "name": "embedding_1_semeval_model"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "activation": "relu", "subsample_length": 1, "b_regularizer": null, "b_constraint": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "trainable": true, "bias": true, "nb_filter": 200, "W_regularizer": null, "input_length": null, "W_constraint": null, "input_dim": null, "name": "convolution1d_1_semeval_model"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_semeval_model", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "activation": "relu", "subsample_length": 1, "b_regularizer": null, "b_constraint": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "trainable": true, "bias": true, "nb_filter": 200, "W_regularizer": null, "input_length": null, "W_constraint": null, "input_dim": null, "name": "convolution1d_2_semeval_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "activity_regularizer": null, "init": "uniform", "mask_zero": false, "input_dtype": "int32", "batch_input_shape": [null, 140], "trainable": true, "dropout": 0.2, "W_regularizer": null, "input_length": 140, "W_constraint": null, "input_dim": 428669, "name": "embedding_1_tac_model"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_tac_model"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "activation": "relu", "subsample_length": 1, "b_regularizer": null, "b_constraint": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "trainable": true, "bias": true, "nb_filter": 200, "W_regularizer": null, "input_length": null, "W_constraint": null, "input_dim": null, "name": "convolution1d_1_tac_model"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_tac_model", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "activation": "relu", "subsample_length": 1, "b_regularizer": null, "b_constraint": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "trainable": true, "bias": true, "nb_filter": 200, "W_regularizer": null, "input_length": null, "W_constraint": null, "input_dim": null, "name": "convolution1d_2_tac_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "activity_regularizer": null, "init": "uniform", "mask_zero": false, "input_dtype": "int32", "batch_input_shape": [null, 140], "trainable": true, "dropout": 0.2, "W_regularizer": null, "input_length": 140, "W_constraint": null, "input_dim": 428669, "name": "embedding_17_mpq_model"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_17_mpq_model"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "activation": "relu", "subsample_length": 1, "b_regularizer": null, "b_constraint": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "trainable": true, "bias": true, "nb_filter": 200, "W_regularizer": null, "input_length": null, "W_constraint": null, "input_dim": null, "name": "convolution1d_33_mpq_model"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_33_mpq_model", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "activation": "relu", "subsample_length": 1, "b_regularizer": null, "b_constraint": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "trainable": true, "bias": true, "nb_filter": 200, "W_regularizer": null, "input_length": null, "W_constraint": null, "input_dim": null, "name": "convolution1d_34_mpq_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "activity_regularizer": null, "init": "uniform", "mask_zero": false, "input_dtype": "int32", "batch_input_shape": [null, 140], "trainable": true, "dropout": 0.2, "W_regularizer": null, "input_length": 140, "W_constraint": null, "input_dim": 1062158, "name": "embedding_1_hul_model"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_hul_model"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "activation": "relu", "subsample_length": 1, "b_regularizer": null, "b_constraint": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "trainable": true, "bias": true, "nb_filter": 200, "W_regularizer": null, "input_length": null, "W_constraint": null, "input_dim": null, "name": "convolution1d_1_hul_model"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_hul_model", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "activation": "relu", "subsample_length": 1, "b_regularizer": null, "b_constraint": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "trainable": true, "bias": true, "nb_filter": 200, "W_regularizer": null, "input_length": null, "W_constraint": null, "input_dim": null, "name": "convolution1d_2_hul_model"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 52, "activity_regularizer": null, "init": "uniform", "mask_zero": false, "input_dtype": "int32", "batch_input_shape": [null, 140], "trainable": true, "dropout": 0.2, "W_regularizer": null, "input_length": 140, "W_constraint": null, "input_dim": 1576890, "name": "embedding_1_dai_model"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_dai_model"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "activation": "relu", "subsample_length": 1, "b_regularizer": null, "b_constraint": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "trainable": true, "bias": true, "nb_filter": 200, "W_regularizer": null, "input_length": null, "W_constraint": null, "input_dim": null, "name": "convolution1d_1_dai_model"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "pool_length": 4, "name": "maxpooling1d_1_dai_model", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "activation": "relu", "subsample_length": 1, "b_regularizer": null, "b_constraint": null, "init": "uniform", "border_mode": "valid", "filter_length": 6, "trainable": true, "bias": true, "nb_filter": 200, "W_regularizer": null, "input_length": null, "W_constraint": null, "input_dim": null, "name": "convolution1d_2_dai_model"}}]}], "name": "merge_1", "concat_axis": -1}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 200, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "activation": "linear", "W_constraint": null, "input_dim": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"output_dim": 3, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "activation": "softmax", "W_constraint": null, "input_dim": null, "name": "dense_2"}}]}