{"keras_version": "1.1.0", "config": [{"config": {"output_shape": null, "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "layers": [{"config": [{"config": {"dropout": 0.2, "input_dim": 1576890, "name": "embedding_1_dai_model", "input_length": 140, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "mask_zero": false, "W_constraint": null, "input_dtype": "int32", "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dai_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "bias": true, "subsample_length": 1, "border_mode": "valid", "name": "convolution1d_1_dai_model", "b_regularizer": null, "input_dim": null, "b_constraint": null, "init": "uniform", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "name": "maxpooling1d_1_dai_model", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "bias": true, "subsample_length": 1, "border_mode": "valid", "name": "convolution1d_2_dai_model", "b_regularizer": null, "input_dim": null, "b_constraint": null, "init": "uniform", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"dropout": 0.2, "input_dim": 1576890, "name": "embedding_1_dil_model", "input_length": 140, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "mask_zero": false, "W_constraint": null, "input_dtype": "int32", "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_dil_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "bias": true, "subsample_length": 1, "border_mode": "valid", "name": "convolution1d_1_dil_model", "b_regularizer": null, "input_dim": null, "b_constraint": null, "init": "uniform", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "name": "maxpooling1d_1_dil_model", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "bias": true, "subsample_length": 1, "border_mode": "valid", "name": "convolution1d_2_dil_model", "b_regularizer": null, "input_dim": null, "b_constraint": null, "init": "uniform", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"dropout": 0.2, "input_dim": 1062158, "name": "embedding_1_hul_model", "input_length": 140, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "mask_zero": false, "W_constraint": null, "input_dtype": "int32", "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_hul_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "bias": true, "subsample_length": 1, "border_mode": "valid", "name": "convolution1d_1_hul_model", "b_regularizer": null, "input_dim": null, "b_constraint": null, "init": "uniform", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "name": "maxpooling1d_1_hul_model", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "bias": true, "subsample_length": 1, "border_mode": "valid", "name": "convolution1d_2_hul_model", "b_regularizer": null, "input_dim": null, "b_constraint": null, "init": "uniform", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"dropout": 0.2, "input_dim": 428669, "name": "embedding_17_mpq_model", "input_length": 140, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "mask_zero": false, "W_constraint": null, "input_dtype": "int32", "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_17_mpq_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "bias": true, "subsample_length": 1, "border_mode": "valid", "name": "convolution1d_33_mpq_model", "b_regularizer": null, "input_dim": null, "b_constraint": null, "init": "uniform", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "bias": true, "subsample_length": 1, "border_mode": "valid", "name": "convolution1d_34_mpq_model", "b_regularizer": null, "input_dim": null, "b_constraint": null, "init": "uniform", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"dropout": 0.2, "input_dim": 428669, "name": "embedding_1_semeval_model", "input_length": 140, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "mask_zero": false, "W_constraint": null, "input_dtype": "int32", "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_semeval_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "bias": true, "subsample_length": 1, "border_mode": "valid", "name": "convolution1d_1_semeval_model", "b_regularizer": null, "input_dim": null, "b_constraint": null, "init": "uniform", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "bias": true, "subsample_length": 1, "border_mode": "valid", "name": "convolution1d_2_semeval_model", "b_regularizer": null, "input_dim": null, "b_constraint": null, "init": "uniform", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"dropout": 0.2, "input_dim": 428669, "name": "embedding_1_tac_model", "input_length": 140, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "mask_zero": false, "W_constraint": null, "input_dtype": "int32", "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_tac_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "bias": true, "subsample_length": 1, "border_mode": "valid", "name": "convolution1d_1_tac_model", "b_regularizer": null, "input_dim": null, "b_constraint": null, "init": "uniform", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "name": "maxpooling1d_1_tac_model", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "bias": true, "subsample_length": 1, "border_mode": "valid", "name": "convolution1d_2_tac_model", "b_regularizer": null, "input_dim": null, "b_constraint": null, "init": "uniform", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}, {"config": [{"config": {"dropout": 0.2, "input_dim": 1062158, "name": "embedding_1_jcr_model", "input_length": 140, "batch_input_shape": [null, 140], "init": "uniform", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "mask_zero": false, "W_constraint": null, "input_dtype": "int32", "output_dim": 52}, "class_name": "Embedding"}, {"config": {"name": "zeropadding1d_1_jcr_model", "padding": 5, "trainable": true}, "class_name": "ZeroPadding1D"}, {"config": {"nb_filter": 200, "bias": true, "subsample_length": 1, "border_mode": "valid", "name": "convolution1d_1_jcr_model", "b_regularizer": null, "input_dim": null, "b_constraint": null, "init": "uniform", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "name": "maxpooling1d_1_jcr_model", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "bias": true, "subsample_length": 1, "border_mode": "valid", "name": "convolution1d_2_jcr_model", "b_regularizer": null, "input_dim": null, "b_constraint": null, "init": "uniform", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "filter_length": 6, "W_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}], "class_name": "Sequential"}], "mode_type": "raw", "name": "merge_1", "concat_axis": -1}, "class_name": "Merge"}, {"config": {"border_mode": "valid", "name": "maxpooling1d_1", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"nb_filter": 200, "bias": true, "subsample_length": 1, "border_mode": "valid", "name": "convolution1d_1", "activity_regularizer": null, "input_dim": null, "b_constraint": null, "init": "uniform", "activation": "relu", "input_length": null, "b_regularizer": null, "filter_length": 6, "W_regularizer": null, "trainable": true, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"border_mode": "valid", "name": "maxpooling1d_2", "stride": 2, "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "activity_regularizer": null, "name": "dense_1", "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "input_dim": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 512}, "class_name": "Dense"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "activity_regularizer": null, "name": "dense_2", "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "softmax", "input_dim": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 3}, "class_name": "Dense"}], "class_name": "Sequential"}