{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "init": "uniform", "output_dim": 52, "name": "embedding_11", "W_constraint": null, "trainable": true, "dropout": 0.2, "W_regularizer": null, "batch_input_shape": [null, 140], "input_dtype": "int32", "activity_regularizer": null, "input_dim": 1576890, "mask_zero": false}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_11", "padding": 5, "trainable": true}}, {"class_name": "Convolution1D", "config": {"input_length": null, "filter_length": 6, "input_dim": null, "W_constraint": null, "b_constraint": null, "name": "convolution1d_21", "subsample_length": 1, "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "activation": "relu", "activity_regularizer": null, "border_mode": "valid", "init": "uniform", "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "border_mode": "valid", "stride": 2, "pool_length": 4, "name": "maxpooling1d_21"}}, {"class_name": "Convolution1D", "config": {"input_length": null, "filter_length": 6, "input_dim": null, "W_constraint": null, "b_constraint": null, "name": "convolution1d_22", "subsample_length": 1, "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "activation": "relu", "activity_regularizer": null, "border_mode": "valid", "init": "uniform", "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "border_mode": "valid", "stride": 66, "pool_length": 66, "name": "maxpooling1d_22"}}, {"class_name": "Flatten", "config": {"name": "flatten_11", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 200, "b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "name": "dense_21", "activity_regularizer": null, "activation": "linear", "input_dim": null}}, {"class_name": "Dropout", "config": {"name": "dropout_11", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 3, "b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "name": "dense_22", "activity_regularizer": null, "activation": "softmax", "input_dim": null}}]}