{"config": [{"config": {"W_constraint": null, "activity_regularizer": null, "input_dim": 1353244, "W_regularizer": null, "name": "embedding_1", "output_dim": 52, "batch_input_shape": [null, 140], "mask_zero": false, "init": "uniform", "input_dtype": "int32", "input_length": 140, "trainable": true, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "zeropadding1d_1", "padding": 5}, "class_name": "ZeroPadding1D"}, {"config": {"subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "input_length": null, "W_regularizer": null, "name": "convolution1d_1", "filter_length": 6, "init": "uniform", "input_dim": null, "b_constraint": null, "activation": "relu", "border_mode": "valid", "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "pool_length": 4, "border_mode": "valid", "stride": 2, "name": "maxpooling1d_1"}, "class_name": "MaxPooling1D"}, {"config": {"subsample_length": 1, "W_constraint": null, "activity_regularizer": null, "input_length": null, "W_regularizer": null, "name": "convolution1d_2", "filter_length": 6, "init": "uniform", "input_dim": null, "b_constraint": null, "activation": "relu", "border_mode": "valid", "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 200}, "class_name": "Convolution1D"}, {"config": {"trainable": true, "pool_length": 66, "border_mode": "valid", "stride": 66, "name": "maxpooling1d_2"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 200, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "bias": true, "name": "dense_1", "trainable": true}, "class_name": "Dense"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 3, "activation": "softmax", "init": "glorot_uniform", "b_constraint": null, "bias": true, "name": "dense_2", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.0"}