{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "dropout": 0.2, "mask_zero": false, "trainable": true, "batch_input_shape": [null, 140], "W_constraint": null, "name": "embedding_1", "W_regularizer": null, "input_length": 140, "input_dim": 1576890, "input_dtype": "int32", "init": "uniform", "output_dim": 52}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "bias": true, "activation": "relu", "border_mode": "valid", "init": "uniform", "name": "convolution1d_1", "W_regularizer": null, "input_length": null, "subsample_length": 1, "b_regularizer": null, "trainable": true, "input_dim": null, "filter_length": 6, "b_constraint": null, "W_constraint": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1", "trainable": true}}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "bias": true, "activation": "relu", "border_mode": "valid", "init": "uniform", "name": "convolution1d_2", "W_regularizer": null, "input_length": null, "subsample_length": 1, "b_regularizer": null, "trainable": true, "input_dim": null, "filter_length": 6, "b_constraint": null, "W_constraint": null, "nb_filter": 200}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 66, "stride": 66, "border_mode": "valid", "name": "maxpooling1d_2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "activation": "linear", "W_constraint": null, "name": "dense_1", "W_regularizer": null, "input_dim": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "output_dim": 200}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "activation": "softmax", "W_constraint": null, "name": "dense_2", "W_regularizer": null, "input_dim": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "output_dim": 3}}], "keras_version": "1.1.0"}