{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "dot_axes": -1, "mode": "concat", "mode_type": "raw", "output_shape": null, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_dai_model", "batch_input_shape": [null, 140], "W_constraint": null, "input_dim": 1576890, "input_dtype": "int32", "dropout": 0.2, "activity_regularizer": null, "init": "uniform", "W_regularizer": null, "trainable": true, "mask_zero": false, "input_length": 140, "output_dim": 52}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dai_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_dai_model", "filter_length": 6, "W_constraint": null, "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "bias": true, "init": "uniform", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_filter": 200, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dai_model", "trainable": true, "stride": 2, "pool_length": 4, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_dai_model", "filter_length": 6, "W_constraint": null, "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "bias": true, "init": "uniform", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_filter": 200, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dai_model", "trainable": true, "stride": 66, "pool_length": 66, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dai_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_semeval_model", "batch_input_shape": [null, 140], "W_constraint": null, "input_dim": 428669, "input_dtype": "int32", "dropout": 0.2, "activity_regularizer": null, "init": "uniform", "W_regularizer": null, "trainable": true, "mask_zero": false, "input_length": 140, "output_dim": 52}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_semeval_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_semeval_model", "filter_length": 6, "W_constraint": null, "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "bias": true, "init": "uniform", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_filter": 200, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_semeval_model", "trainable": true, "stride": 2, "pool_length": 4, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_semeval_model", "filter_length": 6, "W_constraint": null, "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "bias": true, "init": "uniform", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_filter": 200, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_semeval_model", "trainable": true, "stride": 66, "pool_length": 66, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1_semeval_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_tac_model", "batch_input_shape": [null, 140], "W_constraint": null, "input_dim": 428669, "input_dtype": "int32", "dropout": 0.2, "activity_regularizer": null, "init": "uniform", "W_regularizer": null, "trainable": true, "mask_zero": false, "input_length": 140, "output_dim": 52}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_tac_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_tac_model", "filter_length": 6, "W_constraint": null, "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "bias": true, "init": "uniform", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_filter": 200, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_tac_model", "trainable": true, "stride": 2, "pool_length": 4, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_tac_model", "filter_length": 6, "W_constraint": null, "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "bias": true, "init": "uniform", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_filter": 200, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_tac_model", "trainable": true, "stride": 66, "pool_length": 66, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1_tac_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_17_mpq_model", "batch_input_shape": [null, 140], "W_constraint": null, "input_dim": 428669, "input_dtype": "int32", "dropout": 0.2, "activity_regularizer": null, "init": "uniform", "W_regularizer": null, "trainable": true, "mask_zero": false, "input_length": 140, "output_dim": 52}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_17_mpq_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_33_mpq_model", "filter_length": 6, "W_constraint": null, "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "bias": true, "init": "uniform", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_filter": 200, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_33_mpq_model", "trainable": true, "stride": 2, "pool_length": 4, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_34_mpq_model", "filter_length": 6, "W_constraint": null, "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "bias": true, "init": "uniform", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_filter": 200, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_34_mpq_model", "trainable": true, "stride": 66, "pool_length": 66, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_17_mpq_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_dil_model", "batch_input_shape": [null, 140], "W_constraint": null, "input_dim": 1576890, "input_dtype": "int32", "dropout": 0.2, "activity_regularizer": null, "init": "uniform", "W_regularizer": null, "trainable": true, "mask_zero": false, "input_length": 140, "output_dim": 52}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_dil_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_dil_model", "filter_length": 6, "W_constraint": null, "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "bias": true, "init": "uniform", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_filter": 200, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_dil_model", "trainable": true, "stride": 2, "pool_length": 4, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_dil_model", "filter_length": 6, "W_constraint": null, "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "bias": true, "init": "uniform", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_filter": 200, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_dil_model", "trainable": true, "stride": 66, "pool_length": 66, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1_dil_model", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1_hul_model", "batch_input_shape": [null, 140], "W_constraint": null, "input_dim": 1062158, "input_dtype": "int32", "dropout": 0.2, "activity_regularizer": null, "init": "uniform", "W_regularizer": null, "trainable": true, "mask_zero": false, "input_length": 140, "output_dim": 52}}, {"class_name": "ZeroPadding1D", "config": {"name": "zeropadding1d_1_hul_model", "trainable": true, "padding": 5}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_1_hul_model", "filter_length": 6, "W_constraint": null, "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "bias": true, "init": "uniform", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_filter": 200, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1_hul_model", "trainable": true, "stride": 2, "pool_length": 4, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2_hul_model", "filter_length": 6, "W_constraint": null, "input_dim": null, "border_mode": "valid", "input_length": null, "b_constraint": null, "bias": true, "init": "uniform", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_filter": 200, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2_hul_model", "trainable": true, "stride": 66, "pool_length": 66, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1_hul_model", "trainable": true}}]}], "output_shape_type": "raw", "concat_axis": -1}}, {"class_name": "Dense", "config": {"name": "dense_1", "W_constraint": null, "input_dim": null, "output_dim": 1028, "b_constraint": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "W_constraint": null, "input_dim": null, "output_dim": 3, "b_constraint": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "softmax", "activity_regularizer": null}}]}