{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"mode_type": "raw", "concat_axis": -1, "output_shape": null, "output_shape_type": "raw", "dot_axes": -1, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "activity_regularizer": null, "W_constraint": null, "input_dtype": "int32", "mask_zero": false, "output_dim": 52, "W_regularizer": null, "dropout": 0.2, "input_dim": 1576890, "name": "embedding_1_dai_model", "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_dai_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "input_length": null, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "filter_length": 6, "nb_filter": 200, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "convolution1d_1_dai_model", "init": "uniform", "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_dai_model", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "input_length": null, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "filter_length": 6, "nb_filter": 200, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "convolution1d_2_dai_model", "init": "uniform", "subsample_length": 1}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "activity_regularizer": null, "W_constraint": null, "input_dtype": "int32", "mask_zero": false, "output_dim": 52, "W_regularizer": null, "dropout": 0.2, "input_dim": 1062158, "name": "embedding_1_hul_model", "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_hul_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "input_length": null, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "filter_length": 6, "nb_filter": 200, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "convolution1d_1_hul_model", "init": "uniform", "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_hul_model", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "input_length": null, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "filter_length": 6, "nb_filter": 200, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "convolution1d_2_hul_model", "init": "uniform", "subsample_length": 1}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "activity_regularizer": null, "W_constraint": null, "input_dtype": "int32", "mask_zero": false, "output_dim": 52, "W_regularizer": null, "dropout": 0.2, "input_dim": 428669, "name": "embedding_17_mpq_model", "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_17_mpq_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "input_length": null, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "filter_length": 6, "nb_filter": 200, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "convolution1d_33_mpq_model", "init": "uniform", "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_33_mpq_model", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "input_length": null, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "filter_length": 6, "nb_filter": 200, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "convolution1d_34_mpq_model", "init": "uniform", "subsample_length": 1}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "activity_regularizer": null, "W_constraint": null, "input_dtype": "int32", "mask_zero": false, "output_dim": 52, "W_regularizer": null, "dropout": 0.2, "input_dim": 428669, "name": "embedding_1_semeval_model", "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_semeval_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "input_length": null, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "filter_length": 6, "nb_filter": 200, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "convolution1d_1_semeval_model", "init": "uniform", "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_semeval_model", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "input_length": null, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "filter_length": 6, "nb_filter": 200, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "convolution1d_2_semeval_model", "init": "uniform", "subsample_length": 1}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 140], "trainable": true, "input_length": 140, "activity_regularizer": null, "W_constraint": null, "input_dtype": "int32", "mask_zero": false, "output_dim": 52, "W_regularizer": null, "dropout": 0.2, "input_dim": 428669, "name": "embedding_1_tac_model", "init": "uniform"}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "name": "zeropadding1d_1_tac_model", "trainable": true}}, {"class_name": "Convolution1D", "config": {"bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "input_length": null, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "filter_length": 6, "nb_filter": 200, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "convolution1d_1_tac_model", "init": "uniform", "subsample_length": 1}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 4, "border_mode": "valid", "name": "maxpooling1d_1_tac_model", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "input_length": null, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "filter_length": 6, "nb_filter": 200, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "name": "convolution1d_2_tac_model", "init": "uniform", "subsample_length": 1}}]}], "mode": "concat", "name": "merge_1"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "output_dim": 200, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"input_dim": null, "b_constraint": null, "trainable": true, "activation": "softmax", "output_dim": 3, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform"}}]}