{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"output_shape": null, "concat_axis": -1, "name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "mask_zero": false, "activity_regularizer": null, "W_constraint": null, "input_length": 140, "input_dtype": "int32", "input_dim": 1576890, "name": "embedding_1_dai_model", "init": "uniform", "batch_input_shape": [null, 140], "dropout": 0.2, "output_dim": 52, "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_dai_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "input_length": null, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_1_dai_model", "init": "uniform", "W_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "border_mode": "valid", "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "name": "maxpooling1d_1_dai_model", "pool_length": 4, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "input_length": null, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_2_dai_model", "init": "uniform", "W_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "border_mode": "valid", "b_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "mask_zero": false, "activity_regularizer": null, "W_constraint": null, "input_length": 140, "input_dtype": "int32", "input_dim": 1576890, "name": "embedding_1_dil_model", "init": "uniform", "batch_input_shape": [null, 140], "dropout": 0.2, "output_dim": 52, "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_dil_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "input_length": null, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_1_dil_model", "init": "uniform", "W_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "border_mode": "valid", "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "name": "maxpooling1d_1_dil_model", "pool_length": 4, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "input_length": null, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_2_dil_model", "init": "uniform", "W_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "border_mode": "valid", "b_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "mask_zero": false, "activity_regularizer": null, "W_constraint": null, "input_length": 140, "input_dtype": "int32", "input_dim": 1062158, "name": "embedding_1_hul_model", "init": "uniform", "batch_input_shape": [null, 140], "dropout": 0.2, "output_dim": 52, "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_hul_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "input_length": null, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_1_hul_model", "init": "uniform", "W_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "border_mode": "valid", "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "name": "maxpooling1d_1_hul_model", "pool_length": 4, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "input_length": null, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_2_hul_model", "init": "uniform", "W_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "border_mode": "valid", "b_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "mask_zero": false, "activity_regularizer": null, "W_constraint": null, "input_length": 140, "input_dtype": "int32", "input_dim": 428669, "name": "embedding_17_mpq_model", "init": "uniform", "batch_input_shape": [null, 140], "dropout": 0.2, "output_dim": 52, "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_17_mpq_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "input_length": null, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_33_mpq_model", "init": "uniform", "W_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "border_mode": "valid", "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "name": "maxpooling1d_33_mpq_model", "pool_length": 4, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "input_length": null, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_34_mpq_model", "init": "uniform", "W_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "border_mode": "valid", "b_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "mask_zero": false, "activity_regularizer": null, "W_constraint": null, "input_length": 140, "input_dtype": "int32", "input_dim": 428669, "name": "embedding_1_semeval_model", "init": "uniform", "batch_input_shape": [null, 140], "dropout": 0.2, "output_dim": 52, "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_semeval_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "input_length": null, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_1_semeval_model", "init": "uniform", "W_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "border_mode": "valid", "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "name": "maxpooling1d_1_semeval_model", "pool_length": 4, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "input_length": null, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_2_semeval_model", "init": "uniform", "W_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "border_mode": "valid", "b_constraint": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "mask_zero": false, "activity_regularizer": null, "W_constraint": null, "input_length": 140, "input_dtype": "int32", "input_dim": 428669, "name": "embedding_1_tac_model", "init": "uniform", "batch_input_shape": [null, 140], "dropout": 0.2, "output_dim": 52, "W_regularizer": null}}, {"class_name": "ZeroPadding1D", "config": {"trainable": true, "name": "zeropadding1d_1_tac_model", "padding": 5}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "input_length": null, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_1_tac_model", "init": "uniform", "W_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "border_mode": "valid", "b_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "name": "maxpooling1d_1_tac_model", "pool_length": 4, "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "trainable": true, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "input_length": null, "b_regularizer": null, "nb_filter": 200, "name": "convolution1d_2_tac_model", "init": "uniform", "W_regularizer": null, "bias": true, "filter_length": 6, "input_dim": null, "border_mode": "valid", "b_constraint": null}}]}], "mode": "concat", "mode_type": "raw", "dot_axes": -1, "output_shape_type": "raw"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "bias": true, "output_dim": 200, "input_dim": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "softmax", "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "bias": true, "output_dim": 3, "input_dim": null}}]}