{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"output_shape": null, "output_shape_type": "raw", "dot_axes": -1, "concat_axis": -1, "mode_type": "raw", "mode": "concat", "name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "output_dim": 52, "input_dtype": "int32", "W_constraint": null, "mask_zero": false, "name": "embedding_1_dai_model", "dropout": 0.2, "init": "uniform", "W_regularizer": null, "batch_input_shape": [null, 140], "trainable": true, "activity_regularizer": null, "input_dim": 1576890}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_dai_model"}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_length": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "name": "convolution1d_1_dai_model", "bias": true, "init": "uniform", "nb_filter": 200, "W_regularizer": null, "filter_length": 6, "subsample_length": 1, "trainable": true, "activity_regularizer": null, "b_constraint": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "name": "maxpooling1d_1_dai_model", "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_length": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "name": "convolution1d_2_dai_model", "bias": true, "init": "uniform", "nb_filter": 200, "W_regularizer": null, "filter_length": 6, "subsample_length": 1, "trainable": true, "activity_regularizer": null, "b_constraint": null, "input_dim": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "output_dim": 52, "input_dtype": "int32", "W_constraint": null, "mask_zero": false, "name": "embedding_1_hul_model", "dropout": 0.2, "init": "uniform", "W_regularizer": null, "batch_input_shape": [null, 140], "trainable": true, "activity_regularizer": null, "input_dim": 1062158}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_hul_model"}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_length": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "name": "convolution1d_1_hul_model", "bias": true, "init": "uniform", "nb_filter": 200, "W_regularizer": null, "filter_length": 6, "subsample_length": 1, "trainable": true, "activity_regularizer": null, "b_constraint": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "name": "maxpooling1d_1_hul_model", "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_length": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "name": "convolution1d_2_hul_model", "bias": true, "init": "uniform", "nb_filter": 200, "W_regularizer": null, "filter_length": 6, "subsample_length": 1, "trainable": true, "activity_regularizer": null, "b_constraint": null, "input_dim": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 140, "output_dim": 52, "input_dtype": "int32", "W_constraint": null, "mask_zero": false, "name": "embedding_1_semeval_model", "dropout": 0.2, "init": "uniform", "W_regularizer": null, "batch_input_shape": [null, 140], "trainable": true, "activity_regularizer": null, "input_dim": 1576890}}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1_semeval_model"}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_length": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "name": "convolution1d_1_semeval_model", "bias": true, "init": "uniform", "nb_filter": 200, "W_regularizer": null, "filter_length": 6, "subsample_length": 1, "trainable": true, "activity_regularizer": null, "b_constraint": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "name": "maxpooling1d_1_semeval_model", "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_length": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "name": "convolution1d_2_semeval_model", "bias": true, "init": "uniform", "nb_filter": 200, "W_regularizer": null, "filter_length": 6, "subsample_length": 1, "trainable": true, "activity_regularizer": null, "b_constraint": null, "input_dim": null}}]}]}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "name": "maxpooling1d_1", "trainable": true, "pool_length": 4}}, {"class_name": "Convolution1D", "config": {"border_mode": "valid", "input_length": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "name": "convolution1d_1", "bias": true, "init": "uniform", "nb_filter": 200, "W_regularizer": null, "filter_length": 6, "subsample_length": 1, "trainable": true, "activity_regularizer": null, "b_constraint": null, "input_dim": null}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "name": "maxpooling1d_2", "trainable": true, "pool_length": 4}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "output_dim": 200, "b_regularizer": null, "W_constraint": null, "name": "dense_1", "bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"activation": "softmax", "output_dim": 3, "b_regularizer": null, "W_constraint": null, "name": "dense_2", "bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": null}}]}